[
    {
        "dialogue_id": "1_00000",
        "service": "Restaurants_2",
        "service_call": {
            "method": {
                "method": "ReserveRestaurant",
                "parameters": {
                    "date": "2019-03-01",
                    "location": "San Jose",
                    "number_of_seats": "2",
                    "restaurant_name": "Sino",
                    "time": "11:30"
                }
            }
        },
        "user_utterance": [
            "I want to make a restaurant reservation for 2 people at half past 11 in the morning.",
            "Please find restaurants in San Jose. Can you try Sino?",
            "Yes, thanks. What's their phone number?",
            "What's their address? Do they have vegetarian options on their menu?",
            "Thanks very much.",
            "No, that's all. Thanks."
        ],
        "system_utterance": [
            "What city do you want to dine in? Do you have a preferred restaurant?",
            "Confirming: I will reserve a table for 2 people at Sino in San Jose. The reservation time is 11:30 am today.",
            "Your reservation has been made. Their phone number is 408-247-8880.",
            "The street address is 377 Santana Row #1000. They have good vegetarian options.",
            "Is there anything else I can help you with?",
            "Have a great day."
        ]
    },
    {
        "dialogue_id": "1_00001",
        "service": "Restaurants_2",
        "service_call": {
            "method": {
                "method": "ReserveRestaurant",
                "parameters": {
                    "date": "2019-03-04",
                    "location": "Saratoga",
                    "number_of_seats": "1",
                    "restaurant_name": "Rosie Mccann's Irish Pub & Restaurant",
                    "time": "11:30"
                }
            }
        },
        "user_utterance": [
            "I am not in the mood to cook today. I want to eat out at a restaurant instead.",
            "Look for a restaurant in Saratoga. Check to see if I can have a table for 1 at Sipan for 11:30.",
            "I would like to book at table at Rosie Mccann's for March 2nd.",
            "I want the eat there on the 4th of this month.",
            "That would be fine. Is the restaurant costly?",
            "No thanks. You have been very helpful."
        ],
        "system_utterance": [
            "Which area would you like me to look in? Which restaurant would you like to eat in and at what time?",
            "You would like a table for 1 person for today at 11:30 am at the Sipan Peruvian Restaurant & Bar in Saratoga?",
            "You would like me to book a table at Rosie Mccann's Irish Pub & Restaurant for tomorrow?",
            "You would like to reserve a table for 11:30 am for next Monday?",
            "My apologies. The reservation was unsuccessful. Is there anything else I can assist you with?",
            "Enjoy your day."
        ]
    },
    {
        "dialogue_id": "1_00002",
        "service": "Restaurants_2",
        "service_call": {
            "method": {
                "method": "ReserveRestaurant",
                "parameters": {
                    "date": "2019-03-01",
                    "location": "San Francisco",
                    "number_of_seats": "2",
                    "restaurant_name": "Bourbon Steak Restaurant",
                    "time": "13:00"
                }
            }
        },
        "user_utterance": [
            "I want to reserve a table at a restaurant, specifically Bourbon Steak.",
            "Find Bourbon Steaks in San Francisco please.",
            "Please do it for one in the afternoon.",
            "Yes, that is correct.",
            "Thanks for your help. That will be it."
        ],
        "system_utterance": [
            "Which location of Bourbon Steak do you want to save a table?",
            "What time do you want to book the table for?",
            "Okay. Just to be clear, you want a table at Bourbon Steak Restaurant in San Francisco for 2 people today at 1 pm.",
            "Alright. Your reservation has been made.",
            "Have a great day."
        ]
    },
    {
        "dialogue_id": "1_00003",
        "service": "Restaurants_2",
        "service_call": {
            "method": {
                "method": "ReserveRestaurant",
                "parameters": {
                    "date": "2019-03-01",
                    "location": "San Mateo",
                    "number_of_seats": "1",
                    "restaurant_name": "Andes Cafe San Mateo",
                    "time": "11:15"
                }
            }
        },
        "user_utterance": [
            "I would like to make a restaurant reservation at morning 11:15.",
            "Can I get a reservation at Andes Cafe?",
            "Find a restaurant in San Mateo.",
            "The reservation is just for 1 person.",
            "That is correct.",
            "Not at this time."
        ],
        "system_utterance": [
            "Which restaurant do you want to go to?",
            "Which location do you want to get the reservation at?",
            "Please confirm you want to make a reservation for 2 people today at 11:15 am at Andes Cafe San Mateo in San Mateo.",
            "Please confirm you want a reservation for 1 person today.",
            "The reservation could not be made. Do you want to make a reservation for 1 person today at 11 am at Andes Cafe San Mateo?",
            "See you soon!"
        ]
    },
    {
        "dialogue_id": "1_00004",
        "service": "Restaurants_2",
        "service_call": {
            "method": {
                "method": "ReserveRestaurant",
                "parameters": {
                    "date": "2019-03-05",
                    "location": "San Jose",
                    "number_of_seats": "2",
                    "restaurant_name": "Ludwig's German Table",
                    "time": "18:30"
                }
            }
        },
        "user_utterance": [
            "I want to make a dinner reservation on March 5th.",
            "I want a restaurant in San Jose, for 18:30, please.",
            "Can you get me a table at Ludwig's German Table?",
            "Yes, that's right.",
            "What type of food do they serve, and what's the address?",
            "Thanks. That's all."
        ],
        "system_utterance": [
            "What area are you looking in? What time do you want the reservation for?",
            "Which restaurant do you want to book a table at?",
            "So you want a table for 2 people next Tuesday at 6:30 pm at Ludwig's German Table in San Jose?",
            "Your table has been reserved.",
            "They serve German food. They are located at 261 North 2nd Street.",
            "Have a nice day."
        ]
    },
    {
        "dialogue_id": "1_00005",
        "service": "Restaurants_2",
        "service_call": {
            "method": {
                "method": "ReserveRestaurant",
                "parameters": {
                    "date": "2019-03-01",
                    "location": "Napa",
                    "number_of_seats": "4",
                    "restaurant_name": "The Big 4",
                    "time": "12:45"
                }
            }
        },
        "user_utterance": [
            "I want to make a reservation at a restaurant.",
            "Can you look at Villa Romano in Napa?",
            "Try for afternoon 12:45.",
            "Make it for 4 people.",
            "Actually, can we change it to Big 4.",
            "Yes, that's right.",
            "No, that's it."
        ],
        "system_utterance": [
            "Okay, I can do that. Is there a particular restaurant that you wish to visit?",
            "Yes. What time?",
            "No problem, please confirm: reservation for 2 at Villa Romano in Napa, today at 12:45 pm.",
            "Okay, please confirm: reservation for 4 people at Villa Romano.",
            "Please confirm: table for 4 people at The Big 4.",
            "I'm sorry, I couldn't make that reservation for you. Is there anything else I can help you with today?",
            "Have a great day."
        ]
    },
    {
        "dialogue_id": "1_00006",
        "service": "Restaurants_2",
        "service_call": {
            "method": {
                "method": "ReserveRestaurant",
                "parameters": {
                    "date": "2019-03-01",
                    "location": "Livermore",
                    "number_of_seats": "2",
                    "restaurant_name": "Simply Fondue",
                    "time": "13:00"
                }
            }
        },
        "user_utterance": [
            "I need to taste good food , i am very much eager to taste different food varieties from my normal routine food. Will you book a table at a restaurant?",
            "Find restaurants in SFO and at time 13:00 ? Can you try booking a table at Tuba?",
            "No Find restaurants in Livermore and Book a table at simply fondue?",
            "Ok That's correct.",
            "Thanks a lot for your help. thats all i need"
        ],
        "system_utterance": [
            "At which location i should search for and at what time i need to book a table ? whether any special restaurant you like to book a table?",
            "ok please check and review the details for confirmation. Table need to be booked at Tuba Authentic Turkish Restaurant in the city San francisco at time 1 pm and number of people is 2 for the date is today.",
            "Ok please once again check and review the following details. Table need to be booked at Simply Fondue at the city Livermore.",
            "Reservation is successful.",
            "Take care have a great day"
        ]
    },
    {
        "dialogue_id": "1_00007",
        "service": "Restaurants_2",
        "service_call": {
            "method": {
                "method": "ReserveRestaurant",
                "parameters": {
                    "date": "2019-03-08",
                    "location": "San Francisco",
                    "number_of_seats": "4",
                    "restaurant_name": "Zaoh",
                    "time": "12:00"
                }
            }
        },
        "user_utterance": [
            "I want to go out to eat somewhere.",
            "I want a restaurant in SF. I heard that a place called Zaoh is really good. I wonder if it has any free seats?",
            "I'd love to go there for lunch, so 12 o\"clock in the afternoon.",
            "No. The reservation should be for 4 people, and it should be for the 8th of this month.",
            "Yeah. I wonder what I should wear? Is Zaoh an ultra high-end restaurant?",
            "That's all, thanks."
        ],
        "system_utterance": [
            "Do you know what restaurant you would like to go to? Or at least what city you want to eat in?",
            "What time would you like to eat there at?",
            "You want to make a reservation for 2 at Zaoh in San Francisco for 12 pm today. Is that correct?",
            "You want me to book a table for next Friday for 4?",
            "Sorry, I can't book a table for you. Do you need anything else?",
            "Enjoy your day."
        ]
    },
    {
        "dialogue_id": "1_00008",
        "service": "Restaurants_2",
        "service_call": {
            "method": {
                "method": "ReserveRestaurant",
                "parameters": {
                    "date": "2019-03-01",
                    "location": "San Jose",
                    "number_of_seats": "2",
                    "restaurant_name": "House Of Genji",
                    "time": "18:15"
                }
            }
        },
        "user_utterance": [
            "I'd like to make a restaurant reservation.",
            "It's called House Of Genji and you can look for it in San Jose. I want the reservation for evening 6:15.",
            "Yeah, that's right. Do they do outdoor seating?",
            "That won't work for me.",
            "No, thanks a lot."
        ],
        "system_utterance": [
            "What's the restaurant, where is it located, and what time would you like the reservation for?",
            "I'll make a reservation for House Of Genji in San Jose today at 6:15 pm for 2 people, is that correct?",
            "They don't have outdoor seating. I also was not able to make the reservation. How about today at 6 pm for 2 people at House Of Genji instead?",
            "Do you any other kinds of help from me?",
            "Okay, have a pleasant day."
        ]
    },
    {
        "dialogue_id": "1_00009",
        "service": "Restaurants_2",
        "service_call": {
            "method": {
                "method": "ReserveRestaurant",
                "parameters": {
                    "date": "2019-03-14",
                    "location": "Livermore",
                    "number_of_seats": "2",
                    "restaurant_name": "Mcdonald's",
                    "time": "12:30"
                }
            }
        },
        "user_utterance": [
            "I wanna book a restaurant reservation on the 14th of March",
            "Can you find me a table at Mcdonald's",
            "Try for 12:30",
            "Find me one in Livermore",
            "Yes that works, but do they have vegetarian options?",
            "What is their phone number and address?",
            "Thank you so much, that's it for now."
        ],
        "system_utterance": [
            "What restaurant do you want?",
            "What time do you want me to reserve?",
            "Which branch do you want?",
            "There's a Mcdonald's in Livermore than I can reserve at 12:30 pm for 2 people on March 14th.",
            "Your reservation is made, and no they don't have any vegetarian options unfortunately.",
            "It's 925-961-9090 and it's at 805 North Vasco Road",
            "Sure thing, have a good one"
        ]
    },
    {
        "dialogue_id": "1_00010",
        "service": "Restaurants_2",
        "service_call": {
            "method": {
                "method": "ReserveRestaurant",
                "parameters": {
                    "date": "2019-03-06",
                    "location": "Livermore",
                    "number_of_seats": "3",
                    "restaurant_name": "Mai Vietnamese Cuisine",
                    "time": "17:15"
                }
            }
        },
        "user_utterance": [
            "I want to book a table at a restaurant. Is there anything available at Uncle Yu's. I don't care what date.",
            "Please look in Livermore for a reservation at 7 in the evening. I'd prefer Wednesday next week.",
            "Sorry, please make it 3 people. Can you look at Mai instead?",
            "Yes, that's correct.",
            "Can you try again? This time look for 5:15 pm.",
            "Yes, please. What type of food is on their menu? Do they have vegetarian options?",
            "No, that's all. Thanks."
        ],
        "system_utterance": [
            "Which location do you want? What time would you prefer?",
            "Confirming: I'm booking a table for 2 at Uncle Yu's At The Vineyard in Livermore, for next Wednesday at 7 pm.",
            "Please confirm: I am booking a table for 3 people at Mai Vietnamese Cuisine.",
            "Sorry, there are no tables available at that time. Can I help you with anything more?",
            "Confirming: I am booking a table for 3 people at Mai Vietnamese Cuisine in Livermore, at 5:15 pm next Wednesday.",
            "Sorry, I was not able to make that reservation. Anything else I can do for you?",
            "Have a good day."
        ]
    },
    {
        "dialogue_id": "1_00011",
        "service": "Restaurants_2",
        "service_call": {
            "method": {
                "method": "ReserveRestaurant",
                "parameters": {
                    "date": "2019-03-14",
                    "location": "Castro Valley",
                    "number_of_seats": "2",
                    "restaurant_name": "Isushi",
                    "time": "19:30"
                }
            }
        },
        "user_utterance": [
            "Can you book a table at a restaurant?",
            "I would like a table at the Tacolicious in San Jose for 7:30 in the evening.",
            "Can you find a table at Isushi in Castro Valley instead please?",
            "Can you make it for the 14th of this month please?",
            "Yes, that is perfect.",
            "Thank you for your assistance.",
            "No, that is all thank you."
        ],
        "system_utterance": [
            "Sure, in which city and which restaurant?",
            "Confirm: table for 2 at Tacolicious in San Jose for 7:30 pm today.",
            "Booking a table at Isushi in Castro Valley.",
            "Yes, the date is March 14th in Castro Valley.",
            "Your reservation was made.",
            "Is there anything else you need?",
            "Have a good day."
        ]
    },
    {
        "dialogue_id": "1_00012",
        "service": "Restaurants_2",
        "service_call": {
            "method": {
                "method": "ReserveRestaurant",
                "parameters": {
                    "date": "2019-03-01",
                    "location": "San Jose",
                    "number_of_seats": "2",
                    "restaurant_name": "Lalla Grill",
                    "time": "18:30"
                }
            }
        },
        "user_utterance": [
            "I need help with a reservation in a restaurant.",
            "It's for 6:45 in the evening.",
            "Look around San Jose.",
            "Yes, go for Lalla.",
            "Yes, you can proceed.",
            "Yes, try that.",
            "That's wonderful.",
            "No I don't, thank you."
        ],
        "system_utterance": [
            "What is the time of your reservation?",
            "Where do I have to look for your restaurant?",
            "Do you have a favorite restaurant in mind?",
            "Read the data and give me the green light. You are looking for a table for 2 at Lalla Grill in San Jose for today at 6:45 pm",
            "Unfortunately, I can't do that. Do you want me to see if there's a table for 2 available at Lalla Grill today at 6:30 pm?",
            "This time you got it!",
            "Do you still need me?",
            "Enjoy your evening out. Bye."
        ]
    },
    {
        "dialogue_id": "1_00013",
        "service": "Restaurants_2",
        "service_call": {
            "method": {
                "method": "ReserveRestaurant",
                "parameters": {
                    "date": "2019-03-01",
                    "location": "Sunnyvale",
                    "number_of_seats": "4",
                    "restaurant_name": "Taverna Bistro",
                    "time": "17:45"
                }
            }
        },
        "user_utterance": [
            "Can You help me in booking a table for four people at a restaurant?",
            "Can you look for Taverna restaurant in Sunnyvale?",
            "Book the table for evening 5:45.",
            "Yes, That sounds good to me.",
            "No. Don't do thst.",
            "No. That will be all. Thank you."
        ],
        "system_utterance": [
            "Do you have a preference in restaurants?",
            "What time would you like me to reserve the table for?",
            "Please confirm: You want me to reserve a table for 4 people at Taverna Bistro in Sunnyvale for today at 5:45 pm.",
            "Regretfully I would like you to inform you that your reservation at Taverna Bistro was made. Do you want me to try for 4 people for today at 6 pm?",
            "Is there anything else I can help you with?",
            "I am glad I could help. Have a nice day."
        ]
    },
    {
        "dialogue_id": "1_00014",
        "service": "Restaurants_2",
        "service_call": {
            "method": {
                "method": "ReserveRestaurant",
                "parameters": {
                    "date": "2019-03-01",
                    "location": "Livermore",
                    "number_of_seats": "2",
                    "restaurant_name": "Kiku Sushi",
                    "time": "12:00"
                }
            }
        },
        "user_utterance": [
            "Please make a dinner reservation in Livermore.",
            "I like Sai's T.",
            "12:00 please.",
            "I changed my mind. How about Kiku restaurant.",
            "Exactly. What food type is on the menu?",
            "No, that's all."
        ],
        "system_utterance": [
            "Which venue do you prefer?",
            "What time?",
            "I understand I am making reservations today for 2 at Sai's T Restaurant in Livermore at 12 pm.",
            "You want a table for 2 today at Kiku Sushi. Is that right?",
            "Making a reservation was not posible. Is there something else you need?",
            "Have a lovely day."
        ]
    },
    {
        "dialogue_id": "1_00015",
        "service": "Restaurants_2",
        "service_call": {
            "method": {
                "method": "ReserveRestaurant",
                "parameters": {
                    "date": "2019-03-03",
                    "location": "Berkeley",
                    "number_of_seats": "2",
                    "restaurant_name": "Royal Rangoon Restaurant",
                    "time": "12:00"
                }
            }
        },
        "user_utterance": [
            "Can you help me reserve a table at a restaurant? I'd like to book at Royal Rangoon.",
            "I'd like the reservation at quarter to 12 in the morning. The restaurant is in Berkeley.",
            "No, I'd like to reserve it on the 3rd of this month.",
            "Yes, that sounds correct. What's the restaurant's rating, and what kind of food do they serve?",
            "Yes, sounds good.",
            "Thank you.",
            "No, thank you."
        ],
        "system_utterance": [
            "What time would you like your reservation to be? Which city is the restaurant in?",
            "So you would like a reservations for 2 at the Royal Rangoon Restaurant in Berkeley? The reservation is today is at 11:45 am.",
            "So you'd like to make a reservation at Royal Rangoon Restaurant the day after tomorrow?",
            "Sorry, I wasn't able to make a reservation. Royal Rangoon Restaurant serves Chinese food and their rating is around 4.5. Should I try to make a reservation for 2 at 12 pm on the day after tomorrow?",
            "Your reservation is confirmed.",
            "Is there anything else I can help with?",
            "Have a nice day."
        ]
    },
    {
        "dialogue_id": "1_00016",
        "service": "Restaurants_2",
        "service_call": {
            "method": {
                "method": "ReserveRestaurant",
                "parameters": {
                    "date": "2019-03-01",
                    "location": "San Francisco",
                    "number_of_seats": "2",
                    "restaurant_name": "Kittea Cat Cafe",
                    "time": "19:00"
                }
            }
        },
        "user_utterance": [
            "I am making dinner plans with a friend and would like to book a table at a restaurant.",
            "The reservation will be for 7 in the evening for a restaurant in SFO.",
            "Can you try to book it for Kittea Cat?",
            "Yes, that is correct.",
            "Thank you. That is all I need for now."
        ],
        "system_utterance": [
            "Which location shall I search and what time would you like the reservation for?",
            "Which restaurant would you like?",
            "You would like a reservation for 2 at at Kittea Cat Cafe in San Francisco for today at 7 pm. Is that correct?",
            "The reservation was successful.",
            "My pleasure. Have a great day."
        ]
    },
    {
        "dialogue_id": "1_00017",
        "service": "Restaurants_2",
        "service_call": {
            "method": {
                "method": "ReserveRestaurant",
                "parameters": {
                    "date": "2019-03-11",
                    "location": "Albany",
                    "number_of_seats": "2",
                    "restaurant_name": "Rokko",
                    "time": "14:00"
                }
            }
        },
        "user_utterance": [
            "I'd like to book a restaurant table.",
            "Look for restaurants in Albany.",
            "I want to try out Kathmandu Restaurant.",
            "Make it at two pm.",
            "No, actually I want a table on the 11th of March. Would you try booking at Rokko?",
            "Yes, that is fine. Is the restaurant pricey?",
            "No, that is all."
        ],
        "system_utterance": [
            "Where should I look?",
            "Is there a particular restaurant you would like to book at?",
            "What time do you want the reservation to be?",
            "Okay, please confirm these details. You would like to book a table at Kathmandu Restaurant in Albany for 2 people. This reservation is for 2 pm today.",
            "Okay, so you would like me to book a table at Rokko for March 11th?",
            "Sorry, I could not make a reservation. Do you need help with something else?",
            "Have a great day."
        ]
    },
    {
        "dialogue_id": "1_00018",
        "service": "Restaurants_2",
        "service_call": {
            "method": {
                "method": "ReserveRestaurant",
                "parameters": {
                    "date": "2019-03-01",
                    "location": "San Francisco",
                    "number_of_seats": "2",
                    "restaurant_name": "El Tesoro Taqueria & Grill",
                    "time": "11:45"
                }
            }
        },
        "user_utterance": [
            "I'd like to find a table for a restaurant in SFO.",
            "I'd like to go to El Tesoro at 11:45 am.",
            "Works for me, do they have vegetarian options?",
            "Thank you very much.",
            "Nope, thank you so much."
        ],
        "system_utterance": [
            "Okay, which restaurant would you like to look at, and when would you like to go?",
            "Please confirm: You'd like a table at El Tesoro Taqueria & grill in San Francisco for 2 people at 11:45 am today.",
            "Reservation made, and yes, they do.",
            "Do you need anything else?",
            "Have a great day."
        ]
    },
    {
        "dialogue_id": "1_00019",
        "service": "Restaurants_2",
        "service_call": {
            "method": {
                "method": "ReserveRestaurant",
                "parameters": {
                    "date": "2019-03-02",
                    "location": "Rohnert Park",
                    "number_of_seats": "1",
                    "restaurant_name": "Tonayan",
                    "time": "12:30"
                }
            }
        },
        "user_utterance": [
            "I haven't eaten there for a while. Can you make a reservation for me at that restaurant for 12:30 pm.",
            "Ah, sorry. I want to go to Tonayan in Rohnert Park. I need a reservation for three people.",
            "Actually, I just remembered my friends aren't big fans of Mexican food, so I'll only need a reservation for one. I'll go somewhere else with them today, so can you book me a table for tomorrow, on the 2nd of March?",
            "Yeah, that's right.",
            "Thanks a lot. I don't need anything else."
        ],
        "system_utterance": [
            "Sure, but what restaurant are you talking about? And what city is it in?",
            "You want a reservation at Tonayan in Rohnert Park for 3 at 12:30 pm today. Is that correct?",
            "Sure. You want a table for 1 at Tonayan tomorrow?",
            "Your table has been booked.",
            "Enjoy your day."
        ]
    },
    {
        "dialogue_id": "1_00020",
        "service": "Restaurants_2",
        "service_call": {
            "method": {
                "method": "ReserveRestaurant",
                "parameters": {
                    "date": "2019-03-03",
                    "location": "Albany",
                    "number_of_seats": "2",
                    "restaurant_name": "Dickey's Barbecue Pit",
                    "time": "12:30"
                }
            }
        },
        "user_utterance": [
            "Can you make me a restaurant reservation?",
            "Can you make one for 7:15 pm",
            "Find one in San Jose",
            "Try to book me a table at Tanchito's on March 8th please",
            "Yes that's food, what kind of cuisine is that?",
            "Can you book another table? Find places in Albany.",
            "No, try the 3rd of March",
            "Yes that's good, do they have outdoor seating?",
            "Try to book again but at 12:30 pm",
            "Actually I changed my mind, let's try Dickey's",
            "Yes that's good",
            "No nothing else for now, thanks for trying"
        ],
        "system_utterance": [
            "What time do you want a table for?",
            "Which city are you interested in?",
            "What restaurant would you like to make a reservation at?",
            "So a 7:15 pm table for 2 at Tanchito's Restaurant in San Jose next Friday?",
            "Sorry I couldn't book a table actually, can I do anyth`ing else?",
            "How about the Tanchito's Restaurant in Albany next Friday at 7:15 pm for 2?",
            "Confirming that you want a table at Tanchito's Restaurant for the day after tomorrow",
            "Sorry I couldn't book that either, what else can I do?",
            "Confirming that you want a 12:30 pm table for 2 at Tanchito's Restaurant in Albany for the day after tomorrow yes?",
            "OK, so a table for 2 at Dickey's Barbecue Pit?",
            "Sorry I couldn't book that either, what else can I do?",
            "OK, take care"
        ]
    },
    {
        "dialogue_id": "1_00021",
        "service": "Restaurants_2",
        "service_call": {
            "method": {
                "method": "ReserveRestaurant",
                "parameters": {
                    "date": "2019-03-08",
                    "location": "Oakland",
                    "number_of_seats": "2",
                    "restaurant_name": "Koryo Sushi",
                    "time": "13:00"
                }
            }
        },
        "user_utterance": [
            "I would like to eat something in a restaurant on the 8th of this month.",
            "Yes, 1 in the afternoon is fine.",
            "Yes, see if there's room at Koryo.",
            "It's in Oakland.",
            "Yes, can you send me the address? Can you also provide me the ratings?",
            "Thanks a lot, I'm done."
        ],
        "system_utterance": [
            "Have you thought about the time you want to be there?",
            "Do you have a favorite restaurant?",
            "Where is it located?",
            "Confirm your request. You need to make a reservation for 2 at Koryo Sushi in Oakland at 1 pm next friday.",
            "The reservation has been made. The restaurant is in 4390 Telegraph avenue D and the rating is around 4.0",
            "Bye sir."
        ]
    },
    {
        "dialogue_id": "1_00022",
        "service": "Restaurants_2",
        "service_call": {
            "method": {
                "method": "ReserveRestaurant",
                "parameters": {
                    "date": "2019-03-01",
                    "location": "San Francisco",
                    "number_of_seats": "1",
                    "restaurant_name": "Sakana Sushi Bar & Grill",
                    "time": "18:45"
                }
            }
        },
        "user_utterance": [
            "Hi i need a help, One of my friends coming to this city for meet me, I am looking to book a table at a restaurant for him?",
            "book at 6:45 pm",
            "Try to book a table at Sakana Sushi in SF",
            "no, book for only one people",
            "Yes, that's right, what is the address of the restaurant?",
            "Ok, Could you give their phone number?",
            "thank you very much for your help, That's all i need.",
            "No, thanks, bye"
        ],
        "system_utterance": [
            "Sure, I will help you, at what time should i try to book for?",
            "Which city should i search in? Which restaurant do you want to book a table at?",
            "please confirm the following details: Booking a table at Sakana Sushi bar & Grill at San francisco on today 6:45 pm, The reservation for 2 people",
            "please confirm the following details: The reservation is at 6:45 pm and the reservation for 1 people",
            "Congrats, your reservation is successful, Restaurant address is 605 Post Street",
            "Sure, Their phone number is 415-775-7644",
            "you are welcome, Shall i help you with anything more?",
            "Have a wonderful day, bye"
        ]
    },
    {
        "dialogue_id": "1_00023",
        "service": "Restaurants_2",
        "service_call": {
            "method": {
                "method": "ReserveRestaurant",
                "parameters": {
                    "date": "2019-03-01",
                    "location": "Oakland",
                    "number_of_seats": "2",
                    "restaurant_name": "Sidebar",
                    "time": "19:00"
                }
            }
        },
        "user_utterance": [
            "Today is my wedding anniversary and I want to book a table at a restaurant as a surprise to my wife.",
            "I would like it to be close to my wife's office in Oakland.",
            "Yes, Sidebar is her favorite restaurant so let's book the table there at seven in the evening.",
            "Yes, that's perfect. She will be so surprised.",
            "Thank you for your help, I couldn't have done it with out you."
        ],
        "system_utterance": [
            "I am happy to help. What area would you like me to search for restaurants in?",
            "Do you have a specific restaurant in mind and what time would you like me to set the reservations for?",
            "Okay, before I make those arrangements for you please confirm that the details I have are correct. You want a table for 2 at Sidebar, located in Oakland, today at 7 pm. Is that correct?",
            "I have confirmed those reservations for you and you should be all set for this evening.",
            "Have a great day and enjoy your meal."
        ]
    },
    {
        "dialogue_id": "1_00024",
        "service": "Restaurants_2",
        "service_call": {
            "method": {
                "method": "ReserveRestaurant",
                "parameters": {
                    "date": "2019-03-01",
                    "location": "Lafayette",
                    "number_of_seats": "2",
                    "restaurant_name": "The Cooperage American Grille",
                    "time": "11:45"
                }
            }
        },
        "user_utterance": [
            "I have a plan to eat outside for which I need some nice restaurant. Please help me to book a table.",
            "I like to eat at some nice place in Lafayette.",
            "11:45 in the morning is the convenient time for me and make the booking accordingly.",
            "Yes, try to book a table in The Cooperage, that was the nice place.",
            "Yes, that is great. continue.",
            "Thanks and that's all."
        ],
        "system_utterance": [
            "What is your desired location to eat?",
            "Let me know your convenient time to eat, so that I can search according to you.",
            "Any preferred restaurant?",
            "Please confirm to book a table for 2 in The Cooperage American Grille in Lafayette at 11:45 am today.",
            "Your reservation was successfully made at this place.",
            "Have a great day."
        ]
    },
    {
        "dialogue_id": "1_00025",
        "service": "Restaurants_2",
        "service_call": {
            "method": {
                "method": "ReserveRestaurant",
                "parameters": {
                    "date": "2019-03-12",
                    "location": "Walnut Creek",
                    "number_of_seats": "2",
                    "restaurant_name": "Vanessa's Bistro 2 Vietnamese Restaurant",
                    "time": "18:15"
                }
            }
        },
        "user_utterance": [
            "Man, I'm starving. I'd love to have a hearty meal out tonight. Can you reserve me a restaurant at 6 in the evening?",
            "I'd like for you to check out what's available in Walnut Creek. I'd particularly like it if you could book me a table at Vanessa's Bistro 2.",
            "Actually, make it at 18:15 on the 12th.",
            "That sounds right. Also, I'm a vegetarian. Does their menu have options that will be okay for me?",
            "Can I have my meal outdoors at Vanessa's?",
            "Thanks for the answer.",
            "Not for anything else right now. Many thanks."
        ],
        "system_utterance": [
            "Do you have a specific restaurant in mind? Where should I search?",
            "Okay then. You want to reserve a table for 2 at Vanessa's Bistro 2 Vietnamese Restaurant in Walnut Creek, at 6 pm today?",
            "Okay. The reservation should instead be at 6:15 pm on March 12th?",
            "You have successfully booked a table. Vanessa's Bistro 2 does have vegetarian meals.",
            "Unfortunately, you cannot.",
            "How else can I assist you?",
            "Hope you enjoy your meal at Vanessa's."
        ]
    },
    {
        "dialogue_id": "1_00026",
        "service": "Restaurants_2",
        "service_call": {
            "method": {
                "method": "ReserveRestaurant",
                "parameters": {
                    "date": "2019-03-07",
                    "location": "Danville",
                    "number_of_seats": "3",
                    "restaurant_name": "Blue Gingko Blackhawk",
                    "time": "17:00"
                }
            }
        },
        "user_utterance": [
            "I'd like to make a restaurant reservation, can you help me?",
            "The restaurant is Blue Gingko Blackhawk. Look for it in Danville. The reservation is for next Monday at 5:30 in the evening for one person.",
            "No, sorry. It's for 3 people for next Thursday.",
            "Yes, that's right. Do you know if they have outdoor seating, and what's a phone number I can reach them at?",
            "Yeah, try that.",
            "Thanks a lot, I don't need any more help."
        ],
        "system_utterance": [
            "What restaurant do you need the reservation for? Also, what time is the reservation and where is the restaurant located?",
            "Okay, please confirm this for me, I'll make a reservation for 1 person at Blue Gingko Blackhawk in Danville next Monday at 5:30 pm?",
            "Okay, so it's for 3 people next Thursday, is that right?",
            "They have outdoor seating available and you can reach them at 925-648-7838 by phone. I'm sorry I couldn't make the reservation. Do you want me to try to make a reservation at 5 pm next Thursday for 3 people at Blue Gingko Blackhawk?",
            "I've made the reservation for you.",
            "Have a good rest of your day then."
        ]
    },
    {
        "dialogue_id": "1_00027",
        "service": "Restaurants_2",
        "service_call": {
            "method": {
                "method": "ReserveRestaurant",
                "parameters": {
                    "date": "2019-03-01",
                    "location": "San Francisco",
                    "number_of_seats": "3",
                    "restaurant_name": "Hakka Restaurant",
                    "time": "17:00"
                }
            }
        },
        "user_utterance": [
            "I want to book a table in a restaurant for 3 people",
            "I am interested in San Francisco. Can you please try booking a table at Hakka.",
            "Please book at evening 4:45.",
            "This is perfect. Does the restaurant have vegetarians options on the menu and can you provide me their address?",
            "yes that is perfect.",
            "Thanks a lot",
            "No, thanks a lot."
        ],
        "system_utterance": [
            "Which is the restaurant you like and the location?",
            "What is your timing?",
            "Please give confirmation details: Booking a table for 3 people at Hakka restaurant at 4:45 pm today in the city of San Francisco.",
            "Sorry, your booking can not be done and the hotel does not provide vegetarian option. Their address is 4401 Cabrillo Street. Should i book for 3 people today at 5 pm as Hakka restaurant is nice.",
            "Your booking has been done.",
            "Do you need any help from me?",
            "Have a great day."
        ]
    },
    {
        "dialogue_id": "1_00028",
        "service": "Restaurants_2",
        "service_call": {
            "method": {
                "method": "ReserveRestaurant",
                "parameters": {
                    "date": "2019-03-01",
                    "location": "San Francisco",
                    "number_of_seats": "1",
                    "restaurant_name": "The Grill",
                    "time": "17:30"
                }
            }
        },
        "user_utterance": [
            "Let's do some restaurant exploring right now. I need a nice, ambient dining spot for a business meeting. Let's get a reservation booked and checked off my to-do list, please.",
            "You're right on it, aren't you? That's great. Let's book a table at a restaurant in San Fran for 5:30 in the evening. Oh, wait. I remember the name of the restaurant I'm looking for. It's called The City.",
            "Uh, hold that, please. I've got to change the reservation to one person. And, what's my chance of getting a table at The Grill instead?",
            "Yes, you have my approval to do it now. And, I need the phone number, too.",
            "Well, I guess we'll have to table that and I'll let you know later. Thanks so much."
        ],
        "system_utterance": [
            "Okay, I can help you with that. Do you want me to find a particular restaurant at a specific location? And, what is the time you want for the reservation?",
            "Got it. A table is being reserved for 2 persons at The City Taqueria in San Francisco for today at 5:30 pm. Shall I confirm that for you?",
            "A table is being reserved for 1 person at The Grill. Do you approve of that?",
            "Apologies. Your table could not be booked at this time. Would you like any other assistance?",
            "Of course. Enjoy your day."
        ]
    },
    {
        "dialogue_id": "1_00029",
        "service": "Flights_3",
        "service_call": {
            "method": {
                "method": "SearchOnewayFlight",
                "parameters": {
                    "departure_date": "2019-03-03",
                    "destination_city": "Seattle",
                    "origin_city": "Vancouver"
                }
            }
        },
        "user_utterance": [
            "Could you help me search for a one way flight?",
            "I will be departing from Vancouver on the 3rd of March.",
            "I will be flying to Seattle.",
            "That sounds great.",
            "No need, thank you."
        ],
        "system_utterance": [
            "Where and when do you intend to depart?",
            "Where do you plan to travel to?",
            "I managed to find 4 flights for you, one of which is an Air Canada flight with 1 layover and will depart at 4:20 am which will set you back $322.",
            "Could I further assist you?",
            "Sure, have a great day ahead!"
        ]
    },
    {
        "dialogue_id": "1_00030",
        "service": "Flights_3",
        "service_call": {
            "method": {
                "method": "SearchOnewayFlight",
                "parameters": {
                    "departure_date": "2019-03-07",
                    "destination_city": "San Diego",
                    "origin_city": "Mexico City"
                }
            }
        },
        "user_utterance": [
            "I'm looking for one way flights out of Mexico City.",
            "Leaving the 7th of this month to San Diego.",
            "Thanks, that's all I need for now."
        ],
        "system_utterance": [
            "Departure date and destination?",
            "I found 3 flights. There's an American Airlines flight with 1 layover leaving at 11:40 am for $273.",
            "Have a nice day."
        ]
    },
    {
        "dialogue_id": "1_00031",
        "service": "Flights_3",
        "service_call": {
            "method": {
                "method": "SearchOnewayFlight",
                "parameters": {
                    "departure_date": "2019-03-06",
                    "destination_city": "New York",
                    "flight_class": "Economy",
                    "number_checked_bags": "0",
                    "origin_city": "Seattle"
                }
            }
        },
        "user_utterance": [
            "I want to find a flight, I have zero bags to check in.",
            "I'm leaving from Seattle on the 6th.",
            "I'm traveling to the city of Atlanta.",
            "Find me another flight in Economy class please.",
            "When does the flight arrive to the destination?",
            "Find me something to New York.",
            "That is all I need."
        ],
        "system_utterance": [
            "Where are you traveling and what city are you departing from?",
            "What city are you traveling to?",
            "I found 5 flights. There is Alaska Airlines departs at 6:35 am and has 0 layover. The ticket is $181.",
            "There is a flight with American Airlines departs a 10:35 am and has 0 layover. The ticket is $184.",
            "The flight arrives at 7:07 pm local time the same day.",
            "There is 3 flights. Do you like Delta Airlines departs 8:05 am and has 1 layover. The ticket is $298.",
            "Have a good day."
        ]
    },
    {
        "dialogue_id": "1_00032",
        "service": "Flights_3",
        "service_call": {
            "method": {
                "method": "SearchOnewayFlight",
                "parameters": {
                    "airlines": "United Airlines",
                    "departure_date": "2019-03-12",
                    "destination_city": "Las Vegas",
                    "number_checked_bags": "0",
                    "origin_city": "Phoenix"
                }
            }
        },
        "user_utterance": [
            "I am searching for a one way flight.",
            "I am leaving from Phoenix and going to Las Vegas on the 12th. I have 0 checked bags.",
            "Search for something else.",
            "When will the flight arrive in Las Vegas?",
            "What airport does the flight leave from and land?",
            "Search for something else. I want to go on United Airlines.",
            "Okay.",
            "No, that is it but I appreciate the help."
        ],
        "system_utterance": [
            "Which city do you want to depart from and where are you heading? On which date would you like to travel?",
            "I have 4 flights. What do you think about American Airlines? This flight leaves at 10:10 am and has 0 layovers. This ticket is $80 per passenger.",
            "How about Delta Airlines? This flight leaves at 2:25 pm and has 0 layovers. It costs $85 per person.",
            "The flight will arrive at 3:39 pm local time.",
            "The flight leaves Sky Harbor International Airport and will arrive at McCarran International Airport.",
            "I have 1 flight that you may like. What about United Airlines? This flight leaves at 9:35 pm local time with 0 layovers. The ticket is $84 per person.",
            "Do you need something else?",
            "Have a great day."
        ]
    },
    {
        "dialogue_id": "1_00033",
        "service": "Flights_3",
        "service_call": {
            "method": {
                "method": "SearchOnewayFlight",
                "parameters": {
                    "airlines": "Delta Airlines",
                    "departure_date": "2019-03-05",
                    "destination_city": "Atlanta",
                    "number_checked_bags": "0",
                    "origin_city": "Washington"
                }
            }
        },
        "user_utterance": [
            "Can you help me find a one way flight, preferably on Delta Airlines.",
            "I'm going to Atlanta, and I have 0 bags I need to check.",
            "I want to leave on next Tuesday.",
            "I'll be leaving from Washington.",
            "Okay.",
            "No, thanks for the help."
        ],
        "system_utterance": [
            "Where are you heading to?",
            "And on what date will you be traveling?",
            "And where will you be leaving from?",
            "There's 1 flight I found. It leaves at 6:25 pm, has 0 layovers and is on Delta Airlines. It will be $109 per passenger.",
            "Do you need help with anything else?",
            "Have a good rest of your day."
        ]
    },
    {
        "dialogue_id": "1_00034",
        "service": "Flights_3",
        "service_call": {
            "method": {
                "method": "SearchOnewayFlight",
                "parameters": {
                    "airlines": "Alaska Airlines",
                    "departure_date": "2019-03-11",
                    "destination_city": "New York",
                    "origin_city": "San Francisco"
                }
            }
        },
        "user_utterance": [
            "I'm looking for a one way flight with Alaska Airlines.",
            "I want to fly from San Francisco on the 11th of March.",
            "I want to go to New York.",
            "That's great thanks for your help."
        ],
        "system_utterance": [
            "When will you be travelling and what city will you be departing from?",
            "What is your destination?",
            "So for confirmation: You would like to fly with Alaska Airlines, the flight leaves at 10:20 pm and there are 0 layovers. The total cost for this flight is $216.",
            "Enjoy your day."
        ]
    },
    {
        "dialogue_id": "1_00035",
        "service": "Flights_3",
        "service_call": {
            "method": {
                "method": "SearchOnewayFlight",
                "parameters": {
                    "departure_date": "2019-03-03",
                    "destination_city": "Seattle",
                    "flight_class": "Economy",
                    "origin_city": "London",
                    "passengers": "1"
                }
            }
        },
        "user_utterance": [
            "Hi I'm travelling and I need a one way flight for 1.",
            "I'd like to go to Seattle on the 11th from London.",
            "Is there anything else? I'd like to fly out on the 3rd of March in Economy class.",
            "That works.",
            "That's all, thank you."
        ],
        "system_utterance": [
            "What city are you departing from and on what day? Where are you going?",
            "I found 3 flights that might work for you. How does American Airlines sound? The flight will leave at 6:55 am and has 1 layover. The cost is $402 per person.",
            "I found 2 flights that might work. How does Delta Airlines sound? The flight leaves at 11:50 am and the cost is $413 per person. There is 1 layover.",
            "Do you need anything else?",
            "Enjoy your day!"
        ]
    },
    {
        "dialogue_id": "1_00036",
        "service": "Flights_3",
        "service_call": {
            "method": {
                "method": "SearchOnewayFlight",
                "parameters": {
                    "departure_date": "2019-03-08",
                    "destination_city": "Washington",
                    "flight_class": "Economy",
                    "origin_city": "Atlanta"
                }
            }
        },
        "user_utterance": [
            "There is a meeting for me where I want reach by flight. Can you search an Economy class for one way?",
            "To Washington on the 8th from Atlanta.",
            "Ok, Search for any other flights.",
            "No, look for some other?",
            "What is the reaching time? How many checked bags can I take?",
            "Great , thank you.",
            "No, that's all."
        ],
        "system_utterance": [
            "Which place you wish to go to? The date and departing port also please.",
            "4 flights are for you. You may choose American Airlines at 9:40 am with 0 stops and ticket fare is $119.",
            "Do you like Delta Airlines takes off at 5:55 pm with 0 layovers and cost is $106?",
            "Southwest Airlines, takes off at 4:35 am with 0 stops and fare is $101. Do you prefer it?",
            "You can take 0 checked bags. It will take you to the destination 6:26 am local time.",
            "Do you need any other help?",
            "Have a wonderful day."
        ]
    },
    {
        "dialogue_id": "1_00037",
        "service": "Flights_3",
        "service_call": {
            "method": {
                "method": "SearchOnewayFlight",
                "parameters": {
                    "departure_date": "2019-03-04",
                    "destination_city": "Portland",
                    "origin_city": "Phoenix"
                }
            }
        },
        "user_utterance": [
            "I need a one way flight from Phoenix to Portland.",
            "I need to leave next Monday.",
            "How many passengers is the reservation for? Is the ticket in Premium Economy.",
            "Ok, that is fine.",
            "No, that is all."
        ],
        "system_utterance": [
            "What day are you leaving?",
            "I found a flight with American Airlines that leaves at 9:30 am with 1 layover. The ticket price is $260.",
            "The ticket is an Economy seat for 1 passenger.",
            "Is there anything else?",
            "Have a great day."
        ]
    },
    {
        "dialogue_id": "1_00038",
        "service": "Flights_3",
        "service_call": {
            "method": {
                "method": "SearchOnewayFlight",
                "parameters": {
                    "airlines": "Delta Airlines",
                    "departure_date": "2019-03-07",
                    "destination_city": "Washington",
                    "origin_city": "Chicago"
                }
            }
        },
        "user_utterance": [
            "Book me a flight. Make it one-way on Delta Airlines",
            "Leaving from Chicago on the 7th of March",
            "I need to go to Washington",
            "Thanks. That's helpful"
        ],
        "system_utterance": [
            "Departing from where? When would you like to go?",
            "And flying where?",
            "I found 1 flight on Delta Airlines. It has 0 stops and departs at 2:30 pm for $109 per passenger",
            "Take care"
        ]
    },
    {
        "dialogue_id": "1_00039",
        "service": "Flights_3",
        "service_call": {
            "method": {
                "method": "SearchOnewayFlight",
                "parameters": {
                    "departure_date": "2019-03-03",
                    "destination_city": "Chicago",
                    "origin_city": "London"
                }
            }
        },
        "user_utterance": [
            "Can you help me find a one way flight?",
            "I'd like to fly from London to Chicago on March 3rd.",
            "Do you have other options?",
            "Thanks, that's all I needed."
        ],
        "system_utterance": [
            "Where are you leaving from, and when? What is your destination?",
            "I've found 4 possible flights. How about American Airlines? The flight is at 2:25 am and has 0 connections. The ticket costs $235.",
            "How about British Airways? The flight is at 11 pm and has 0 connections. The ticket costs $243.",
            "Have a nice day."
        ]
    },
    {
        "dialogue_id": "1_00040",
        "service": "Flights_3",
        "service_call": {
            "method": {
                "method": "SearchOnewayFlight",
                "parameters": {
                    "departure_date": "2019-03-01",
                    "destination_city": "London",
                    "origin_city": "Washington"
                }
            }
        },
        "user_utterance": [
            "I need to attend a business meeting and i wish to travel . Will you find a one way flight?",
            "i wish to travel from city washington to London , on date the 1st.",
            "All right . Thanks a lot for your immense help."
        ],
        "system_utterance": [
            "In which city you wish to depart from and on which date you wish to travel ? To which place are you planning to go?",
            "there are 4 flights according to your interest. Whether you like to fly with American airlines? Flight takes off at 1 pm local time and itinerary has 1 layovers and its costs $303 per passsenger.",
            "take care have a great day."
        ]
    },
    {
        "dialogue_id": "1_00041",
        "service": "Flights_3",
        "service_call": {
            "method": {
                "method": "SearchOnewayFlight",
                "parameters": {
                    "airlines": "American Airlines",
                    "departure_date": "2019-03-11",
                    "destination_city": "Mexico City",
                    "origin_city": "Seattle"
                }
            }
        },
        "user_utterance": [
            "I'd like to find a one way flight.",
            "I want to fly to Mexico City from Seattle on the 11th of March.",
            "I'd rather fly with United Airlines.",
            "Can you find me a flight with American Airlines instead?",
            "Are two checked bags allowed?",
            "How many passengers did you get this for?",
            "All right. Thanks, that's all I need."
        ],
        "system_utterance": [
            "Where would you like to leave from and where do you want to go? What date would you like to travel?",
            "Would you like to fly with Alaska Airlines at for $306? The flight takes off at 6:25 pm and has 1 layover.",
            "I found a flight with United Airlines for $284. The flight takes off at 3:05 pm and has 1 layover.",
            "I found a flight with American Airlines for $287. The flight takes off at 1:40 pm and has 1 layover.",
            "0 checked bags are allowed.",
            "This is for 1 passanger.",
            "Have a great day!"
        ]
    },
    {
        "dialogue_id": "1_00042",
        "service": "Flights_3",
        "service_call": {
            "method": {
                "method": "SearchOnewayFlight",
                "parameters": {
                    "departure_date": "2019-03-07",
                    "destination_city": "San Diego",
                    "origin_city": "Mexico City"
                }
            }
        },
        "user_utterance": [
            "I will be having a flight trip, and I am in need of a ticket for a one way flight to San Diego.",
            "I will be departing on Thursday next week and the location from where I will start my trip is Mexico City.",
            "That suits me well.",
            "Nothing. I appreciate your help."
        ],
        "system_utterance": [
            "Can you tell me the date when you will take the flight, and from where will you depart for the flight?",
            "I see that 3 flights match your request. How would you consider having a flight which leaves at 11:40 am with 1 layover and is with American Airlines? The ticket for this flight will be costing $273 per passenger.",
            "Is there something else I could help you with?",
            "Have a wonderful day!"
        ]
    },
    {
        "dialogue_id": "1_00043",
        "service": "Flights_3",
        "service_call": {
            "method": {
                "method": "SearchOnewayFlight",
                "parameters": {
                    "departure_date": "2019-03-13",
                    "destination_city": "Chicago",
                    "flight_class": "Economy",
                    "origin_city": "Atlanta"
                }
            }
        },
        "user_utterance": [
            "I'm going to travel pretty soon. I'd like to find a one-way flight.",
            "I will be departing on March 13th.",
            "My flight should go from Atlanta to Chicago.",
            "I'd rather find another flight. Make sure it has economy class tickets.",
            "It doesn't sound that great. I want to have another option.",
            "7:50 pm is kind of late. Will the flight arrive the next day? How many passengers is this for?",
            "Okay. Got it.",
            "Not at the moment. Thanks."
        ],
        "system_utterance": [
            "On what date will you travel?",
            "Where you be flying from and to?",
            "How about an American Airlines flight? It takes off at 6:05 am, has 0 layovers, and a ticket costs $116 per passenger.",
            "Does Delta Airlines sound good to you? It takes off at 11:20 am, has 0 layovers, and a ticket for it costs $106 per passenger.",
            "United Airlines might appeal to you. Its flight takes off at 7:50 pm, it has 0 layovers, and a ticket will cost you $120.",
            "Actually, the flight will still arrive on the same day. This will be for 1 passenger.",
            "Is there any other matter where I can help you?",
            "Hope you enjoy your time at Chicago!"
        ]
    },
    {
        "dialogue_id": "1_00044",
        "service": "Flights_3",
        "service_call": {
            "method": {
                "method": "SearchOnewayFlight",
                "parameters": {
                    "airlines": "Alaska Airlines",
                    "departure_date": "2019-03-07",
                    "destination_city": "Phoenix",
                    "number_checked_bags": "0",
                    "origin_city": "San Diego"
                }
            }
        },
        "user_utterance": [
            "Hi, could you help me search for a one-way Alaska Airlines flight?",
            "I would like to depart from San Diego.",
            "I would like to travel to Phoenix on March 7th with 0 check in bags.",
            "I see, that's all I need, thanks!"
        ],
        "system_utterance": [
            "Where would you like to depart from?",
            "Where is your preferred date and location of travel?",
            "There is an Alaska Airlines flight costing $97 per passenger, which takes off at 10:55 pm with 0 layovers.",
            "No worries, have a great day ahead."
        ]
    },
    {
        "dialogue_id": "1_00045",
        "service": "Flights_3",
        "service_call": {
            "method": {
                "method": "SearchOnewayFlight",
                "parameters": {
                    "departure_date": "2019-03-04",
                    "destination_city": "Paris",
                    "origin_city": "Chicago"
                }
            }
        },
        "user_utterance": [
            "I'm planning a trip, can you help find me a flight?",
            "I'm going next Monday and I want to go to Paris! Can you look at flights from Chicago?",
            "Does it leave from Chicago? And when does it arrive?",
            "Cool, thank you. That was all, I don't need anything else."
        ],
        "system_utterance": [
            "Sure, when are you going? And where are you flying from and to?",
            "Of course. There's an American Airlines flight for $402, it only has 1 stop and leaves at 2:40 pm",
            "It leaves from O'Hare International Airport and arrives in Paris the next day",
            "No problem, have a lovely day!"
        ]
    },
    {
        "dialogue_id": "1_00046",
        "service": "Flights_3",
        "service_call": {
            "method": {
                "method": "SearchOnewayFlight",
                "parameters": {
                    "departure_date": "2019-03-03",
                    "destination_city": "Vancouver",
                    "number_checked_bags": "0",
                    "origin_city": "Phoenix"
                }
            }
        },
        "user_utterance": [
            "I need a one way flight on any airline. I have 0 bags for check in.",
            "I am going to Vancouver from Phoenix, on the 3rd.",
            "Look for something else.",
            "Look for something else.",
            "Where will the flight land and where does the flight leave from?",
            "Great.",
            "No, that is all but thank you."
        ],
        "system_utterance": [
            "What date do you want to travel and where will you be going? What city do you want to leave from?",
            "I have 3 flights that should work. How about American Airlines? The flight leaves at 9:30 am local time and has 1 layover. The ticket costs $246 per person.",
            "How about a 9:55 am flight with Southwest Airlines? This flight has 1 layover and costs $251 per person.",
            "WOuld you like a flight on United Airlines that leaves at 9:40 am local time? It has 1 layover and costs $235.",
            "The flight leaves from Sky Harbor International Airport and goes to YVR International Airport.",
            "Do you need any other assistance?",
            "Have a great day."
        ]
    },
    {
        "dialogue_id": "1_00047",
        "service": "Flights_3",
        "service_call": {
            "method": {
                "method": "SearchOnewayFlight",
                "parameters": {
                    "airlines": "Alaska Airlines",
                    "departure_date": "2019-03-13",
                    "destination_city": "Phoenix",
                    "origin_city": "San Francisco"
                }
            }
        },
        "user_utterance": [
            "Hi, could you help me search for one-way flights with Alaska Airlines?",
            "I will be departing from San Francisco on 13th of this month.",
            "Phoenix would be great.",
            "May I know where does the flight land?",
            "What is the flight arrival time at the destination and how many check bags am I allowed to bring up?",
            "I see, thank you.",
            "Nope, thanks for your help though."
        ],
        "system_utterance": [
            "What is your intended date and location of departure?",
            "Any preference on your destination?",
            "Would you like to fly with Alaska Airlines which will depart at 4:10 pm with 0 layovers and will cost you $131 per passenger.",
            "The flight will land a Sky Harbor International Airport",
            "You are allowed to bring up 0 checked bags, and you will arrive at 6:17 pm local time.",
            "Do you require further assistance?",
            "No worries, have a great day!"
        ]
    },
    {
        "dialogue_id": "1_00048",
        "service": "Flights_3",
        "service_call": {
            "method": {
                "method": "SearchOnewayFlight",
                "parameters": {
                    "departure_date": "2019-03-05",
                    "destination_city": "San Francisco",
                    "flight_class": "Economy",
                    "origin_city": "Washington"
                }
            }
        },
        "user_utterance": [
            "I have a plan for a short trip and I want to search for Economy class tickets in an one way flight. Please search for some flights.",
            "I want the flights from Washington to San Francisco.",
            "on next Tuesday, please search accordingly.",
            "Will the flight allow zero checked bags?",
            "That is fine, that's all for now. Thanks."
        ],
        "system_utterance": [
            "From where and to which place your are planning for a visit?",
            "Let me know the date of your trip.",
            "Found 4 results. A flight with American Airlines which takes off at 4:10 am local time is okay for you? the itinerary has 1 layovers and the ticket cost is $300 per person. What about your opinion?",
            "Yes, they allow 0 checked bags.",
            "Have a great day."
        ]
    },
    {
        "dialogue_id": "1_00049",
        "service": "Flights_3",
        "service_call": {
            "method": {
                "method": "SearchOnewayFlight",
                "parameters": {
                    "departure_date": "2019-03-11",
                    "destination_city": "Seattle",
                    "origin_city": "Vancouver"
                }
            }
        },
        "user_utterance": [
            "I need help booking a one way flight to Seattle.",
            "I'm departing on the 11th.",
            "I need a flight from Vancouver.",
            "Will it arrive the day after or the same day?",
            "Let's find something else.",
            "Can I check two bags?",
            "Okay.",
            "No that's all, thank you."
        ],
        "system_utterance": [
            "What date are you traveling?",
            "What city are you departing from?",
            "There are 4 flights that would work. Air Canada has a flight that departs at 4:20 am and has 1 layover. The price is $277 per person.",
            "The flight arrives on the same day.",
            "American Airlines has a flight leaving at 1:30 am local time with 1 layover. The cost is $287 per person.",
            "No, 0 checked bags are allowed.",
            "Is there anything else I can help you with?",
            "Have a great day!"
        ]
    },
    {
        "dialogue_id": "1_00050",
        "service": "Flights_3",
        "service_call": {
            "method": {
                "method": "SearchOnewayFlight",
                "parameters": {
                    "departure_date": "2019-03-07",
                    "destination_city": "Seattle",
                    "number_checked_bags": "0",
                    "origin_city": "New York"
                }
            }
        },
        "user_utterance": [
            "I'm looking for one way flights with 0 bags checked in.",
            "New York.",
            "Going to Seattle next Thursday.",
            "That sounds good. That's all I need for now."
        ],
        "system_utterance": [
            "Departure city?",
            "Destination and dates of travel?",
            "There's an American Airlines flight with 1 layover leaving 6:50 pm for $296.",
            "Have a nice day."
        ]
    },
    {
        "dialogue_id": "1_00051",
        "service": "Flights_3",
        "service_call": {
            "method": {
                "method": "SearchOnewayFlight",
                "parameters": {
                    "departure_date": "2019-03-13",
                    "destination_city": "Washington",
                    "flight_class": "Economy",
                    "origin_city": "Atlanta"
                }
            }
        },
        "user_utterance": [
            "I'd like to find Economy class tickets for a one way flight.",
            "I'd like to fly out on the 13th of this month.",
            "Find me flights leaving out of Atlanta.",
            "I'll be flying to Washington.",
            "Yes that's fine, thanks. That will be all"
        ],
        "system_utterance": [
            "Okay, what date are you departing?",
            "What city are you departing from?",
            "Okay, what is your destination?",
            "Would you like to fly with American Airlines? The flight leaves at 9:40 am local time and has 0 layovers. The ticket will cost $110 per passenger.",
            "Thank you, have a good day."
        ]
    },
    {
        "dialogue_id": "1_00052",
        "service": "Flights_3",
        "service_call": {
            "method": {
                "method": "SearchOnewayFlight",
                "parameters": {
                    "departure_date": "2019-03-07",
                    "destination_city": "Seattle",
                    "origin_city": "Toronto",
                    "passengers": "1"
                }
            }
        },
        "user_utterance": [
            "I would like to book a flight one way, just 1 seat.",
            "I'm flying to Seattle on March 7th.",
            "I'm looking for flight from Toronto.",
            "That is all the information I needed."
        ],
        "system_utterance": [
            "What date are you traveling and where are you going?",
            "Which city are you departing from?",
            "There is a flight with Air Canada that departs at 5:35 pm and has 1 layover. The cost is $283.",
            "Have a good day."
        ]
    },
    {
        "dialogue_id": "1_00053",
        "service": "Flights_3",
        "service_call": {
            "method": {
                "method": "SearchOnewayFlight",
                "parameters": {
                    "departure_date": "2019-03-03",
                    "destination_city": "Chicago",
                    "flight_class": "Economy",
                    "number_checked_bags": "0",
                    "origin_city": "San Francisco",
                    "passengers": "4"
                }
            }
        },
        "user_utterance": [
            "I need four seats for a one way flight on March 3rd.",
            "I am leaving San Francisco and going to New York.",
            "I am actually flying to Chicago.",
            "I need an economy class ticket and have zero bags.",
            "Which airport does the flight leave? Does it arrive the next day?",
            "That's fine.",
            "No, that will be all."
        ],
        "system_utterance": [
            "Which city are you leaving and where are you going?",
            "There is an Alaska Airlines flight with 0 stops that leaves at 10:20 pm and costs $189 per person.",
            "There is an American Airlines flight with 1 stop that leaves at 9:30 am and costs $317 per person.",
            "I found 3 flights including a Delta Airlines flight with 0 stops leaving at 10:30 am and the cost is $182 per person.",
            "The flight leaves SFO International Airport and arrives the same day.",
            "May I further assist you?",
            "See you soon!"
        ]
    },
    {
        "dialogue_id": "1_00054",
        "service": "Flights_3",
        "service_call": {
            "method": {
                "method": "SearchOnewayFlight",
                "parameters": {
                    "airlines": "United Airlines",
                    "departure_date": "2019-03-04",
                    "destination_city": "Paris",
                    "flight_class": "Economy",
                    "number_checked_bags": "0",
                    "origin_city": "Las Vegas"
                }
            }
        },
        "user_utterance": [
            "I need a one way flight.",
            "I need to got to Paris on March 4th with 0 bags.",
            "Las Vegas please.",
            "I want sonthing elese.",
            "What does United Airlines have with Economy seating?",
            "Thanks.",
            "No that will be all."
        ],
        "system_utterance": [
            "What date would you like to leave? Where will you be traveling too?",
            "What airport would you like to depart from?",
            "I ahve 3 options for you. There is an American Airlines flight departing at 1:55 pm with 1 layover for $407 per person.",
            "How about a Delta Airlines flight departing at 2:25 pm with 1 layover for $404 per person.",
            "United Airlines has a flight departing at 11 am with 1 layover for $346 per person.",
            "Is there anything else I can help you with?",
            "Have a marvelous day!"
        ]
    },
    {
        "dialogue_id": "1_00055",
        "service": "Flights_3",
        "service_call": {
            "method": {
                "method": "SearchOnewayFlight",
                "parameters": {
                    "departure_date": "2019-03-08",
                    "destination_city": "Paris",
                    "origin_city": "San Francisco"
                }
            }
        },
        "user_utterance": [
            "I have a travel plan on Friday next week for which I need to search for an one way flight, can you find one?",
            "I like to travel to Paris from San Francisco.",
            "That was an useful information and thank you."
        ],
        "system_utterance": [
            "What is your origin and destination cities?",
            "Found 4 results. How about a flight with Alaska Airlines which has 0 layovers and it takes off at 4:45 pm? The ticket price is $240 per person.",
            "Have a nice day."
        ]
    },
    {
        "dialogue_id": "1_00056",
        "service": "Flights_3",
        "service_call": {
            "method": {
                "method": "SearchOnewayFlight",
                "parameters": {
                    "airlines": "United Airlines",
                    "departure_date": "2019-03-02",
                    "destination_city": "San Francisco",
                    "origin_city": "Las Vegas"
                }
            }
        },
        "user_utterance": [
            "I am searching for a one way flight.",
            "I would like to go on United Airlines from Las Vegas to San Francisco. I want to fly out on March 2nd.",
            "When will the flight get to my destination? Will it arrive the day after?",
            "Okay.",
            "No, that is it. Thank you for helping."
        ],
        "system_utterance": [
            "On which date would you like to travel? Which city do you want to leave from and where are you going?",
            "I have 1 flight for you. How about this United Airlines flight? This flight leaves at 4:20 pm local time and has 0 layovers. The ticket costs $86 per person.",
            "The flight arrives at 5:55 pm local time on the same day.",
            "Could I assist with anything else?",
            "Have a great day."
        ]
    },
    {
        "dialogue_id": "1_00057",
        "service": "Flights_3",
        "service_call": {
            "method": {
                "method": "SearchOnewayFlight",
                "parameters": {
                    "airlines": "United Airlines",
                    "departure_date": "2019-03-06",
                    "destination_city": "Seattle",
                    "origin_city": "Toronto"
                }
            }
        },
        "user_utterance": [
            "Hi i need a help, i am planning for a trip, I want to find a one way flight",
            "I am going to Las Vegas and looking for flights from Toronto",
            "I am going on the 6th",
            "No, i am not interested, Find another flights, i am interested fly with United Airlines, i am going from Seattle",
            "No, thank you very much for your help, That's all i need."
        ],
        "system_utterance": [
            "Sure, I will help you, Where are you going to and where do you want depart from?",
            "Could you tell me which date would you like to travel?",
            "Ok, I found a result for you, Are you ok to fly with Delta Airlines? the flight takes off local time at 6:45 pm and the itinerary has 1 layovers, ticket cost is $254 per person",
            "Ok, I found United Airlines for you, the flight takes off at 4:10 pm local time and the itinerary has 1 layovers, Ticket price is $315 per person. Shall i help you with anything more?",
            "you are welcome, hope i was able to help you, Have a wonderful day."
        ]
    },
    {
        "dialogue_id": "1_00058",
        "service": "Flights_3",
        "service_call": {
            "method": {
                "method": "SearchOnewayFlight",
                "parameters": {
                    "departure_date": "2019-03-01",
                    "destination_city": "San Diego",
                    "origin_city": "Atlanta"
                }
            }
        },
        "user_utterance": [
            "Hi, could you help me find a one way flight?",
            "I would like to depart at Atlanta on the 1st of March.",
            "I will be travelling to San Diego.",
            "Sure, that's all I need."
        ],
        "system_utterance": [
            "Where and what date would you like to depart from?",
            "Any preference on your destination?",
            "Would you like to fly with Southwest Airlines? This flight has 1 layovers and will take off at 6:35 pm local time, which will set you back at $242 per passenger.",
            "No problem, see you soon!"
        ]
    },
    {
        "dialogue_id": "1_00059",
        "service": "Flights_3",
        "service_call": {
            "method": {
                "method": "SearchOnewayFlight",
                "parameters": {
                    "departure_date": "2019-03-11",
                    "destination_city": "Nairobi",
                    "origin_city": "Philadelphia"
                }
            }
        },
        "user_utterance": [
            "Can you find a one way flight for me?",
            "Leaving the 11th of March.",
            "Philadelphia.",
            "Nairobi.",
            "Sounds good.",
            "No, that's it for now."
        ],
        "system_utterance": [
            "Travel date?",
            "Departure city?",
            "Destination city?",
            "I found 2 flights. There's an American Airlines flight with 1 layover leaving at 8:45 am, for $370.",
            "Can I do anything else?",
            "Have a nice day."
        ]
    },
    {
        "dialogue_id": "1_00060",
        "service": "Flights_3",
        "service_call": {
            "method": {
                "method": "SearchOnewayFlight",
                "parameters": {
                    "departure_date": "2019-03-07",
                    "destination_city": "Las Vegas",
                    "origin_city": "New York"
                }
            }
        },
        "user_utterance": [
            "I'm looking for a one way flight.",
            "I want to go to Las Vegas.",
            "I'm planning on heading out the 7th of this month.",
            "I'll be leaving from New York. Look for those flights.",
            "Which airport does that depart from?",
            "Cool. That will be it. Thanks."
        ],
        "system_utterance": [
            "Where do you want to go?",
            "When would you like to go?",
            "Where will you be leaving from?",
            "I've found 3 that will work. Do you mind American Airlines? There's a flight that leaves at 6:50 pm and has 1 stop. It costs $251 per seat.",
            "It leaves JFK International Airport.",
            "Have a wonderful day."
        ]
    },
    {
        "dialogue_id": "1_00061",
        "service": "Flights_3",
        "service_call": {
            "method": {
                "method": "SearchOnewayFlight",
                "parameters": {
                    "departure_date": "2019-03-12",
                    "destination_city": "San Diego",
                    "origin_city": "Seattle",
                    "passengers": "2"
                }
            }
        },
        "user_utterance": [
            "Can you find me 2 seats on a one-way flight to San Diego?",
            "I'd be leaving from Seattle on the 12th.",
            "Okay, yeah.",
            "No, that'll be all I need right now."
        ],
        "system_utterance": [
            "Of course - what date are you traveling, and where are you leaving from?",
            "I've got 4 options here so far: Alaska Airlines has a flight leaving at 11:10 am with 1 layover for $207 per ticket.",
            "Is there anything else I can help you with?",
            "Alright, have a great day."
        ]
    },
    {
        "dialogue_id": "1_00062",
        "service": "Flights_3",
        "service_call": {
            "method": {
                "method": "SearchOnewayFlight",
                "parameters": {
                    "departure_date": "2019-03-09",
                    "destination_city": "Portland",
                    "origin_city": "New York"
                }
            }
        },
        "user_utterance": [
            "There is a business tour for me, can you fine a one way flight.",
            "I wish to fly to Portland on 9th of March.",
            "I will embark from New York.",
            "Are there any other flights?",
            "Great, I think I can choose that."
        ],
        "system_utterance": [
            "Your destination and date please.",
            "Where will you depart from?",
            "Are you interested in flying with American Airlines with 1 layovers taking off at 9:15 am? Per head cost is $308.",
            "You can take Delta Airlines with 1 layover and taking off at 6:40 pm . The ticket fare is $316 per person.",
            "Ok, have a good journey."
        ]
    },
    {
        "dialogue_id": "1_00063",
        "service": "Flights_3",
        "service_call": {
            "method": {
                "method": "SearchOnewayFlight",
                "parameters": {
                    "departure_date": "2019-03-01",
                    "destination_city": "San Francisco",
                    "origin_city": "Philadelphia"
                }
            }
        },
        "user_utterance": [
            "I need a one way flight.",
            "I am leaving on the 1st of March going to San Francisco.",
            "I am leaving from Philadelphia.",
            "That is all, thanks!"
        ],
        "system_utterance": [
            "What day are you leaving? Where are you going?",
            "Where are you leaving from?",
            "I found 3 flights with American Airlines. The flight leaves at 2:35 pm, has 1 layover, and the ticket price is $308.",
            "Have a nice day."
        ]
    },
    {
        "dialogue_id": "1_00064",
        "service": "Flights_3",
        "service_call": {
            "method": {
                "method": "SearchOnewayFlight",
                "parameters": {
                    "airlines": "Delta Airlines",
                    "departure_date": "2019-03-14",
                    "destination_city": "Sydney",
                    "origin_city": "San Diego"
                }
            }
        },
        "user_utterance": [
            "I need to travel by plane for my next trip, look for tickets from Delta Airlines.",
            "I'm going to Sydney leaving from San Diego on March 14th.",
            "What about the landing airport?",
            "It works for me.",
            "No thank you."
        ],
        "system_utterance": [
            "When is your trip? Where are you going to? Where are you leaving from?",
            "There's 1 flight good for you if you're sure about Delta Airlines. It takes off at 10 pm and there's also 1 layovers. One single tickets cost $307",
            "It's the Kingsford Smith International Airport.",
            "Can I do more for you to help you in organizing your trip?",
            "Goodbye sir."
        ]
    },
    {
        "dialogue_id": "1_00065",
        "service": "Flights_3",
        "service_call": {
            "method": {
                "method": "SearchOnewayFlight",
                "parameters": {
                    "departure_date": "2019-03-14",
                    "destination_city": "Seattle",
                    "number_checked_bags": "0",
                    "origin_city": "Paris"
                }
            }
        },
        "user_utterance": [
            "I have a plan to travel on March 14th with 0 bags for which I need to search for an one way flight, do you help me?",
            "I am travelling from Paris to Seattle. Please search for flight based on this detail.",
            "Okay, tell me that this result is for how many persons?",
            "That's okay. Fine.",
            "That's all I want for now and thanks."
        ],
        "system_utterance": [
            "Yes, what is your starting and ending place of this trip?",
            "A flight with American Airlines takes off at 5:05 am whose itinerary has 1 layovers and the ticket cost is $444 per person. Please confirm to proceed further.",
            "I searched it for 1 person only.",
            "Anything else you want me to do?",
            "Have a great day."
        ]
    },
    {
        "dialogue_id": "1_00066",
        "service": "Flights_3",
        "service_call": {
            "method": {
                "method": "SearchOnewayFlight",
                "parameters": {
                    "departure_date": "2019-03-10",
                    "destination_city": "New York",
                    "origin_city": "Phoenix"
                }
            }
        },
        "user_utterance": [
            "I've got a business trip coming up. I'm not sure how long I'll be there for, so can you look for a one-way flight for me?",
            "I'm departing from Phoenix,",
            "My trip is on the 10th.",
            "I'm headed to New York.",
            "Yeah, that sounds good.",
            "No, that's all. Thanks."
        ],
        "system_utterance": [
            "Sure. What city are you leaving from?",
            "And what day are you leaving?",
            "What city are you going to?",
            "There is an American Airlines flight which leaves at 5 am but has 1 layover. It costs $301. Do you want a ticket for this flight?",
            "Do you need help with anything else?",
            "Enjoy your day."
        ]
    },
    {
        "dialogue_id": "1_00067",
        "service": "Flights_3",
        "service_call": {
            "method": {
                "method": "SearchOnewayFlight",
                "parameters": {
                    "departure_date": "2019-03-06",
                    "destination_city": "Seattle",
                    "origin_city": "Mexico City"
                }
            }
        },
        "user_utterance": [
            "I need a ticket, whatever's best will do.",
            "Seattle is my goal.",
            "How about a departure of the 6th?",
            "I'm taking off from Mexico City.",
            "You got it toots.",
            "That's the whole thing thanks."
        ],
        "system_utterance": [
            "Where do you want to go?",
            "What date do you want to get there?",
            "From where will you fly?",
            "I have 3 options. How about American Airlines? You can board at 11:40 am. You'll have 1 stop though and it costs $431 each.",
            "What else is needed?",
            "Cool, I appreciate you."
        ]
    },
    {
        "dialogue_id": "1_00068",
        "service": "Flights_3",
        "service_call": {
            "method": {
                "method": "SearchOnewayFlight",
                "parameters": {
                    "departure_date": "2019-03-11",
                    "destination_city": "Mexico City",
                    "number_checked_bags": "0",
                    "origin_city": "Phoenix"
                }
            }
        },
        "user_utterance": [
            "pull up one way flights. Also note I will have zero bags.",
            "check flights leaving Phoenix to Mexico City on March 11th please.",
            "Sounds good. that was all I needed."
        ],
        "system_utterance": [
            "Sure, Where are you planning a trip to? I will also need to know when you would like to leave and from which airport city.",
            "Sure thing. Delta Airlines has some flights available. One flight is departing at 6:25 pm local time and has 1 layover. This ticket would be $258. How does this sound?",
            "Ok, great! Have a wonderful day"
        ]
    },
    {
        "dialogue_id": "1_00069",
        "service": "Flights_3",
        "service_call": {
            "method": {
                "method": "SearchOnewayFlight",
                "parameters": {
                    "departure_date": "2019-03-12",
                    "destination_city": "Vancouver",
                    "origin_city": "Phoenix"
                }
            }
        },
        "user_utterance": [
            "I want to find a one way flight.",
            "Lool for flights from Phoenix to Vancouver on March 12th.",
            "Ok. Thank you",
            "No. Thanks a lot"
        ],
        "system_utterance": [
            "When do you plan to leave? Where you want to depart from? What date would you like to travel?",
            "I found 4 flights. American Airlines takes off at 11 am has 1 layovers. The ticket cost $237.",
            "Can i help you with anything else?",
            "Have a good day."
        ]
    },
    {
        "dialogue_id": "1_00070",
        "service": "Flights_3",
        "service_call": {
            "method": {
                "method": "SearchOnewayFlight",
                "parameters": {
                    "departure_date": "2019-03-11",
                    "destination_city": "Atlanta",
                    "origin_city": "Nairobi",
                    "passengers": "1"
                }
            }
        },
        "user_utterance": [
            "I'll leave soon and I need to book a one way flight for 1 passenger.",
            "The date is March 11th.",
            "Nairobi is the departure city.",
            "I need to be in Atlanta.",
            "Are you looking for Business tickets? Is the arrival scheduled to be for the day after?",
            "Fine, you can go now."
        ],
        "system_utterance": [
            "When would you like to leave?",
            "Where will you leave from?",
            "Where are you going to?",
            "You have 1 option. Is Delta Airlines a company that you would like to travel with? Take off is scheduled at 9:50 am local time. There's 1 layovers. Ticket is $431 pro capite.",
            "No, I'm looking for Economy seat. The plane will reach its destination the next day.",
            "Thank you and good bye."
        ]
    },
    {
        "dialogue_id": "1_00071",
        "service": "Flights_3",
        "service_call": {
            "method": {
                "method": "SearchOnewayFlight",
                "parameters": {
                    "departure_date": "2019-03-08",
                    "destination_city": "New York",
                    "flight_class": "Premium Economy",
                    "origin_city": "Washington"
                }
            }
        },
        "user_utterance": [
            "Hello! I need assistance finding a one way flight.",
            "I'd like to find a Premium Economy ticket from Washington to New York on the 8th of this month.",
            "That will work for me.",
            "No, that will be all for right now. Thank you for your assistance."
        ],
        "system_utterance": [
            "I'd be happy to help. Let's get some details down. Where are you going and where will you be leaving from? What day will you be going?",
            "There are 4 flights that meet your needs. If you like American Airlines, there is a flight that leaves at 4:10 am local time. It has 0 stops and tickets are $115 each.",
            "Is there anything else I can do for you? Would you like to book the ticket?",
            "You are very welcome. Enjoy your day!"
        ]
    },
    {
        "dialogue_id": "1_00072",
        "service": "Flights_3",
        "service_call": {
            "method": {
                "method": "SearchOnewayFlight",
                "parameters": {
                    "departure_date": "2019-03-08",
                    "destination_city": "London",
                    "origin_city": "Washington"
                }
            }
        },
        "user_utterance": [
            "I'd like to search for a one-way flight.",
            "I'm going to London.",
            "I'd like to travel on Friday next week.",
            "Search for flights from Washington.",
            "Okay, thank you; that's all."
        ],
        "system_utterance": [
            "What location do you intend to travel to?",
            "What day do you wish to travel?",
            "What metropolis would you like to leave from?",
            "I discovered 4 flights for you. There is a ticket costing $300 for an American Airlines that departs at 4:10 am with 1 layover.",
            "Have a pleasant afternoon."
        ]
    },
    {
        "dialogue_id": "1_00073",
        "service": "Flights_3",
        "service_call": {
            "method": {
                "method": "SearchOnewayFlight",
                "parameters": {
                    "departure_date": "2019-03-11",
                    "destination_city": "Seattle",
                    "number_checked_bags": "0",
                    "origin_city": "Sydney"
                }
            }
        },
        "user_utterance": [
            "I need a one way flight to Seattle.",
            "I am departing from Sydney on the 11th of March. I have zero bags to check in.",
            "All right.",
            "No. Thanks for your help."
        ],
        "system_utterance": [
            "Departing from what city?",
            "I found a flight on Delta Airlines that departs at 3:55 pm local time. There is 1 layover and the ticket costs $323 per passenger. Are you interested?",
            "Do you need help with anything else?",
            "Have a nice day."
        ]
    },
    {
        "dialogue_id": "1_00074",
        "service": "Flights_3",
        "service_call": {
            "method": {
                "method": "SearchOnewayFlight",
                "parameters": {
                    "departure_date": "2019-03-04",
                    "destination_city": "Atlanta",
                    "number_checked_bags": "0",
                    "origin_city": "Los Angeles"
                }
            }
        },
        "user_utterance": [
            "Can you help me find a one way flight? I have zero bags to check, so I'll just be carrying on one.",
            "I am leaving from Los Angeles on March 4th and I want to go to Atlanta.",
            "That sounds good.",
            "No thank you, that is all."
        ],
        "system_utterance": [
            "Where are you leaving from and going to, and on what date?",
            "I found 5 flights with Alaska Airlines. The first one takes off at 6:55 pm local time, has 0 layovers and costs $169 per ticket.",
            "Can I help you with anything else?",
            "Ok, have a good day."
        ]
    },
    {
        "dialogue_id": "1_00075",
        "service": "Flights_3",
        "service_call": {
            "method": {
                "method": "SearchOnewayFlight",
                "parameters": {
                    "departure_date": "2019-03-02",
                    "destination_city": "New York",
                    "flight_class": "Economy",
                    "origin_city": "Los Angeles"
                }
            }
        },
        "user_utterance": [
            "Hello! Can you help me find an Economy class ticket on a one way flight?",
            "I'll be leaving Los Angeles this Saturday bound for New York.",
            "Can you tell me where and when that flight lands?",
            "That will work for me.",
            "No, that will be everything. Thank you for your help."
        ],
        "system_utterance": [
            "I'd be happy to help. Let's get some details to help narrow down the search. Where are you planning to travel to and where will you be leaving from? What day will you be travelling?",
            "There are 5 flights that might work for you. There is an Alaska Airlines flight that leaves Los Angeles at 4:55 am local time. It has 1 layover and tickets cost $297.",
            "It is scheduled to arrive at 3:56 pm local time at JFK International Airport.",
            "Is there anything else I can assist you with today?",
            "You're welcome. Have a wonderful day!"
        ]
    },
    {
        "dialogue_id": "1_00076",
        "service": "Flights_3",
        "service_call": {
            "method": {
                "method": "SearchOnewayFlight",
                "parameters": {
                    "departure_date": "2019-03-14",
                    "destination_city": "Seattle",
                    "flight_class": "Premium Economy",
                    "number_checked_bags": "0",
                    "origin_city": "Vancouver"
                }
            }
        },
        "user_utterance": [
            "Hello, could you help to search for some Premium Economy one way flights?",
            "I would prefer to depart from Vancouver.",
            "I will be flying to Seattle with zero check in bags.",
            "I will be flying on the 14th of March.",
            "I see, that's all I need. Thank you."
        ],
        "system_utterance": [
            "Where would you like to depart from?",
            "What is your preferred destination>",
            "When would you like to travel?",
            "Would you like to travel with Air Canada with 1 layover? The flight will depart at 12:15 pm local time and cost you $455 per passenger.",
            "No problem, have a great day!"
        ]
    },
    {
        "dialogue_id": "1_00077",
        "service": "Flights_3",
        "service_call": {
            "method": {
                "method": "SearchRoundtripFlights",
                "parameters": {
                    "airlines": "Southwest Airlines",
                    "departure_date": "2019-03-06",
                    "destination_city": "Seattle",
                    "flight_class": "Economy",
                    "number_checked_bags": "0",
                    "origin_city": "Atlanta",
                    "passengers": "4",
                    "return_date": "2019-03-08"
                }
            }
        },
        "user_utterance": [
            "I need a one way flight and I have 0 bags that need to be checked in.",
            "I want to fly to Seattle on the 6th of March.",
            "Look for flights departing Atlanta.",
            "I need something else. Could you find economy tickets?",
            "I want four seats but find me other options.",
            "Would it arrive the day after? At which airport does it land?",
            "Okay, I need round trip flights that return on 8th of this month.",
            "Oky. Thank you for your assistance."
        ],
        "system_utterance": [
            "On which date would you like to travel and to where?",
            "What city do you want to leave from?",
            "I have 4 flights for you. How about American Airlines? There is one flight that takes off at 4:20 pm local time with 0 layovers. This ticket costs $187 per passenger.",
            "I have 3 flights for you. Do you want to fly Delta Airlines? The flight takes off at 2:30 pm local time with 0 layovers and costs $194 per person.",
            "There is a Southwest Airlines flight that leaves at 7:15 pm local time. It has 1 layover and costs $334.",
            "It will land at Seattle-Tacoma International Airport the following day.",
            "I have 1 flight that I think you would like. How about Southwest Airlines? This flight leaves at 7:15 pm mand returns at 6:55 pm local time. It costs $485 per person.",
            "Have an awesome day."
        ]
    },
    {
        "dialogue_id": "1_00078",
        "service": "Flights_3",
        "service_call": {
            "method": {
                "method": "SearchRoundtripFlights",
                "parameters": {
                    "airlines": "Southwest Airlines",
                    "departure_date": "2019-03-03",
                    "destination_city": "Atlanta",
                    "number_checked_bags": "0",
                    "origin_city": "Philadelphia",
                    "passengers": "4",
                    "return_date": "2019-03-05"
                }
            }
        },
        "user_utterance": [
            "Can you find me a one way flight? I have 0 bags so no need to check any in",
            "Let's look for flights from Philadelphia",
            "I'm flying to Atlanta and want to leave on the 3rd",
            "Can you book four seats but with Southwest Airlines.",
            "Does it arrive the next day? And which airport does that flight leave from?",
            "Alright, help me find round trip flights",
            "Let's make the return on March 5th",
            "Where does that land?",
            "Alright that sounds good",
            "Nope, that's all thanks"
        ],
        "system_utterance": [
            "Where do you want to depart from?",
            "Where are you going to and what date are you travelling?",
            "How's this American Airlines flight that leaves at 8:45 pm and has 1 layover. It costs $196 total",
            "There's a Southwest Airlines flight that takes off at 3:30 pm and has 1 layover and costs $208 a head",
            "The flight leaves from PHL International Airport and it arrives on the same day",
            "What day do you want your return to be?",
            "I found 1 flight via Southwest Airlines that leaves at 3:30 pm and the return flight takes off at 6:40 am and will cost you $385",
            "It will arrive at Hartsfield-Jackson International Airport",
            "Can I do anything else for you?",
            "Great, have a good one"
        ]
    },
    {
        "dialogue_id": "1_00079",
        "service": "Flights_3",
        "service_call": {
            "method": {
                "method": "SearchRoundtripFlights",
                "parameters": {
                    "airlines": "American Airlines",
                    "departure_date": "2019-03-11",
                    "destination_city": "Seattle",
                    "number_checked_bags": "0",
                    "origin_city": "London",
                    "return_date": "2019-03-13"
                }
            }
        },
        "user_utterance": [
            "I will be having a flight so I need a ticket for a one way flight, though keep in mind that I have zero bags to check in. I will start my journey on the 11th.",
            "I will be flying from London, and my destination will be Seattle.",
            "That seems good. I actually need to find a round trip flight.",
            "My returning date will be 13th of this month.",
            "Can you tell me for how many passengers is this for? Which is the time, when my flight would arrive at the destination?",
            "That sounds good.",
            "Nothing for the moment. I am thankful for your help."
        ],
        "system_utterance": [
            "Can you tell me your destination, and the city from where you will depart?",
            "I see that 3 flights match what you want. One of the flights has 1 layover and it departs at 6:55 am, and it is with American Airlines. The ticket would be costing you $402 per passenger.",
            "Can you tell me the day when you will be returning?",
            "How would you consider flying with the flight of American Airlines that leaves at 6:55 am local time and returns at 1:40 pm local time.? The cost of the ticket will be $775 per passenger.",
            "What I specified is for 1 passenger and the flight will be at destination at 8:42 pm local time.",
            "Is there something else I can help you with?",
            "Have a good time!"
        ]
    },
    {
        "dialogue_id": "1_00080",
        "service": "Flights_3",
        "service_call": {
            "method": {
                "method": "SearchRoundtripFlights",
                "parameters": {
                    "airlines": "American Airlines",
                    "departure_date": "2019-03-06",
                    "destination_city": "Portland",
                    "origin_city": "San Diego",
                    "return_date": "2019-03-09"
                }
            }
        },
        "user_utterance": [
            "I'm going on a trip. Can you get me a one-way flight?",
            "I need a flight from San Diego to Portland on the 6th.",
            "Are there any other flights available?",
            "What time does this flight get to Portland? Is it the next day?",
            "Sounds good. Actually, maybe I should just be a round trip flight. Can you find me one which beings me back on the 9th of March?",
            "What station does this flight arrive at? And do they allow at least one checked bag?",
            "I see.",
            "No. Thank you very much."
        ],
        "system_utterance": [
            "Sure. Where are you going to, and where are you leaving from? Also, what day is your trip?",
            "There is an Alaska Airlines flight which leaves at 1:15 pm and has 0 layovers. It costs $135.",
            "There is an American Airlines flight which leaves at 4:50 pm and has 0 layovers. It costs $122.",
            "You would arrive at 7:34 pm local Portland time the same day.",
            "Sure. That 1 American Airlines flight which leaves at 4:50 pm has a return flight which departs at 4:45 pm local Portland time. The total cost would be $338.",
            "It is PDX International Airport and 0 checked bags are allowed.",
            "Do you need assistance with anything else?",
            "Enjoy the rest of your day."
        ]
    },
    {
        "dialogue_id": "1_00081",
        "service": "Flights_3",
        "service_call": {
            "method": {
                "method": "SearchRoundtripFlights",
                "parameters": {
                    "airlines": "Delta Airlines",
                    "departure_date": "2019-03-02",
                    "destination_city": "New York",
                    "number_checked_bags": "0",
                    "origin_city": "London",
                    "return_date": "2019-03-04"
                }
            }
        },
        "user_utterance": [
            "I'm looking for a one way flight",
            "I'm flying to New York from London",
            "I wanted to fly tomorrow",
            "Try some thing else",
            "Find some more",
            "Cool. I wanted to go find round trip flights with zero bags check in, planning to return on March 4th",
            "All right fine.",
            "Nope. Thanks a lot for the help"
        ],
        "system_utterance": [
            "Where are you planning to go and from which city do you want to depart from?",
            "Which date do you prefer?",
            "There are 4 flights. How about flying with American Airlines which takes off at 2 am local time where itinerary has 0 layovers which costs $247 per head",
            "How about British Airways, which takes off at 11:05 am where itinerary has 1 layovers which costs $388 per head",
            "How about Delta Airlines which takes off at 11:50 am where itinerary has 1 layovers and costs $443 per person",
            "There are 1 flights. How about flying with Delta Airlines which takes off at 11:50 am local time and return takes off at 5:30 pm local time which costs $628 per person?",
            "Can I assist you with anything else?",
            "Have a wonderful day"
        ]
    },
    {
        "dialogue_id": "1_00082",
        "service": "Flights_3",
        "service_call": {
            "method": {
                "method": "SearchRoundtripFlights",
                "parameters": {
                    "airlines": "United Airlines",
                    "departure_date": "2019-03-07",
                    "destination_city": "Seattle",
                    "number_checked_bags": "0",
                    "origin_city": "Atlanta",
                    "passengers": "1",
                    "return_date": "2019-03-09"
                }
            }
        },
        "user_utterance": [
            "Will you find me a one way flight on United Airlines?",
            "Seattle.",
            "Thursday next week.",
            "Will you find me flights from Atlanta for 1 person?",
            "Great.",
            "Will you find some round trip flights? I need to check in 0 bags.",
            "March 9th.",
            "What's the destination airport? It arrives the day after right?",
            "Sounds great.",
            "No, thanks."
        ],
        "system_utterance": [
            "Where are you going?",
            "What date?",
            "Which city are you leaving from?",
            "I found a flight on United Airlines that takes off at 11:50 am with 0 layers for $190 per passenger.",
            "Anything else?",
            "Which day is the return flight?",
            "How about United Airlines at $462 per passenger that takes off at 11:50 am with returning flight that takes off at 10:35 am.",
            "The flight arrives the same day at Seattle-Tacoma International Airport.",
            "Anything else?",
            "Have a wonderful day."
        ]
    },
    {
        "dialogue_id": "1_00083",
        "service": "Flights_3",
        "service_call": {
            "method": {
                "method": "SearchRoundtripFlights",
                "parameters": {
                    "airlines": "American Airlines",
                    "departure_date": "2019-03-09",
                    "destination_city": "Las Vegas",
                    "origin_city": "Los Angeles",
                    "return_date": "2019-03-11"
                }
            }
        },
        "user_utterance": [
            "I'm looking for a one way flight.",
            "Find flights in Los Angeles leaving on the 9th of March to Las Vegas.",
            "How many passengers are included for that prices? Will the flight arrive by the next day?",
            "Ok, search for round trip flights.",
            "I want to be back on March 11th.",
            "All right that sounds good.",
            "Nope, that's it. Thanks for the help."
        ],
        "system_utterance": [
            "Which city are you departing, what date would you like to leave and where are you planning to go?",
            "Would you like to fly with American Airlines? The flight leaves at 5:05 am local time and has 0 layovers. The tickets are $80 per passenger.",
            "The cost will be for 1 passenger and the flight will arrive at it's destination on the same day.",
            "What day will you be returning?",
            "Would you like to fly with American Airlines? The flight leaves at 5:05 am local time. The return flight leaves at 4:50 am local time and the tick costs $154 per passenger.",
            "Is there anything else i can help you with today?",
            "Thank you and have a good day."
        ]
    },
    {
        "dialogue_id": "1_00084",
        "service": "Flights_3",
        "service_call": {
            "method": {
                "method": "SearchRoundtripFlights",
                "parameters": {
                    "airlines": "American Airlines",
                    "departure_date": "2019-03-04",
                    "destination_city": "Chicago",
                    "flight_class": "Economy",
                    "number_checked_bags": "0",
                    "origin_city": "London",
                    "return_date": "2019-03-06"
                }
            }
        },
        "user_utterance": [
            "I need a one-way flight, preferably with American Airlines.",
            "I need a flight from London to Chicago for the 4th of March.",
            "Okay. I round trip Economy flight. I have zero bags to check.",
            "I plan on returning on the 6th.",
            "How many tickets did you get? Which airport does it leave from?",
            "Okay. Thanks, that's all I need."
        ],
        "system_utterance": [
            "Where are you flying from, and what is the destination? What day will you be traveling?",
            "I've found 1 flight with American Airlines. The flight takes off at 2:25 am local time and has 0 layovers. It is $261 per passenger.",
            "What day do you want to return?",
            "I found 1 American Airlines flight leaving at 2:25 am local time. The return flight leaves at 2:40 pm local time. It's $617 per ticket.",
            "I got 1 ticket. The flight leaves from Heathrow International Airport.",
            "Have a nice day."
        ]
    },
    {
        "dialogue_id": "1_00085",
        "service": "Flights_3",
        "service_call": {
            "method": {
                "method": "SearchRoundtripFlights",
                "parameters": {
                    "airlines": "American Airlines",
                    "departure_date": "2019-03-05",
                    "destination_city": "Chicago",
                    "origin_city": "Nairobi",
                    "return_date": "2019-03-07"
                }
            }
        },
        "user_utterance": [
            "I will be having a flight so I need a one way flight,",
            "I will be flying from Nairobi, with my destination being Chicago, and I will be having the trip on Tuesday next week.",
            "Can you tell me if the flight arrives the day after?",
            "That's good. I am also in need of a round trip flight.",
            "I think I will be returning on Thursday next week.",
            "That seems nice.",
            "Nothing for now. I appreciate your help."
        ],
        "system_utterance": [
            "Can you tell me the date when you will be having the trip? From which city are you going to be leaving, and which is your destination?",
            "I see that there are 2 flights which meet what you want. Do you like having American Airlines as your flight company? This flight will be leaving at 7:40 am local time, and it has 1 layover. This ticket will cost you an amount of $431 per passenger.",
            "I can confirm that the flight arrives at the destination on the next day.",
            "Can you tell me when you would want to return?",
            "I see that there is 1 flight suiting what you might like, and it is with the American Airlines. Also the flight will leave at 7:40 am local time, and it will be returning at 9:40 am local time. The cost of this ticket will be $786 per passenger.",
            "Is there anything else I can help you with?",
            "Have a good time!"
        ]
    },
    {
        "dialogue_id": "1_00086",
        "service": "Flights_3",
        "service_call": {
            "method": {
                "method": "SearchRoundtripFlights",
                "parameters": {
                    "airlines": "Alaska Airlines",
                    "departure_date": "2019-03-10",
                    "destination_city": "Seattle",
                    "number_checked_bags": "0",
                    "origin_city": "Los Angeles",
                    "passengers": "2",
                    "return_date": "2019-03-12"
                }
            }
        },
        "user_utterance": [
            "Can you search for one-way flights for me?",
            "I'd like to fly on the 10th of March.",
            "I'm leaving from London and going to Seattle, I have 0 bags to check in, I'm just bringing a carry-on, I hate traveling while loaded down.",
            "What class would it be and when does it arrive?",
            "No, I think 2:25 am is too early to be flying Economy, tell me what else is available.",
            "No. Okay, can you look up flights from Los Angeles?",
            "Can you find some round trip flights instead, I need 2 seats.",
            "I'd be coming back on the 12th of this month.",
            "Yeah, that works.",
            "No, that's all."
        ],
        "system_utterance": [
            "Of course, what day would you like to travel on?",
            "What city are you leaving from, and where are you traveling to?",
            "Okay! I've got 3 matching flights here - American Airlines has a flight with 1 layover, taking off at 2:25 am for $410 per passenger.",
            "The flight arrives on the same day - it's an Economy seat.",
            "How about Delta Airlines? There's an 11:50 am take off with 1 layover for $411.",
            "I've got 3 more options here: Alaska Airlines has a flight taking off at 8:15 am with 0 layovers for $153 per passenger.",
            "What day would you like to return?",
            "I've got 1 flight here: Alaska Airlines has a flight leaving 1:45 pm and returning 11:10 am for $249 per ticket.",
            "Is there anything else I can help you with?",
            "Have a great day."
        ]
    },
    {
        "dialogue_id": "1_00087",
        "service": "Flights_3",
        "service_call": {
            "method": {
                "method": "SearchRoundtripFlights",
                "parameters": {
                    "airlines": "United Airlines",
                    "departure_date": "2019-03-01",
                    "destination_city": "San Francisco",
                    "flight_class": "Premium Economy",
                    "number_checked_bags": "0",
                    "origin_city": "New York",
                    "passengers": "1",
                    "return_date": "2019-03-03"
                }
            }
        },
        "user_utterance": [
            "Can you search for one way flight?",
            "My destination is San Francisco.",
            "My city and date of departure is New York and on the 1st.",
            "Can you find any other flight for 1 seat and zero bags to check in.",
            "Which airport does the flight depart from and what is class of ticket?",
            "Can you search for any other premium Economy ticket in United Airlines?",
            "Okay, Find me round trip flights.",
            "I will be returning on the 3rd.",
            "That will be all. Thank you."
        ],
        "system_utterance": [
            "What will be your destination?",
            "What will be the city and date of departure?",
            "How about American Airlines which takes off at 9:15 am with 0 layovers and the ticket is priced at $217?",
            "How about Delta Airlines which takes off at 6:40 pm with 0 layovers and the ticket is priced at $174?",
            "The ticket is Economy class and it is taking off from JFK International Airport.",
            "How about United Airlines which takes off at 11:15 am with 0 layovers and the ticket is priced at $293.",
            "When do you want to get back?",
            "There is 1 United Airlines flight which leaves at 11:15 am and the returning flight is at 8:05 pm and the ticket is priced at $595.",
            "I am glad I could help. Have a nice day."
        ]
    },
    {
        "dialogue_id": "1_00088",
        "service": "Flights_3",
        "service_call": {
            "method": {
                "method": "SearchRoundtripFlights",
                "parameters": {
                    "airlines": "Delta Airlines",
                    "departure_date": "2019-03-09",
                    "destination_city": "New York",
                    "number_checked_bags": "0",
                    "origin_city": "Vancouver",
                    "return_date": "2019-03-11"
                }
            }
        },
        "user_utterance": [
            "Will you find a one way flight with 0 bags to check in?",
            "I want to fly from Vancouver to New York on 9th of March.",
            "Which airport does it depart from? Where does it land?",
            "Will you find me something else?",
            "Anything else?",
            "Sounds great. Will you find round trip flights?",
            "11th of March.",
            "Thanks, that's all."
        ],
        "system_utterance": [
            "Where are you departing from? Where are you going? What date are you traveling?",
            "I found 4 flights. One of them is Air Canada at $338 per passenger with 1 layover that takes off at 1:40 am.",
            "It flies from YVR International Airport to JFK International Airport.",
            "I found American Airlines at $295 per passenger with take off at 5:15 am and 1 layovers.",
            "How about Delta Airlines at $335 per passenger that takes off at 6:40 am and has 1 layover?",
            "Which day are you returning?",
            "I found Delta Airlines at $624 per passenger that takes off at 10:15 am. Return flight takes off at 6:40 pm.",
            "Have a wonderful day."
        ]
    },
    {
        "dialogue_id": "1_00089",
        "service": "Flights_3",
        "service_call": {
            "method": {
                "method": "SearchRoundtripFlights",
                "parameters": {
                    "airlines": "Delta Airlines",
                    "departure_date": "2019-03-11",
                    "destination_city": "Phoenix",
                    "origin_city": "San Francisco",
                    "return_date": "2019-03-13"
                }
            }
        },
        "user_utterance": [
            "I'm looking for a one way flight.",
            "I'm traveling from San Francisco to Phoenix and I need to depart on the 11th of March.",
            "What else is available?",
            "Is there anything else?",
            "Okay. Let's search for round trip flights.",
            "I want to fly back on March 13th.",
            "When and where does the return flight arrive?",
            "Okay, that's all I need for now, thanks."
        ],
        "system_utterance": [
            "Okay, where are you traveling from and traveling to? What date do you need to travel?",
            "I've found 5 flights that would work for you. There's an Alaska Airlines flight that has 0 layovers and departs 11 am. The ticket is $132 per person.",
            "I found a flight on American Airlines that departs at 8:20 pm and has 0 layovers. It costs $121 per person.",
            "I have a flight on Delta Airlines that departs at 11:45 am and has 1 layover. It's $195 per person.",
            "What day do you want to return?",
            "I found 1 flight that will work on Delta Airlines. The outbound flight departs at 11:45 am local time and the return flight takes off at 7:55 pm local time. The price is $300 per person.",
            "The flight is into Sky Harbor International Airport and arrives at 10:02 pm.",
            "Have a great day!"
        ]
    },
    {
        "dialogue_id": "1_00090",
        "service": "Flights_3",
        "service_call": {
            "method": {
                "method": "SearchRoundtripFlights",
                "parameters": {
                    "airlines": "United Airlines",
                    "departure_date": "2019-03-08",
                    "destination_city": "Los Angeles",
                    "number_checked_bags": "0",
                    "origin_city": "Delhi",
                    "passengers": "2",
                    "return_date": "2019-03-12"
                }
            }
        },
        "user_utterance": [
            "I'm going on a trip. Can you search for a one-way flight?",
            "I want a flight from Delhi to Los Angeles.",
            "I am leaving on the 8th of March.",
            "Hmm, are there any other flights? There are 0 bags for me to check in.",
            "What station does this flight take me to? And what time does it get there?",
            "Sounds good, but I changed my mind. I want a round-trip flight for 2 people.",
            "Most likely on the 12th.",
            "Okay.",
            "No, that's all. Thanks."
        ],
        "system_utterance": [
            "Sure. Where are you going? And what city are you leaving from?",
            "What day is your trip?",
            "There is an American Airlines flight available which leaves at 7 am and has 0 layovers. It costs $228.",
            "There is a United Airlines flight available which leaves at 9:15 pm and has 1 layover. It costs $482.",
            "You would arrive at LAX International Airport at 1:50 am local LA time.",
            "Sure. What day will you be returning?",
            "The United Airlines flight which leaves at 9:15 pm that we were discussing earlier has a return flight which departs at 5 am local LA time. It costs $835 per person.",
            "Do you need assistance with anything else?",
            "Enjoy the rest of your day."
        ]
    },
    {
        "dialogue_id": "1_00091",
        "service": "Flights_3",
        "service_call": {
            "method": {
                "method": "SearchRoundtripFlights",
                "parameters": {
                    "airlines": "Delta Airlines",
                    "departure_date": "2019-03-02",
                    "destination_city": "Chicago",
                    "origin_city": "Washington",
                    "return_date": "2019-03-04"
                }
            }
        },
        "user_utterance": [
            "I want to search for an one way flight on 2nd of March, can you help me to find one?",
            "I am planning to visit Chicago from Washington. Search flights as per this detail.",
            "No, please search for some other flights.",
            "Thanks for that information.",
            "Yes, I need another help. Please search for round trip flights.",
            "Return will be on 4th of this month.",
            "Thanks for all your information."
        ],
        "system_utterance": [
            "What is the origin and destination cities of your trip?",
            "Found 4 results based on your requirement. What about an American Airlines flight which takes off at 6:40 pm local time with itinerary of 0 layovers and the ticket price at $120 per person?",
            "How about a flight with Delta Airlines? It will take off at 4:20 am and the cost will be $112 per person. Also it has itinerary of 0 layovers.?",
            "let me know to help further in this?",
            "When do you want the return flight to be take off?",
            "Again please confirm whether Delta Airlines is okay for you. And the flight will take off at 4:20 am and the return flight takes off at 9:35 am under ticket cost $299 per person.",
            "Have a nice day."
        ]
    },
    {
        "dialogue_id": "1_00092",
        "service": "Flights_3",
        "service_call": {
            "method": {
                "method": "SearchRoundtripFlights",
                "parameters": {
                    "airlines": "Delta Airlines",
                    "departure_date": "2019-03-11",
                    "destination_city": "New York",
                    "flight_class": "Premium Economy",
                    "origin_city": "Atlanta",
                    "return_date": "2019-03-13"
                }
            }
        },
        "user_utterance": [
            "I want to find a one way flight.",
            "I am leaving from Atlanta.",
            "I am going to New York on the 11th of March and I would like seats in premium economy.",
            "Does it arrive the day after and how many passengers did you get this for?",
            "Please find me another flight with Delta Airlines.",
            "Ok. Can you please find some round trip flights, with a return date of the 13th of March?",
            "All right, thank you.",
            "No, thank you for your help."
        ],
        "system_utterance": [
            "What city are you departing from?",
            "Where are you going and what date are you looking to leave?",
            "I found a flight on American Airlines that has 0 layovers and departs at 6:15 am. The cost is $222 per ticket.",
            "This is for 1 passenger and the flight arrives at the destination on the same day.",
            "I found a flight on Delta Airlines that departs at 7:55 pm and has 0 layovers for a price of $197 per passenger.",
            "I located a Delta Airlines flight that departs at 7:55 pm and the return flight departs at 1:25 pm. The cost is $372 per ticket.",
            "Can I help you with anything else?",
            "You're welcome. Have a nice day."
        ]
    },
    {
        "dialogue_id": "1_00093",
        "service": "Flights_3",
        "service_call": {
            "method": {
                "method": "SearchRoundtripFlights",
                "parameters": {
                    "airlines": "Southwest Airlines",
                    "departure_date": "2019-03-10",
                    "destination_city": "San Diego",
                    "flight_class": "Premium Economy",
                    "origin_city": "New York",
                    "passengers": "2",
                    "return_date": "2019-03-13"
                }
            }
        },
        "user_utterance": [
            "I need a one way flight.",
            "I depart New York and arrive San Diego and prefer Premium Economy.",
            "I depart on March 10th.",
            "How many bags can I check and I need 2 tickets.",
            "I want round tickets for 2.",
            "I want to return March 13th.",
            "Thanks that is all for today."
        ],
        "system_utterance": [
            "What is the departure and arrival cities?",
            "What are you travel dates?",
            "I have a Southwest Airlines flight at 6:25 am with 1 layover for $502.",
            "I reserved 1 ticket and 0 bags are permitted.",
            "What day would you like to return?",
            "I have a Southwest Airlines departure at 6:25 am with a return of 7:10 pm for $836.",
            "Have a great day."
        ]
    },
    {
        "dialogue_id": "1_00094",
        "service": "Flights_3",
        "service_call": {
            "method": {
                "method": "SearchRoundtripFlights",
                "parameters": {
                    "airlines": "Delta Airlines",
                    "departure_date": "2019-03-01",
                    "destination_city": "Sydney",
                    "flight_class": "Economy",
                    "number_checked_bags": "0",
                    "origin_city": "Phoenix",
                    "return_date": "2019-03-03"
                }
            }
        },
        "user_utterance": [
            "Find me please one way flight.",
            "From Phoenix to Sydney today.",
            "Tell me on witch airport do the flight leave from and if will arrive the day after?",
            "Find for me something else.",
            "I understand.Find me round trip flight at Economy class .I have zero bags to check in.",
            "Will be on 3rd of March.",
            "I understand.The information is sufficient. Thank you very much."
        ],
        "system_utterance": [
            "Where you want to go?On witch city will be the depart and in what date?",
            "You like American Airlines ?Because I found one at 9:30 am locat time with 1 layovers.The total cost is $345 per ticket.",
            "From Sky Harbor International Airport will live and will arrive on next day.",
            "What about Delta Airlines ?The cost will be $337 per passenger and have 1 layovers.You can take it at 7:55 pm.",
            "In what day will be the return flight?",
            "1 flight I have found with Delta Airlines at 7:55 pm and return at 3:55 pm local time.Cost will be $615.",
            "Have a great day!"
        ]
    },
    {
        "dialogue_id": "1_00095",
        "service": "Flights_3",
        "service_call": {
            "method": {
                "method": "SearchRoundtripFlights",
                "parameters": {
                    "airlines": "Southwest Airlines",
                    "departure_date": "2019-03-07",
                    "destination_city": "Phoenix",
                    "origin_city": "Atlanta",
                    "return_date": "2019-03-09"
                }
            }
        },
        "user_utterance": [
            "I need a one-way flight.",
            "I want to fly out of Atlanta on the 7th of this month.",
            "I want to go to Phoenix.",
            "No, find something else.",
            "No, something else.",
            "Where does it land?",
            "Is this for one passenger?",
            "Let's look at round-trip flights.",
            "I want to return on March 9th.",
            "Okay, thanks, that's all I need."
        ],
        "system_utterance": [
            "Where will you be leaving from, and what day?",
            "Where to?",
            "There's an American Airlines flight leaving at 9:30 am local time. It has 0 layovers and costs $146 per ticket.",
            "I have a Delta Airlines flight leaving at 9:35 am local time. It has 0 layovers, and is $179 per ticket.",
            "I have a Southwest Airlines flight leaving at 6:35 pm local time. It has 1 layover and costs $265 per ticket.",
            "The flight arrives at Sky Harbor International Airport.",
            "Yes, it's for 1 passenger.",
            "What day do you want the return flight for?",
            "There's a Southwest Airlines flight that leaves at 6:35 pm local time. The return flight leaves at 9:15 am local time. Tickets are $396 each.",
            "Have a nice day."
        ]
    },
    {
        "dialogue_id": "1_00096",
        "service": "Flights_3",
        "service_call": {
            "method": {
                "method": "SearchRoundtripFlights",
                "parameters": {
                    "airlines": "Delta Airlines",
                    "departure_date": "2019-03-12",
                    "destination_city": "Chicago",
                    "flight_class": "Economy",
                    "origin_city": "Sydney",
                    "passengers": "3",
                    "return_date": "2019-03-14"
                }
            }
        },
        "user_utterance": [
            "I have just completed my overseas project and want go back home. Could you please find me a one way flight?",
            "My destination is Chicago.",
            "Please find flights departing from Sydney. I'd like Economy class tickets on a flight leaving on 12th of this month.",
            "That sounds good, but I've just been informed that my team's expertise will be required on an extension of the just concluded project, and therefore I need to accompany 2 other team members to and from Sydney. Please find me three seats on a round trip flight.",
            "I'm planning on returning on the 14th of this month.",
            "Please let me know the departure airport.",
            "Sounds good. That will be all."
        ],
        "system_utterance": [
            "Where will you be travelling to?",
            "Please tell me your departure city and your preferred date of travel.",
            "I've found one 1 flight you may like. Would you consider taking a Delta Airlines flight with 1 layover, taking off at 3:55 pm local time, at a cost of $405 per passenger?",
            "When would you like to take the return flight?",
            "How about a Delta Airlines flight taking off at 3:55 pm local time, with a return flight scheduled for 7:05 am, at a cost of $740 per passenger?",
            "The flight departs from Kingsford Smith International Airport.",
            "Have a lovely day."
        ]
    },
    {
        "dialogue_id": "1_00097",
        "service": "Flights_3",
        "service_call": {
            "method": {
                "method": "SearchRoundtripFlights",
                "parameters": {
                    "airlines": "Delta Airlines",
                    "departure_date": "2019-03-02",
                    "destination_city": "Washington",
                    "origin_city": "Atlanta",
                    "passengers": "3",
                    "return_date": "2019-03-04"
                }
            }
        },
        "user_utterance": [
            "Can you help me find 3 tickets for a one way flight for the 2nd of March?",
            "Washington and I want to fly with Delta Airlines.",
            "Departure city is Atlanta.",
            "How about a round trip flight?",
            "I want to return on March 4th",
            "Thanks that is all for today."
        ],
        "system_utterance": [
            "What is the destination?",
            "What is departure city?",
            "I have a Delta Airlines flight that departs at 5:55 pm with 0 layover and costs $107.",
            "What is return date?",
            "I found 1 flight. A Delta Airlines flight with a 5:55 pm departure and return at 6:25 pm that costs $228.",
            "Have a great day."
        ]
    },
    {
        "dialogue_id": "1_00098",
        "service": "Flights_3",
        "service_call": {
            "method": {
                "method": "SearchRoundtripFlights",
                "parameters": {
                    "airlines": "United Airlines",
                    "departure_date": "2019-03-02",
                    "destination_city": "Seattle",
                    "flight_class": "Economy",
                    "number_checked_bags": "0",
                    "origin_city": "Phoenix",
                    "passengers": "4",
                    "return_date": "2019-03-04"
                }
            }
        },
        "user_utterance": [
            "Can you help me find a one way flight?",
            "I would like 4 seats, departing from Phoenix.",
            "I plan to fly out on the 2nd.",
            "I am flying to Seattle.",
            "Can you please find me another flight?",
            "What is the class of the ticket and what airport does it land at?",
            "Please find me something else.",
            "All right. Can you please find me a round trip flight, and I have 0 bags to check.",
            "I plan to return next Monday, and can the flight be economy?",
            "What airport does the plane take off from and land at?",
            "All right, thank you. That is all I need for now."
        ],
        "system_utterance": [
            "Which city do you want to depart from?",
            "What date would you like to travel?",
            "What is the planned destination?",
            "I found a flight on American Airlines with 1 layover that departs at 10:45 am and costs $224 per ticket.",
            "I have located a flight on Southwest Airlines with 1 layover that departs at 1:35 pm and costs $257 per ticket.",
            "It is an economy seat and arrives at the Seattle-Tacoma International Airport.",
            "I have located a flight on United Airlines that has 1 layover that departs at 5:05 pm and costs $241 per ticket.",
            "What day are you looking to return?",
            "I have located 1 flight for you on United Airlines. The flight departs at 5:05 pm and the return flight departs at 10:45 am. The cost per ticket is $457.",
            "The flight departs from Sky Harbor International Airport and lands at Seattle-Tacoma International Airport.",
            "Ok, have a good day."
        ]
    },
    {
        "dialogue_id": "1_00099",
        "service": "Flights_3",
        "service_call": {
            "method": {
                "method": "SearchRoundtripFlights",
                "parameters": {
                    "airlines": "Southwest Airlines",
                    "departure_date": "2019-03-06",
                    "destination_city": "New York",
                    "flight_class": "Economy",
                    "origin_city": "Phoenix",
                    "return_date": "2019-03-08"
                }
            }
        },
        "user_utterance": [
            "Help me find a one way economy flight on the 6th of March",
            "I'm leaving from Phoenix and going to New York",
            "I want to find a round trip instead, make my return the 8th of March",
            "When does that flight arrive and which airport will I leave from?",
            "Alright that's it for now"
        ],
        "system_utterance": [
            "Where are you headed? And where are you leaving from?",
            "How about flying on a Southwest Airlines flight at 4:10 am with 1 layover and costing $311",
            "OK, what about this Southwest Airlines flight leaving at 4:10 am and a return flight leaving at 6:25 am costing $609 a head.",
            "You'll arrive at 3 pm and leave from Sky Harbor International AIrport.",
            "Great, have a great day"
        ]
    },
    {
        "dialogue_id": "1_00100",
        "service": "Flights_3",
        "service_call": {
            "method": {
                "method": "SearchRoundtripFlights",
                "parameters": {
                    "airlines": "Delta Airlines",
                    "departure_date": "2019-03-11",
                    "destination_city": "Sydney",
                    "origin_city": "Los Angeles",
                    "passengers": "4",
                    "return_date": "2019-03-13"
                }
            }
        },
        "user_utterance": [
            "Will you find me one way flights to Sydney?",
            "11th of this month.",
            "Los Angeles.",
            "Anything else?",
            "Will you find something for four people?",
            "I would like round trip flights.",
            "13th of March.",
            "Does the flight arrive the day after?",
            "Great.",
            "No, that's all."
        ],
        "system_utterance": [
            "What date?",
            "Which city?",
            "I found 5 flights. One of them is Alaska Airlines that takes off at 11:30 am with 0 layovers. It costs $198 per passenger.",
            "How about American Airlines for $233 per passenger that takes off 12:10 pm with 0 layovers?",
            "I found Delta Airlines for $312 per passenger that takes off at 4:35 am with 1 layover.",
            "Which day is your return flight?",
            "I found 1 flight on Delta Airlines for $477 per passenger that takes off at 4:35 am. Return flight takes off at 2:50 am.",
            "Yes, it arrives at its destination the next day.",
            "Anything else?",
            "Have a wonderful day."
        ]
    },
    {
        "dialogue_id": "1_00101",
        "service": "Flights_3",
        "service_call": {
            "method": {
                "method": "SearchRoundtripFlights",
                "parameters": {
                    "airlines": "United Airlines",
                    "departure_date": "2019-03-04",
                    "destination_city": "Chicago",
                    "flight_class": "Economy",
                    "origin_city": "San Francisco",
                    "return_date": "2019-03-06"
                }
            }
        },
        "user_utterance": [
            "Can you help me find a one way flight?",
            "I'm looking for a flight from San Francisco with United Airlines leaving on the 4th of this month.",
            "I'm headed to Chicago",
            "Alright, what about a round trip with a return Wednesday next week. Find me an economy class ticket.",
            "Can I check in two bags? What airport does it leave from?",
            "Alright, that's it for now"
        ],
        "system_utterance": [
            "Sure. What date and what city are you coming from?",
            "Where you planning to go?",
            "I found 1 flight via United Airlines that leaves at 11 pm and has 0 layovers that will cost $157",
            "I found 1 flight with United Airlines that leaves at 11 pm and a return flight at 7:45 am. It'll cost $426",
            "0 bags are allowed, and the flight leaves from SFO International Airport",
            "Got it, take care"
        ]
    },
    {
        "dialogue_id": "1_00102",
        "service": "Flights_3",
        "service_call": {
            "method": {
                "method": "SearchRoundtripFlights",
                "parameters": {
                    "airlines": "American Airlines",
                    "departure_date": "2019-03-06",
                    "destination_city": "London",
                    "origin_city": "San Francisco",
                    "return_date": "2019-03-08"
                }
            }
        },
        "user_utterance": [
            "I need to attend a function in my cousin house. so i need to travel. Will you find a one way flight?",
            "I need to depart from San Francisco. I wish to fly with American airlines to London.",
            "It should be on Wednesday next week",
            "Ok thats great. Will you find round trip flights?",
            "It should be on next Friday.",
            "Thanks, it sounds good to me"
        ],
        "system_utterance": [
            "From which city you want to depart?",
            "In which date would you like to travel?",
            "There is 1 flight that suits your needs. It is an American Airlines and flight depart at 6 pm local time and the itinerary has 1 layovers and its costs is $373 per passenger.",
            "In which date do you want to take the return flight?",
            "Ok You wisht to fly with American airlines and flight takes off at 6 pm local time and return flight takes off at 2 am local time. it costs is $742 per passenger.",
            "Take care have a great day"
        ]
    },
    {
        "dialogue_id": "1_00103",
        "service": "Flights_3",
        "service_call": {
            "method": {
                "method": "SearchRoundtripFlights",
                "parameters": {
                    "airlines": "American Airlines",
                    "departure_date": "2019-03-12",
                    "destination_city": "Philadelphia",
                    "origin_city": "New York",
                    "passengers": "1",
                    "return_date": "2019-03-14"
                }
            }
        },
        "user_utterance": [
            "I'm going on vacation pretty soon. Can you find me a one seat one-way flight?",
            "I plan on flying to Philadelphia on the 12th of March.",
            "I will be leaving New York.",
            "At what time will the flight arrive at Philadelphia?",
            "What airport will the flight go to?",
            "Got it. I'd like to find a round trip flight.",
            "I intend on returning on the 14th.",
            "Good to know.",
            "Not now. Thanks."
        ],
        "system_utterance": [
            "What is your planned date of departure, and what is your intended destination?",
            "What city do you plan on departing from?",
            "Do you want to take a flight from American Airlines? It leaves at 7:55 am local time, has 0 layovers, and a ticket costs you $64.",
            "It takes about an hour. Specifically, it will land at 8:46 am local time.",
            "It will land at PHL International Airport.",
            "On what day do you plan on going back to New York?",
            "I found 1 flight that suits your needs, hosted by American Airlines. It takes off at 7:55 am local time, whereas the returning flight takes off at 8:45 pm local time. A ticket for the flight costs $123 per passenger.",
            "Is there anything else I can help you with?",
            "Have yourself a wonderful day."
        ]
    },
    {
        "dialogue_id": "1_00104",
        "service": "Flights_3",
        "service_call": {
            "method": {
                "method": "SearchRoundtripFlights",
                "parameters": {
                    "airlines": "American Airlines",
                    "departure_date": "2019-03-11",
                    "destination_city": "Toronto",
                    "number_checked_bags": "0",
                    "origin_city": "Chicago",
                    "return_date": "2019-03-13"
                }
            }
        },
        "user_utterance": [
            "Can you help me find a one way flight?",
            "I'm flying to Toronto from Chicago on the 11th",
            "What about a round trip flight, with 0 bags to check in?",
            "I want to go back on March 13th",
            "Where does the flight land? And does it arrive on the next day?",
            "Alright that is all I need"
        ],
        "system_utterance": [
            "Where are you planing to go? And which city are you leaving from and when do you want to travel?",
            "I found 3 flights. How about a American Airlines flight leaving at 3:50 pm with 0 layovers for $93",
            "Which day do you want to take the flight back?",
            "How about flying on American airlines with a 3:50 pm take off and a 10:45 am return flight for $185?",
            "The flight arrives same day at Toronto Pearson International Airport",
            "Have a good one"
        ]
    },
    {
        "dialogue_id": "1_00105",
        "service": "Flights_3",
        "service_call": {
            "method": {
                "method": "SearchRoundtripFlights",
                "parameters": {
                    "airlines": "Delta Airlines",
                    "departure_date": "2019-03-03",
                    "destination_city": "Seattle",
                    "origin_city": "New York",
                    "passengers": "4",
                    "return_date": "2019-03-05"
                }
            }
        },
        "user_utterance": [
            "My long awaited vacation is coming up. I want 4 seats on a one way flight aboard Delta Airlines.",
            "I want to fly from New York to Seattle on the 3rd of March.",
            "What is the name of the airport that I would be departing from?",
            "That would be fine. I would need a round trip flight.",
            "On Tuesday next week.",
            "That would be First Class seat?",
            "Ok. Thanks. That would be all."
        ],
        "system_utterance": [
            "When would you like to make the trip? Where would you be heading and from which city would you be leaving?",
            "There is 1 flight available on Delta Airlines that leaves at 7:10 pm. There would be 1 layover and the price is $301.",
            "The flight leaves JFK International Airport at 1:17 am.",
            "When would you like to return?",
            "There is 1 flight available on Delta Airlines. It leaves at 7:10 pm and returns at 8:05 am local time. The price of the ticket is $564.",
            "It is an Economy ticket.",
            "Enjoy your day."
        ]
    },
    {
        "dialogue_id": "1_00106",
        "service": "Flights_3",
        "service_call": {
            "method": {
                "method": "SearchRoundtripFlights",
                "parameters": {
                    "airlines": "Delta Airlines",
                    "departure_date": "2019-03-08",
                    "destination_city": "San Francisco",
                    "flight_class": "Economy",
                    "number_checked_bags": "0",
                    "origin_city": "Seattle",
                    "return_date": "2019-03-10"
                }
            }
        },
        "user_utterance": [
            "I'm looking for a one way flight for an upcoming trip I have. Can you help?",
            "I am going to be traveling from Seattle to San Francisco.",
            "I need to leave on the 8th of this month.",
            "That will not work. Can you find me something different?",
            "Can you find me something else that is economy class. I have zero bags to check if that helps.",
            "How about round trip flights that return on the 10th?",
            "What times do the two flights arrive at their destinations?",
            "Okay, thanks for your help. That will be all."
        ],
        "system_utterance": [
            "Sure, I just need to know where you are departing and arriving at.",
            "Great, and what dates are you looking to travel on?",
            "I found a flight with Alaska Airlines, departing at 11:35 pm with 0 layovers, and the total price is $135. How does that sound?",
            "I also have an American Airlines flight that departs at 7:50 pm has 0 layovers, and costs $121. Are you interested in that one?",
            "What about Delta Airlines? That flight departs at 8:25 pm, with 0 layovers, and the ticket costs $121.",
            "There is 1 flight matching that criteria. It is Delta Airlines, the departure time is 8:25 pm, the return flight takes off at 2:30 pm, and the ticket price is $241 per per person.",
            "The destination flight arrives at 10:36 pm and the returning flight arrives at 4:41 pm.",
            "Have a good day and a safe trip!"
        ]
    },
    {
        "dialogue_id": "1_00107",
        "service": "Flights_3",
        "service_call": {
            "method": {
                "method": "SearchRoundtripFlights",
                "parameters": {
                    "airlines": "United Airlines",
                    "departure_date": "2019-03-05",
                    "destination_city": "New York",
                    "origin_city": "Phoenix",
                    "return_date": "2019-03-07"
                }
            }
        },
        "user_utterance": [
            "Can you help me find a one way United Airlines flight",
            "How about next Tuesday",
            "Let's find flights from Phoenix",
            "I'm going to New York",
            "Does it arrive the next day? And can I check in one bag?",
            "Great, now find me a round trip flight with a March 7th return date",
            "When does that flight arrive? And how many passengers can you book?",
            "Alright, that's all I need"
        ],
        "system_utterance": [
            "What date do you want to travel?",
            "What city do you want to leave from?",
            "Ok got it, and where are you headed?",
            "I found 1 flight with United Airlines that leaves at 6:10 pm and has 1 layover. It'll cost $331, how does that sound?",
            "You're allowed 0 bags unfortunately. And the flight does arrive the next day.",
            "Is this United Airlines flight that leaves at 6:10 pm and returns at 5:15 am and costs $560",
            "This is for 1 passenger and it arrives at 6:20 am",
            "Great, have a good one"
        ]
    },
    {
        "dialogue_id": "1_00108",
        "service": "Flights_3",
        "service_call": {
            "method": {
                "method": "SearchRoundtripFlights",
                "parameters": {
                    "airlines": "American Airlines",
                    "departure_date": "2019-03-10",
                    "destination_city": "Los Angeles",
                    "flight_class": "Economy",
                    "origin_city": "Delhi",
                    "return_date": "2019-03-14"
                }
            }
        },
        "user_utterance": [
            "I want an Economy one-way flight",
            "I want to go to Los Angeles from Delhi",
            "I wan to fly with American Airlines on the 10th of March",
            "When does it arrive?",
            "Can you get this for one person?",
            "Ok, good",
            "I want a round trip that returns on the 14th of March",
            "Ok, thanks that's all"
        ],
        "system_utterance": [
            "Where are you going to and from",
            "When are you going?",
            "There is an American Airlines flight at 7:40 am with 1 layover for $393 per person.",
            "It gets in at 10:30 am local time.",
            "Yes for 1 passenger",
            "Do you need any other help?",
            "Do you want to fly with American Airlines, which takes off at 7:40 am and the return leaves at 11:35 am local time. It will cost $797 per person",
            "Ok, have a good day."
        ]
    },
    {
        "dialogue_id": "1_00109",
        "service": "Flights_3",
        "service_call": {
            "method": {
                "method": "SearchRoundtripFlights",
                "parameters": {
                    "airlines": "American Airlines",
                    "departure_date": "2019-03-06",
                    "destination_city": "Chicago",
                    "origin_city": "New York",
                    "return_date": "2019-03-08"
                }
            }
        },
        "user_utterance": [
            "I have a plan for a short trip for which I need to search for an one way flight.",
            "I am planning to visit Chicago from New York on next Wednesday and I need a flight from American Airlines.",
            "From which Airport the flight leaves and when it reaches the destination?",
            "That is okay, can you search for a round trip flight?",
            "returning date will be 8th of March.",
            "What is the time of arrival of return flight?",
            "Thanks for your information.",
            "No, that's all now."
        ],
        "system_utterance": [
            "When and where are you leaving from and which city do you like to visit?",
            "I found 1 result that is a flight from American Airlines which leaves at 8:50 am local time with ticket cost $129 for single person and it has 0 layovers. Is that okay with you?",
            "Origin Airport is JFK International Airport and the flight will reach the destination on the same day.",
            "When do you like to book the return flight?",
            "What about a flight with American Airlines leaves at 8:50 am local time and the returning flight time is 9:40 am under ticket cost $232 per person? Is that convenient to you?",
            "It is at 12:59 pm, Is that okay to you?",
            "Anything else you want?",
            "Have a great day."
        ]
    },
    {
        "dialogue_id": "1_00110",
        "service": "Flights_3",
        "service_call": {
            "method": {
                "method": "SearchRoundtripFlights",
                "parameters": {
                    "airlines": "American Airlines",
                    "departure_date": "2019-03-11",
                    "destination_city": "Mexico City",
                    "number_checked_bags": "0",
                    "origin_city": "San Francisco",
                    "passengers": "3",
                    "return_date": "2019-03-13"
                }
            }
        },
        "user_utterance": [
            "I have a plan for a short trip and I need to book flight for which I need your help, can you search for an one way flight?",
            "Ya, need flight from San Francisco to Mexico City, Is that possible?",
            "trip will be on 11th of March, please search accordingly.",
            "Please search for some other flights and I have zero bags to carry.",
            "That is okay but I need to search for round trip flights for three persons.",
            "Return date will be 13th of this month.",
            "Thanks and all are useful information to me."
        ],
        "system_utterance": [
            "Yes, I can search and let me know the start and end place of your trip.",
            "Yes, of course, and also let me know the date of visit, so that I can search?",
            "What about a flight with Alaska Airlines which leaves at 11:05 am local time and with itinerary has 0 layovers?. The ticket cost will be at $154 per person.",
            "Found 3 results and one is a flight with American Airlines which takes off at 10:10 pm with itinerary 0 layovers for which the ticket price will be $175 per person. Is this information useful?",
            "When is the return date?",
            "1 American Airlines flight which leaves at 10:10 pm and the return flight takes off at 11:40 am local time which costs $317 per person. Is that okay?",
            "Have a wonderful day."
        ]
    },
    {
        "dialogue_id": "1_00111",
        "service": "Flights_3",
        "service_call": {
            "method": {
                "method": "SearchRoundtripFlights",
                "parameters": {
                    "airlines": "Delta Airlines",
                    "departure_date": "2019-03-06",
                    "destination_city": "Seattle",
                    "flight_class": "Economy",
                    "origin_city": "San Francisco",
                    "passengers": "2",
                    "return_date": "2019-03-08"
                }
            }
        },
        "user_utterance": [
            "I want to find a one way flight from San Francisco, can you help me out?",
            "I want to fly to Seattle?",
            "I want to travel on the 6th, on an economy flight.",
            "Can you find me something else, I specifically want 2 seats for this flight?",
            "Where will the plane arrive?",
            "Will it arrive the day after?",
            "Can you find me something else?",
            "That sounds all right.",
            "Can you find me round trip flights?",
            "I want to return on the 8th.",
            "That sounds great, thanks.",
            "Yes, that is all, thanks for your help."
        ],
        "system_utterance": [
            "What is your destination?",
            "When will you be traveling?",
            "Would you be interested in Alaska Airlines, it has 0 layovers and will depart at 9:55 am, only costing $138 per passenger?",
            "How about a American Airlines from 4 flights, it costs $125 per person with 0 layovers, and will leaves at 9:30 am?",
            "The plane will arrive at Seattle-Tacoma International Airport.",
            "The flight arrives at the destination on the same day it departs.",
            "How about Delta Airlines, it leaves at 2:30 pm, and it costs $133 per person with 0 layovers?",
            "Is there anything else I can help you with?",
            "On what day are you planning on taking a return flight?",
            "There is 1 flight available on Delta Airlines, it will take off at 2:30 pm and its return flight will leave at 8:25 pm. Ticket prices are $239 per person, is that alright by you?",
            "Will that be all I can help you with?",
            "Hope you have a good day."
        ]
    },
    {
        "dialogue_id": "1_00112",
        "service": "Flights_3",
        "service_call": {
            "method": {
                "method": "SearchRoundtripFlights",
                "parameters": {
                    "airlines": "Delta Airlines",
                    "departure_date": "2019-03-01",
                    "destination_city": "Washington",
                    "flight_class": "Economy",
                    "origin_city": "Chicago",
                    "passengers": "3",
                    "return_date": "2019-03-03"
                }
            }
        },
        "user_utterance": [
            "I have some long over due vacation time approaching and would like to book a one way flight.",
            "I would like to depart from Chicago on the 1st of this month and will be traveling to Washington. My preferred airline is Delta Airlines.",
            "What date and time will the flight arrive at my destination?",
            "Okay, now can you look into some round trip flights for me?",
            "For the return flight I will need a total of 3 economy class seats that returns on the 3rd of March.",
            "Okay",
            "Nope, that is all I needed for now. Thanks for the help."
        ],
        "system_utterance": [
            "I'm happy to help you with that. Can you tell me the dates you are looking to travel, where you want o depart from, and the location of your destination do I can narrow down the search for you?",
            "I was able to find 1 flight with Delta Airlines that has 0 layovers, is $109 per ticket, and departs at 2:30 pm. Has does that flight sound?",
            "That particular flight arrives at your destination on the same day as the departure at 5:28 pm.",
            "Sure, what day do you want to return?",
            "Delta Airlines currently has a flight that leaves at 4:05 pm, the return flight departs at 4:20 am, and the total cost of the tickets are $309 each.",
            "Can I find anything else for you?",
            "You're welcome, I'm happy to help."
        ]
    },
    {
        "dialogue_id": "1_00113",
        "service": "Flights_3",
        "service_call": {
            "method": {
                "method": "SearchRoundtripFlights",
                "parameters": {
                    "airlines": "American Airlines",
                    "departure_date": "2019-03-08",
                    "destination_city": "Phoenix",
                    "flight_class": "Premium Economy",
                    "origin_city": "Chicago",
                    "return_date": "2019-03-10"
                }
            }
        },
        "user_utterance": [
            "Can you get me some Premium Economy one-way tickets?",
            "I'm leaving from Chicago and going to Phoenix - I'm leaving March 8th.",
            "Maybe. Can you look for some round-trip flights too?",
            "I'd be returning on the 10th.",
            "Alright, when does the return flight arrive at the airport? Where does it land?",
            "Okay, good, that's all I need."
        ],
        "system_utterance": [
            "Okay, I'll need to ask you for a little more information to help you: Where will you be leaving from, where would you like to go, and what is your preferred date to travel on?",
            "How about American Airlines? There's a flight leaving at 8:25 am with 1 layover for $442 per ticket.",
            "What day would you like to return on?",
            "Okay, I have an American Airlines flight here that takes off at 8:25 am and returns at 9:30 am, it's $899 per ticket.",
            "The flight will land at Sky Harbor International Airport, it arrives at 7:22 pm.",
            "Have a great day."
        ]
    },
    {
        "dialogue_id": "1_00114",
        "service": "Flights_3",
        "service_call": {
            "method": {
                "method": "SearchRoundtripFlights",
                "parameters": {
                    "airlines": "American Airlines",
                    "departure_date": "2019-03-02",
                    "destination_city": "Washington",
                    "number_checked_bags": "0",
                    "origin_city": "Chicago",
                    "passengers": "1",
                    "return_date": "2019-03-04"
                }
            }
        },
        "user_utterance": [
            "I am looking for a one-way flight, please.",
            "I want to fly this Saturday",
            "Look for flights from Chicago to Washington, please.",
            "Alright, scrap that. I want a round trip. I have zero bags and all I want is 1 seat.",
            "I want to return next Monday.",
            "All right that sounds like a plan.",
            "No, that is all I need."
        ],
        "system_utterance": [
            "What date are you wanting to travel?",
            "Which city are you departing from and where are you going?",
            "Would you like to fly with American Airlines or someone else? There is one here that takes of at 9:40 am with 1 layover and costs $194 per ticket.",
            "Which day would you like to take this return flight?",
            "I have 1 flight just for you. American Airlines, take off at 9:40 am local and return at 6:40 pm local. It will cost $293 per person.",
            "Can I do anything else for you?",
            "Have a fantastic journey."
        ]
    },
    {
        "dialogue_id": "1_00115",
        "service": "Flights_3",
        "service_call": {
            "method": {
                "method": "SearchRoundtripFlights",
                "parameters": {
                    "airlines": "Delta Airlines",
                    "departure_date": "2019-03-10",
                    "destination_city": "Chicago",
                    "number_checked_bags": "0",
                    "origin_city": "Seattle",
                    "passengers": "2",
                    "return_date": "2019-03-12"
                }
            }
        },
        "user_utterance": [
            "I will be traveling soon with some friends. I need four one way flight tickets from any airline.",
            "We will be departing on the 10th of this month from Seattle with destination to Chicago.",
            "Is there antyhing else? There are 0 bags to check in.",
            "Find something different and find two seats.",
            "Which airport does it depart from?",
            "When does it arrive and is it a Business class ticket?",
            "Thinking about it, I need a round trip flight.",
            "I want a return date of March 12th.",
            "That sounds good.",
            "No, that would be all."
        ],
        "system_utterance": [
            "What is your departure date and from where are you leaving? What is the destination?",
            "Is Alaska Airlines alright for you? There is a flight that takes off at 11:10 am with a price of $322 per ticket. It has 1 layover.",
            "There are 4 flights that match your criteria Is American Airlines alright for you? There is a flight that takes off at 10:35 am with a price of $183 per ticket. It has 0 layovers.",
            "Is Delta Airlines alright for you? There is a flight that takes off at 8:05 am with a price of $156 per ticket. It has 0 layover.",
            "It departs from Seattle-Tacoma International Airport.",
            "It is an Economy class ticket and the flight arrives the same day it departs.",
            "What is the return date?",
            "Is Delta Airlines alright for you? There is a flight that takes off at 8:05 am and the return flight takes off 5:45 am with a price of $436 per ticket. It has 0 layover.",
            "Is there something else I can help you with?",
            "Have a great day."
        ]
    },
    {
        "dialogue_id": "1_00116",
        "service": "Flights_3",
        "service_call": {
            "method": {
                "method": "SearchRoundtripFlights",
                "parameters": {
                    "airlines": "Southwest Airlines",
                    "departure_date": "2019-03-03",
                    "destination_city": "Seattle",
                    "flight_class": "Economy",
                    "origin_city": "New York",
                    "return_date": "2019-03-05"
                }
            }
        },
        "user_utterance": [
            "Can you help me find a one way flight please",
            "I'm going from New York to Seattle.",
            "I want to fly out on the weekend, this Sunday",
            "Find me another option",
            "Where does it land? And is this ok for two passengers?",
            "Find me an economy class ticket instead",
            "Yes that works, but find me a round trip flight",
            "I'm coming back next Tuesday",
            "All right then",
            "No, that's it thanks"
        ],
        "system_utterance": [
            "Where are you headed? And where are you leaving from?",
            "What is your travel date?",
            "I found 4 flights that work. How about this American Airlines flight that leaves at 5:10 pm and ha 1 layover. It costs $325",
            "How about with Delta Airlines? Also has 1 layover that costs $301 and leaves at 7:10 pm",
            "This is just for 1 passenger, and it's headed to Seattle-Tacoma International Airport",
            "I found 2 flights that work. How about Southwest airlines with 1 layover and a 6:25 am departure for $298",
            "When do you want to return?",
            "I found 1 flight that works via Southwest Airlines and leaves at 6:25 am local time. The return flight leaves at 3:05 pm and will cost $592 per head.",
            "Can I help with anything else?",
            "Have a good trip!"
        ]
    },
    {
        "dialogue_id": "1_00117",
        "service": "Flights_3",
        "service_call": {
            "method": {
                "method": "SearchRoundtripFlights",
                "parameters": {
                    "airlines": "American Airlines",
                    "departure_date": "2019-03-08",
                    "destination_city": "Atlanta",
                    "origin_city": "San Francisco",
                    "return_date": "2019-03-10"
                }
            }
        },
        "user_utterance": [
            "I am interested in finding a one way flight.",
            "To Atlanta I will fly.",
            "From San Francisco on 8th of this month.American Airlines is perfect for me.",
            "I understand.Find me round trip flights.",
            "I want to be on March 10th.",
            "OK.I see!",
            "No is enough for now. Thanks!"
        ],
        "system_utterance": [
            "Where do you prefer to leave?",
            "The departure will be made from what city?",
            "1 flight is available according to your preferences.With American Airlines at 7:15 am locat time with itinerary 0 layovers.Cost of the ticket is $174.",
            "In witch day you want to take the return flight?",
            "I have 1 option with American Airlines at 7:15 am and return take off at 11 am local time.Cost per passenger is $459.",
            "Anything else I can do for you?",
            "Have a great day!"
        ]
    },
    {
        "dialogue_id": "1_00118",
        "service": "Flights_3",
        "service_call": {
            "method": {
                "method": "SearchRoundtripFlights",
                "parameters": {
                    "airlines": "Delta Airlines",
                    "departure_date": "2019-03-12",
                    "destination_city": "Atlanta",
                    "flight_class": "Economy",
                    "origin_city": "San Francisco",
                    "passengers": "2",
                    "return_date": "2019-03-14"
                }
            }
        },
        "user_utterance": [
            "I need a one way flight leaving on the 12th of March.",
            "I'm leaving from San Francisco and going to Atlanta.",
            "Can you find me something else? I need three Economy class tickets.",
            "Anything else? I need two seats, preferably on Delta Airlines.",
            "What are the departure and arrival airports?",
            "Good. I want round trip flights.",
            "The 14th of March.",
            "All right.",
            "No. Thanks for your help."
        ],
        "system_utterance": [
            "What is your departure city and destination?",
            "Alaska Airlines has a 3 pm flight with 0 layovers. The ticket costs $174 per passenger.",
            "I found 4 flights. American Airlines has a 7:15 am flight with 0 layovers for $208 per passenger.",
            "I found you 1 flight with 1 layover on Delta Airlines. It departs at 4:05 pm local time and costs $273 per passenger.",
            "The flight departs from SFO International Airport and arrives at the Hartsfield-Jackson International Airport.",
            "What is your return date?",
            "I found you 1 flight on Delta Airlines. It departs at 4:05 pm local time and the return flight departs at 7:55 pm local time. The ticket is $561 per passenger.",
            "Can I help you with anything else?",
            "Your welcome. Have a nice day."
        ]
    },
    {
        "dialogue_id": "1_00119",
        "service": "Flights_3",
        "service_call": {
            "method": {
                "method": "SearchRoundtripFlights",
                "parameters": {
                    "airlines": "Delta Airlines",
                    "departure_date": "2019-03-07",
                    "destination_city": "Philadelphia",
                    "number_checked_bags": "0",
                    "origin_city": "Vancouver",
                    "passengers": "2",
                    "return_date": "2019-03-09"
                }
            }
        },
        "user_utterance": [
            "Please help me find 2 seats on a one way flight, with zero bags to check in.",
            "I'd like to depart on 7th of this month.",
            "I'll be going to Philadelphia. The ticket class doesn't matter.",
            "Please search for flights from Vancouver.",
            "That sounds good, but I've just been asked to attend a job interview in Vancouver on the 10th of March. Please find me round trip tickets.",
            "I would like to return on March 9th so that I can make it to my interview.",
            "Sounds good.",
            "No. Thank you very much. You've been very helpful."
        ],
        "system_utterance": [
            "When would you like to to fly out?",
            "Please let me have you destination.",
            "May I have your origin city?",
            "Your search has yielded 2 flights. Do you like flying on Delta Airlines? They have seats costing $314 per passenger on a flight with 1 layover, leaving at 2:30 am local time.",
            "Sure, no problem. When would you like to return?",
            "Okay, I've found 1 flight that you may like. How does Delta Airlines sound? They have seats available on a flight taking off at 2:30 am local time,with a returning flight scheduled for 4:05 pm local time, at a cost of $876 per seat.",
            "Will there be anything else?",
            "Have a great day."
        ]
    },
    {
        "dialogue_id": "1_00120",
        "service": "Flights_3",
        "service_call": {
            "method": {
                "method": "SearchRoundtripFlights",
                "parameters": {
                    "airlines": "American Airlines",
                    "departure_date": "2019-03-06",
                    "destination_city": "Atlanta",
                    "flight_class": "Economy",
                    "number_checked_bags": "0",
                    "origin_city": "Toronto",
                    "return_date": "2019-03-08"
                }
            }
        },
        "user_utterance": [
            "I want to find a one way economy ticket.",
            "I want to fly out next Wednesday from Toronto to Atlanta",
            "When does the flight arrive at my destination?",
            "Find me another flight",
            "Sure, how many tickets?",
            "Great, now find me some round trip flights with a March 8th return. I have 0 bags to check",
            "Sure, that's all I need at the moment."
        ],
        "system_utterance": [
            "Where are you planning to go, and which city are you leaving from? Also what are your travel dates?",
            "Would you like to fly on Air Canada at 4:30 am with 1 layover and wil cost $217 again.",
            "It gets it at 12:37 pm local time",
            "How about a 1 layover. 2:20 am flight via American Airlines that costs $223",
            "I'm traveling solo, so just for 1",
            "I found 1 flight on American Airlines that leaves at 2:20 am and has a return flight at 9:40 am. It'll cost $421",
            "Got it, have a good one"
        ]
    },
    {
        "dialogue_id": "1_00121",
        "service": "Flights_3",
        "service_call": {
            "method": {
                "method": "SearchRoundtripFlights",
                "parameters": {
                    "airlines": "American Airlines",
                    "departure_date": "2019-03-01",
                    "destination_city": "San Francisco",
                    "number_checked_bags": "0",
                    "origin_city": "Philadelphia",
                    "return_date": "2019-03-03"
                }
            }
        },
        "user_utterance": [
            "Find me please one way flight to San Francisco.",
            "I want to go from Philadelphia with 0 bags.The fly out will be on the 1st.",
            "Good.Find me round trip flights please.",
            "On 3rd of March I plan to retun.",
            "I understand. Thanks for the information."
        ],
        "system_utterance": [
            "In which city you will depart and what will be the date?",
            "3 flights i found for you.American Airlines you can take at 2:35 pm local time and have 1 layovers.Price for one ticket is $308.",
            "In which day you want to be the return?",
            "What about American Airlines ?You can take it at 5:50 pm and return at 5 am both will be at local time .Cost will be $573 per ticket.",
            "Have a great day!"
        ]
    },
    {
        "dialogue_id": "1_00122",
        "service": "Flights_3",
        "service_call": {
            "method": {
                "method": "SearchRoundtripFlights",
                "parameters": {
                    "airlines": "American Airlines",
                    "departure_date": "2019-03-07",
                    "destination_city": "Las Vegas",
                    "number_checked_bags": "0",
                    "origin_city": "Seattle",
                    "return_date": "2019-03-09"
                }
            }
        },
        "user_utterance": [
            "Find me a one way flight.",
            "I am going to Las Vegas on March 7th.",
            "I have zero bags and want to depart from Seattle.",
            "What else do you have?",
            "What airport does it land at?",
            "Did you say this was for 2 people?",
            "That works. Can you find round trip tickets?",
            "I want to get back on March 9th.",
            "Does the flight land the next day?",
            "Thanks a lot.",
            "No, that is all. Thanks."
        ],
        "system_utterance": [
            "Where are you going?",
            "Where are you departing from?",
            "I found an Alaska Airlines flight with 1 layover that leaves at 7:30 am and costs $215 per person.",
            "I found an American Airlines flight with 1 layover that departs at 1:40 pm and it costs $253 per person.",
            "It lands at McCarran International Airport.",
            "This is for 1 person.",
            "When are you returning?",
            "Search revealed 1 flight. It is an American Airlines flight that departs at 1:40 pm and the second flight departs at 1:55 pm. It costs $454 per person.",
            "It arrives on the same day.",
            "Do you need anything more?",
            "Have a fantastic day."
        ]
    },
    {
        "dialogue_id": "1_00123",
        "service": "RideSharing_1",
        "service_call": {
            "method": {
                "method": "GetRide",
                "parameters": {
                    "destination": "Wang Wah",
                    "number_of_riders": "1",
                    "shared_ride": "True"
                }
            }
        },
        "user_utterance": [
            "Can you help me call a cab please?",
            "Yes shared ride for one is good",
            "I'm trying to get to Wang Wah",
            "That's right. How long is the ride and how much is it?",
            "Thanks for your help",
            "No for now we're great."
        ],
        "system_utterance": [
            "How many people do you need? And is a shared right ok?",
            "Where are you headed?",
            "So please confirm that you need a shared cab for 1 person to Wang Wah yes?",
            "It's gonna cost $11.08 and will take around 9 minutes. Your cab is on the way",
            "Do you need anything else?",
            "Enjoy your cab ride"
        ]
    },
    {
        "dialogue_id": "1_00124",
        "service": "RideSharing_1",
        "service_call": {
            "method": {
                "method": "GetRide",
                "parameters": {
                    "destination": "1546 Maurice Lane",
                    "number_of_riders": "1",
                    "shared_ride": "True"
                }
            }
        },
        "user_utterance": [
            "I want to call a cab",
            "I am going to 5434 Ygnacio Valley Road #90",
            "That works for me",
            "Actually, I need to go to 1546 Maurice Lane. Just one person",
            "That is correct",
            "Awesome, thank you",
            "That's all I need"
        ],
        "system_utterance": [
            "Sure, where are you heading?",
            "How about a shared ride?",
            "How many people are travelling?",
            "Ok, so you want a cab for 1 going to 1546 Maurice Lane?",
            "Ok, that cab is on its way",
            "You're welcome, anything else?",
            "Have a great day"
        ]
    },
    {
        "dialogue_id": "1_00125",
        "service": "RideSharing_1",
        "service_call": {
            "method": {
                "method": "GetRide",
                "parameters": {
                    "destination": "Iberia",
                    "number_of_riders": "3",
                    "shared_ride": "True"
                }
            }
        },
        "user_utterance": [
            "Can you help me find a cab for 3 people?",
            "A shared ride is fine. I'm going to Matador.",
            "Actually I need to go to Iberia instead.",
            "Yes that's correct.",
            "How long will the journey take?",
            "Thanks a lot.",
            "No thanks, that's all for now."
        ],
        "system_utterance": [
            "Are you looking for a shared ride? What is your destination?",
            "So that's a shared ride for 3 people to Matador.",
            "Okay so that's 3 people travelling to Iberia.",
            "Your cab has been successfully booked.",
            "It will be around 7 minutes depending on traffic.",
            "Do you need help with anything else?",
            "Enjoy your day."
        ]
    },
    {
        "dialogue_id": "1_00126",
        "service": "RideSharing_1",
        "service_call": {
            "method": {
                "method": "GetRide",
                "parameters": {
                    "destination": "Hop Creek Pub",
                    "number_of_riders": "1",
                    "shared_ride": "True"
                }
            }
        },
        "user_utterance": [
            "Call me a cab please. Going to Hop Creek Pub. It can be a shared ride.",
            "Just one",
            "Yes that's right. How much is it?",
            "Thanks so much"
        ],
        "system_utterance": [
            "How many people are going?",
            "Please confirm: a shared ride to Hop Creek Pub for 1 person?",
            "Your ride will be here soon. It costs $14.57.",
            "Here to help anytime"
        ]
    },
    {
        "dialogue_id": "1_00127",
        "service": "RideSharing_1",
        "service_call": {
            "method": {
                "method": "GetRide",
                "parameters": {
                    "destination": "CineLux Delta Cinema Saver",
                    "number_of_riders": "1",
                    "shared_ride": "True"
                }
            }
        },
        "user_utterance": [
            "Can you please help me contact a cab?",
            "I need the ride for one person and I am going to CineLux Delta Cinema Saver.",
            "I am ok with a shared ride.",
            "Yes, that is correct.",
            "How much is the cost?",
            "Thank you for your help, that is all I need."
        ],
        "system_utterance": [
            "Where do you want a ride to and for how many people?",
            "Would you like a shared ride?",
            "Please confirm the following details: Scheduling a shared ride for 1 person to go to the CineLux Delta Cinema Saver.",
            "Your ride is booked and the cab is on the way.",
            "The cost is $8.00.",
            "Have a great day."
        ]
    }
]