[
    {
        "dialogue_id": "20_00000",
        "service": "Events_1",
        "service_call": {
            "method": {
                "method": "GetRide",
                "parameters": {
                    "destination": "The Fillmore Philadelphia",
                    "number_of_riders": "1",
                    "shared_ride": "True"
                }
            }
        },
        "user_utterance": [
            "I'm looking for something interesting to do.",
            "I'm looking for a music event in Philly.",
            "What is the address of the venue?",
            "What type of event is it?",
            "Okay, are there any other events?",
            "Yes, that sounds great. I'd like to purchase tickets.",
            "I only need 1 ticket.",
            "Yes, that is correct.",
            "Thanks, I also need a cab to get there.",
            "Yes, a shared ride is fine.",
            "Yes, that is right. How long is the ride?",
            "Thank you, that is all I need."
        ],
        "system_utterance": [
            "What location do you want to search in? What type of events do you prefer?",
            "How about Blueface at The Fillmore Philadelphia on March 13th at 6 pm?",
            "The venue's address is 29 East Allen Street.",
            "It is a hip hop event.",
            "What about Conan Gray at The Fillmore Philadelphia on March 1st at 8:30 pm?",
            "How many tickets do you want?",
            "Okay, please confirm the details. You want to purchase 1 ticket for Conan Gray on March 1st in Philadelphia.",
            "I have purchased the ticket, enjoy!",
            "Do you want a shared ride?",
            "Please confirm the details. You want a shared cab ride for 1 person going to The Fillmore Philadelphia.",
            "I have booked the cab and it is on the way. The ride should last around 24 minutes.",
            "Have a great day."
        ]
    },
    {
        "dialogue_id": "20_00001",
        "service": "Events_1",
        "service_call": {
            "method": {
                "method": "GetRide",
                "parameters": {
                    "destination": "Warsaw",
                    "number_of_riders": "4",
                    "shared_ride": "True"
                }
            }
        },
        "user_utterance": [
            "I want something fun to do.",
            "I prefer a concert in New York.",
            "That sounds good.",
            "Yes, I want 4 please.",
            "Perfect, what is the address?",
            "I need a shared ride cab, too.",
            "Yes, how much is it?",
            "Great, thank you.",
            "No, thanks a lot."
        ],
        "system_utterance": [
            "Any city or option like music or a sports event?",
            "OK, Amber Run Brooklyn is at Warsaw on March 14th at 6 pm.",
            "Would you like tickets?",
            "Ok, confirming 4 tickets for Amber Run Brooklyn on March 14th in New York.",
            "The tickets are booked. The address is 261 Driggs Avenue, Brooklyn.",
            "OK, please confirm a cab to the Warsaw for a shared ride for 4 people.",
            "The total cost is $13.18 and it is on its way.",
            "Can I help with anything else?",
            "Have a good day."
        ]
    },
    {
        "dialogue_id": "20_00002",
        "service": "Events_1",
        "service_call": {
            "method": {
                "method": "GetRide",
                "parameters": {
                    "destination": "Peachtree Road United Methodist Church",
                    "number_of_riders": "1",
                    "shared_ride": "True"
                }
            }
        },
        "user_utterance": [
            "Please find me something interesting to do.",
            "Please find something around Atlanta, GA.",
            "Please search for Concert events.",
            "I like the sound of that. Please reserve me one ticket.",
            "That is correct.",
            "Thank you very much. You've been very helpful.",
            "Please find me a shared cab ride there.",
            "Sounds good. What's the price.",
            "Thank you very much. You've been very helpful. That will be all now."
        ],
        "system_utterance": [
            "Which city should I search in?",
            "Any particular type of event I should search for?",
            "The Atlanta Summer Organ Festival is a very popular event that will take place on March 5th at Peachtree Road United Methodist Church at 8:30 pm.",
            "Please confirm that you'd like 1 ticket for Atlanta Summer Organ Festival, on March 5th in Atlanta.",
            "I have successfully made your reservation. Enjoy!",
            "Will you be needing my help with anything else today?",
            "Please confirm that you'll like 1 seat in a shared-ride cab going to Peachtree Road United Methodist Church.",
            "I have successfully booked your cab and it should be here shortly. The total cost is $17.02.",
            "Enjoy yourself"
        ]
    },
    {
        "dialogue_id": "20_00003",
        "service": "Events_1",
        "service_call": {
            "method": {
                "method": "GetRide",
                "parameters": {
                    "destination": "Rogers Centre",
                    "number_of_riders": "3",
                    "shared_ride": "True"
                }
            }
        },
        "user_utterance": [
            "can you find something cool for me to do?",
            "i want to watch games somewhere in toronto, ontario.",
            "that's cool, but are there any others? i like baseball a lot. is there anything happening next wednesday?",
            "that works for me.",
            "yeah can you get 3 for me?",
            "yes that's right. where's the venue?",
            "thanks, can you get me a cab there?",
            "that's fine with me.",
            "yes. how much will it cost? how long is it gonna take to get there?",
            "thanks, that's everything."
        ],
        "system_utterance": [
            "where should i look? what kind of activities are you into?",
            "there's 10 things i found for you. one of them is the blue jays vs astros game at rogers centre on march 13th at 6:30 pm.",
            "i found 3 events for you. there's the blue jays vs orioles at the rogers centre that's on march 6th at 6:30 pm.",
            "do you want tickets?",
            "so you want 3 tickets to the blue jays vs orioles game on march 6th in toronto?",
            "they've been booked. the stadium is on 1 blue jays way.",
            "do you mind having a shared ride?",
            "okay, you want a cab for 3 people to rogers centre?",
            "the ride will be about 17 minutes and it'll come out to $14.15",
            "have a good day."
        ]
    },
    {
        "dialogue_id": "20_00004",
        "service": "Events_1",
        "service_call": {
            "method": {
                "method": "GetRide",
                "parameters": {
                    "destination": "Peachtree Road United Methodist Church",
                    "number_of_riders": "2",
                    "shared_ride": "True"
                }
            }
        },
        "user_utterance": [
            "I would like to attend a show that has classical music.",
            "In ATL on the 13th.",
            "What is the address?",
            "That would be great.",
            "Yes, I do.",
            "I need two.",
            "That would be great.",
            "Thanks. I would need a taxi to get there.",
            "That would be fine.",
            "Yes. How long would it take me to get there and how much does it cost?",
            "Thanks very much. That would be all."
        ],
        "system_utterance": [
            "In which city?",
            "There is 1 event that you might like. There is the atlanta summer organ festival at peachtree road united methodist church at 8:30 pm on March 13th.",
            "It is on 3180 peachtree road northeast.",
            "You would like to get tickets?",
            "How may tickets?",
            "You want 2 tickets to the atlanta summer organ festival in atlanta on March 13th?",
            "I have confirmed your reservation. Enjoy!",
            "Would you like a shared ride?",
            "You would like a shared ride for 2 to go to peachtree road united methodist church?",
            "The taxi is on its way. The ride is 29 minutes and the price is $24.81.",
            "Enjoy your day."
        ]
    },
    {
        "dialogue_id": "20_00005",
        "service": "Events_1",
        "service_call": {
            "method": {
                "method": "GetRide",
                "parameters": {
                    "destination": "Wrigley Field",
                    "number_of_riders": "1",
                    "shared_ride": "True"
                }
            }
        },
        "user_utterance": [
            "I'm looking for something interesting to do.",
            "Can you find me sports in Chicago?",
            "Can you find me some baseball on some other days?",
            "What's the address to the field?",
            "I need one ticket to the event.",
            "Yes. It's confirmed.",
            "Can you also get me a cab.",
            "Yes. A shared ride works.",
            "Yes. That's it. What's the cost.",
            "Thanks so much.",
            "No. That's it."
        ],
        "system_utterance": [
            "Are you interested in music, sports or something else?",
            "The Cubs vs Brewers event is taking place at Wrigley Field on March 6th at 6:30 pm.",
            "The Cubs vs Giants event is taking place at Wrigley Field on March 4th at 8:30 pm.",
            "They're located at 1060 West Addison Street.",
            "Please confirm you want me to book 1 ticket to the Cubs vs Giants event on March 4th in Chicago.",
            "Your tickets have been booked. Please enjoy your event.",
            "Is a shared ride okay?",
            "Please confirm you want to book 1 ticket on a shared ride to Wrigley Field.",
            "Your ride booking was successful. The total is $7.74 and is on its way.",
            "Is there anything else?",
            "Okay. Have a wonderful day."
        ]
    },
    {
        "dialogue_id": "20_00006",
        "service": "Events_1",
        "service_call": {
            "method": {
                "method": "GetRide",
                "parameters": {
                    "destination": "Pier 17",
                    "number_of_riders": "2",
                    "shared_ride": "True"
                }
            }
        },
        "user_utterance": [
            "I want you to find me some interesting things I can do on March 10th. I usually enjoy Music events.",
            "I am interested in events around Napa.",
            "This seems nice, but can you look for some other events? I am interested for the events around NY on 9th of March.",
            "This seems nice. Though could you suggest some other events?",
            "That seems good.",
            "Yes I want to have tickets bought for this event.",
            "I want to buy three tickets.",
            "Yes, that suits me well.",
            "Can you tell me the address of the venue of the event?",
            "I appreciate your help a lot. I also need to have a cab to go there..",
            "I do not mind having a shared ride.",
            "That is not right, because I need the cab for two people.",
            "Yes that is correct. Can you tell me how long will the ride be, and how much it will cost me?",
            "I am thankful for the help you provided to me. That would be all for now."
        ],
        "system_utterance": [
            "Is there some specific city you want me to look for the events?",
            "There are 2 events which you might enjoy. One of the events is Mandy Harvey, and this event will happen on March 10th at 6 pm at Blue Note Napa.",
            "Another event you might consider is Americo, which will happen at La Boom on March 9th, and will start at 6 pm.",
            "Another popular event is called Ben Harper, and it will happen on March 9th at 6 pm at Pier 17.",
            "Would you like to buy tickets for this event?",
            "Can you tell me how many tickets you want to buy?",
            "Can you please confirm that you want to buy 3 tickets for the event called Ben Harper which will happen on March 9th in New York?",
            "Your requested tickets have been booked. Enjoy your time at the event!",
            "The address of the venue is 89 South Street.",
            "Are you willing to have a shared ride?",
            "Can you please confirm that you want to have a shared ride cab for 3 people to go to Pier 17?",
            "Can you once again please confirm that you want a cab for 2 people to go to Pier 17?",
            "Your requested cab has been booked, and is already on the way. This ride will be lasting about 8 minutes, and it will cost you $25.12.",
            "Have a good time!"
        ]
    },
    {
        "dialogue_id": "20_00007",
        "service": "Events_1",
        "service_call": {
            "method": {
                "method": "GetRide",
                "parameters": {
                    "destination": "Blue Note Napa",
                    "number_of_riders": "3",
                    "shared_ride": "True"
                }
            }
        },
        "user_utterance": [
            "I'm looking for some fun things to do.",
            "Find me something in Napa please.",
            "I prefer a concert.",
            "Sounds awesome. Please book tickets.",
            "I need three tickets please.",
            "Yes. That's correct. What's the address?",
            "I also need a taxi to take me there. Thanks.",
            "Yes. That works.",
            "Yes. Thanks. What's the price and how long is the trip?",
            "Thanks for everything.",
            "No. That's all thanks."
        ],
        "system_utterance": [
            "I which city?",
            "Would you prefer music, sports or something else?",
            "Acoustic Alchemy is a popular event taking place at the Blue Note Napa on March 11th at 6 pm.",
            "How many tickets do you need?",
            "Please confirm you want me to book 3 tickets to the Acoustic Alchemy event on March 11th in Napa.",
            "They're located at 1030 Main Street. Your reservation was successfully booked.",
            "Can it be a shared ride?",
            "Please confirm you want to book a shared cab for 3 people going to Blue Note Napa.",
            "The ride total is $21.89 and will last approximately 24 minutes. Your ride has been confirmed.",
            "Is there anything else?",
            "Okay. Have a great evening."
        ]
    },
    {
        "dialogue_id": "20_00008",
        "service": "Events_1",
        "service_call": {
            "method": {
                "method": "GetRide",
                "parameters": {
                    "destination": "Dodger Stadium",
                    "number_of_riders": "2",
                    "shared_ride": "True"
                }
            }
        },
        "user_utterance": [
            "Get me a baseball game or something else friday next week ok?",
            "Baseball is an amercan sports games.",
            "I'm curious about LA?",
            "Fine, what street are they on?",
            "Fine, tickets please.",
            "Just get me three.",
            "Totally rad, thanks.",
            "Fine, organize a cab there. I have two people. Shared ride is great.",
            "Fine, How long will it take and how much is it going to run me?",
            "Fine, you're excellent thanks."
        ],
        "system_utterance": [
            "Sure, what category shall I search in?",
            "Which city please?",
            "3 things line up for you there. You can check out the Dodgers Vs Cubs on March 8th, opening pitch is at 7:30 pm at Dodger Stadium.",
            "It's located at 1000 Vin Scully Ave.",
            "How many will you need?",
            "Fine, 3 for Dodgers Vs Cubs on March 8th in Los Angeles?",
            "Your seats are set.",
            "Fine, 2 going to Dodger Stadium.",
            "Cab is coming, and it's cost will be $16.87 It's only going to take 20 minutes.",
            "Have a good day."
        ]
    },
    {
        "dialogue_id": "20_00009",
        "service": "Events_1",
        "service_call": {
            "method": {
                "method": "GetRide",
                "parameters": {
                    "destination": "Wrigley Field",
                    "number_of_riders": "4",
                    "shared_ride": "True"
                }
            }
        },
        "user_utterance": [
            "Could you find me some interesting things to do? I'd like to find a sports game, preferably baseball in chicago.",
            "SOunds great.",
            "I'd like 4.",
            "Yes, what's the address of the venue?",
            "Thanks a lot for your help",
            "I'd like a cab to get there.",
            "I am okay with a shared ride.",
            "Yes, how long is the ride? How much does it cost?",
            "Thanks for your help, that's all I need"
        ],
        "system_utterance": [
            "I found 10 options. How about the cubs vs brewers at wrigley field on march 6th at 6:30 pm.",
            "Would you like tickets?",
            "Please confirm: You want to watch the cubs vs brewers on march 6th in chicago for 4.",
            "Your reservation is confirmed. It's at 1060 west addison street.",
            ".Do you need anything else?",
            "Do you want a shared ride.",
            "please confirm: YOu want a ride to wrigley field for 4.",
            "It's on its way. It costs $19.86 and lasts 18 minutes.",
            "Have a great day."
        ]
    },
    {
        "dialogue_id": "20_00010",
        "service": "Events_1",
        "service_call": {
            "method": {
                "method": "GetRide",
                "parameters": {
                    "destination": "Blue Note Napa",
                    "number_of_riders": "1",
                    "shared_ride": "True"
                }
            }
        },
        "user_utterance": [
            "I want to do something! I like the Blues and want to do something on the 12th of this month.",
            "I like music. Check around Napa.",
            "What's the address?",
            "Sounds great!",
            "Yes, just one please.",
            "Yes, that works.",
            "Thanks, I want a cab too.",
            "Yes, I am.",
            "Yes, that is correct. How much does it cost? How long is the ride?",
            "Thanks for the help. That's all I want."
        ],
        "system_utterance": [
            "Do you have a preference for the event. What city should I look in?",
            "Jon B is popular. He will be singing at Blue Note Napa on March 12th at 6 pm.",
            "1030 Main Street.",
            "Do you want tickets?",
            "Please confirm the following: Booking 1 ticket for Jon B in Napa on March 12th.",
            "Your reservation has been confirmed!",
            "Are you okay sharing a ride?",
            "Please confirm the following: Booking a shared ride for 1 to Blue Note Napa.",
            "Your ride was successfully booked! It costs $7.38. And the ride is about 24 minutes.",
            "Have a wonderful day!"
        ]
    },
    {
        "dialogue_id": "20_00011",
        "service": "Events_1",
        "service_call": {
            "method": {
                "method": "GetRide",
                "parameters": {
                    "destination": "2500 Durant Ave",
                    "number_of_riders": "1",
                    "shared_ride": "True"
                }
            }
        },
        "user_utterance": [
            "I need help to find something interesting to do.",
            "I would be looking for the Berkeley area.",
            "I like to have music events.",
            "Tell me a bit more about the event.",
            "That is good. I'd like to reserve ticket events.",
            "I would like one ticket.",
            "Yes, that is good for me.",
            "What is the venue address?",
            "Thanks for the help. I'd like to get a cab there.",
            "I would like a shared ride.",
            "Yes, that is good.",
            "Thanks for the help. That is all."
        ],
        "system_utterance": [
            "Is there a city I should search?",
            "Is there a category preference?",
            "I have 7 events like Berkeley World Music Festival at 2500 Durant Ave March 11th at 6:30 pm.",
            "The event is International.",
            "What number of tickets do you want?",
            "Please confirm booking tickets for Berkeley World Music Festival 1 ticket March 11th in Berkeley.",
            "The reservation is made. Have a nice time there.",
            "The address is 2500 Durant Avenue.",
            "Would you like a shared ride?",
            "Please confirm a shared cab ride for 1 to 2500 Durant Ave.",
            "The cab ride is booked and on its way.",
            "Have a nice day."
        ]
    },
    {
        "dialogue_id": "20_00012",
        "service": "Events_1",
        "service_call": {
            "method": {
                "method": "GetRide",
                "parameters": {
                    "destination": "Warsaw",
                    "number_of_riders": "2",
                    "shared_ride": "True"
                }
            }
        },
        "user_utterance": [
            "Would you find me some cool things to do?",
            "I want to find something in NYC.",
            "I like music events.",
            "Sounds good to me.",
            "Yes, I want 2 tickets.",
            "Sounds good to me. Could you tell me the address?",
            "Thank you for helping. I want a cab to get there.",
            "A shared ride is good.",
            "That works. What is the cost and how long is the ride?",
            "Thanks for helping. That is all I needed for now."
        ],
        "system_utterance": [
            "What city should I look in?",
            "Is there a preference in the event category?",
            "Amber Run Brooklyn is popular. This event takes place in Warsaw and starts on March 14th at 6 pm.",
            "Would you like event tickets?",
            "Could you confirm that you want to book Amber Run Brooklyn tickets for 2 peopleon March 14th in New York?",
            "Your reservation was confirmed. The address is 261 Driggs Avenue, Brooklyn.",
            "Would you like a shared ride?",
            "Would you confirm that you want to go to Warsaw for 2 people and that you need a shared ride?",
            "Your ride has been booked and the cab is coming. It will cost $11.38 and will take about 24 minutes.",
            "Have a good one."
        ]
    },
    {
        "dialogue_id": "20_00013",
        "service": "Events_1",
        "service_call": {
            "method": {
                "method": "GetRide",
                "parameters": {
                    "destination": "Theater Of The Clouds",
                    "number_of_riders": "2",
                    "shared_ride": "True"
                }
            }
        },
        "user_utterance": [
            "Could you assist me in looking for exciting things to do?",
            "I enjoy pop, and I'm searching for something near Portland.",
            "I enjoy music activities.",
            "Where is the location for the activity?",
            "That is perfect for me.",
            "I'd like to book tickets to the activity.",
            "I'd like to get two tickets.",
            "Yeah, that's fine by me.",
            "Thank you for your assistance.",
            "I'd like to hail a taxi to visit there. I'm fine with sharing rides.",
            "Yeah, that's fine by me.",
            "How long will the ride last?",
            "Thank you for your assistance. That's all."
        ],
        "system_utterance": [
            "Is there a specific metropolis I ought to look in?",
            "Is there a specific type you enjoy? You can suggest music, sports, or something else.",
            "Bryan Adams is well liked. The activity begins at 8:30 pm, March 2nd, at the Theater of the Clouds.",
            "The location is 1016-1098 North Center Court Street?",
            "Could I assist you with something else?",
            "How many tickets do you wish to purchase?",
            "Please verify the following information: reserve 2 tickets for a Bryan Adams activity occuring at Portland on March 2nd.",
            "Your booking is complete. Have fun there!",
            "Could I assist you with something else?",
            "Please verify the following information: you'd like a shared ride for 2 to travel to Theater Of The Clouds.",
            "Your taxi is reserved and is coming.",
            "The ride is 14 minutes long.",
            "Have a pleasant afternoon!"
        ]
    },
    {
        "dialogue_id": "20_00014",
        "service": "Events_1",
        "service_call": {
            "method": {
                "method": "GetRide",
                "parameters": {
                    "destination": "Dodger Stadium",
                    "number_of_riders": "3",
                    "shared_ride": "True"
                }
            }
        },
        "user_utterance": [
            "I'm looking for interesting things to do.",
            "I'm interested in Sports events that are around LAX.",
            "What's the stadium's address?",
            "That would be fun. Please get me tickets.",
            "I'll need three please.",
            "Yes, that's good.",
            "Thanks for getting the tickets. I'll need a cab to get there.",
            "A shared ride is fine.",
            "Yes, that's good. What's the cost, and how long is the trip?",
            "Thanks for helping me out. I don't need anything else."
        ],
        "system_utterance": [
            "Is there anything specific you enjoy, such as Music, Sports, or anything else? And where do you want to search?",
            "People enjoy the Dodgers Vs Cubs. There's a game at Dodger Stadium on March 12th at 8:30 pm.",
            "The stadium is at 1000 Vin Scully Ave.",
            "How many tickets do you need?",
            "I'll get you 3 tickets to Dodgers Vs Cubs in Los Angeles for March 12th, is that good for you?",
            "I've bought the tickets, have a fun time at the game!",
            "Would you like a shared ride?",
            "I'll get you a shared ride cab for 3 people to Dodger Stadium, is that good for you?",
            "The cab has been booked and on the way to you. The cost is $24.99 and the trip will be 20 minutes long.",
            "Have a wonderful day!"
        ]
    },
    {
        "dialogue_id": "20_00015",
        "service": "Events_1",
        "service_call": {
            "method": {
                "method": "GetRide",
                "parameters": {
                    "destination": "Flamingo Lot",
                    "number_of_riders": "1",
                    "shared_ride": "True"
                }
            }
        },
        "user_utterance": [
            "I'm looking for something interesting to do, please find an activity for me on the 5th of this month.",
            "I'd like to search for an activity around Seattle, WA.",
            "I'd like to do something Music related.",
            "That seems fun, please book one ticket for me to that event.",
            "Yes, that is correct. Please tell me the venue's address.",
            "Okay, please find me a ride to the event. A shared ride is fine.",
            "Yes that is correct. How long will it take to get there.",
            "What's the cost of the ride?",
            "Thanks, I don't need anything else."
        ],
        "system_utterance": [
            "Okay, what area would you like to do something in?",
            "What kind to activity or event would you like to go to?",
            "I've found 1 result that matches your criteria. It is a Cody Johnson show at the Flamingo Lot. The show starts at 6:30 pm and is on March 5th. How does that sound?",
            "Please verify the following details are correct. You would like to reserve 1 ticket for Cody Johnson on March 5th in Seattle. Is this correct?",
            "Your ticket has been successfully booked. The venue is located at 5500 Phinney Avenue North.",
            "Please verify the following details are correct. You would like a shared ride for 1 to the Flamingo Lot. Is this correct?",
            "Your ride is currently enroute. It will take approximately 30 minutes to get there.",
            "The ride costs $6.88.",
            "Enjoy the rest of your day."
        ]
    },
    {
        "dialogue_id": "20_00016",
        "service": "Travel_1",
        "service_call": {
            "method": {
                "method": "SearchRoundtripFlights",
                "parameters": {
                    "departure_date": "2019-03-02",
                    "destination_city": "London",
                    "number_checked_bags": "0",
                    "origin_city": "Atlanta",
                    "passengers": "3",
                    "return_date": "2019-03-11"
                }
            }
        },
        "user_utterance": [
            "Help get me some attractions please.",
            "Find something in London, england.",
            "Fine, get a hotel for me.",
            "Fine, what about round trip tickets there from Atlanta? I need 3.",
            "I'll return March 11th.",
            "Tomorrow, I think.",
            "What else. I have zero bags.",
            "Fine, that's enough."
        ],
        "system_utterance": [
            "Sure where should they be?",
            "What about 30 St Mary Axe (The Gherkin). It is listed as a Historical Landmark.",
            "There are 10 options, a 5 star option is 45 Park Lane",
            "Which day will you fly back home?",
            "What date do you want to leave?",
            "Well, there is an American Airlines at 6:30 pm and it will board the return at 10:25 am. It will cost $447.",
            "What about United Airlines flight? It leaves at 6:05 am and will take of on return at 9:30 am. It's $675.",
            "Safe travels to you."
        ]
    },
    {
        "dialogue_id": "20_00017",
        "service": "Travel_1",
        "service_call": {
            "method": {
                "method": "SearchRoundtripFlights",
                "parameters": {
                    "departure_date": "2019-03-02",
                    "destination_city": "Los Angeles",
                    "origin_city": "New York",
                    "passengers": "3",
                    "return_date": "2019-03-11"
                }
            }
        },
        "user_utterance": [
            "Is there someplace you can recommend that I can visit, like an attraction of sorts?",
            "LA, find me attractions in Los Angeles.",
            "Sounds great, can you find me one room at a one star hotel near there, it has to have wifi?",
            "Can you give me their address and phone number?",
            "Okay, thanks for that, I will also need a round trip flight to get there.",
            "I will leave from New York, I am going to need three seats, and I plan on leaving on March 11th.",
            "March 2nd is when I will depart.",
            "Sounds great, thanks for finding me this flight.",
            "Yes, that is all, thanks again for your help."
        ],
        "system_utterance": [
            "In which city should I look for attractions?",
            "I found 10 attractions you may be interested, how about a historical landmark, the Angels Flight Railway?",
            "I found one 1 star hotel you may be interested in, the AC Hotel By Marriott Beverly Hills.",
            "The hotel is located at 6399 Wilshire Boulevard, and you can contact them by calling +1 323-852-7000.",
            "From which city will you depart from to Los Angeles?",
            "How about your initial departure, when will you depart to LA?",
            "There is 4 flights available for your trip, how about an American Airlines flight with a $465 ticket price that takes off at 6:50 pm local time, and its return flight takes off at 2:55 pm?",
            "Will that be all for today?",
            "No problem, have a good day."
        ]
    },
    {
        "dialogue_id": "20_00018",
        "service": "Travel_1",
        "service_call": {
            "method": {
                "method": "SearchRoundtripFlights",
                "parameters": {
                    "departure_date": "2019-03-06",
                    "destination_city": "New York",
                    "origin_city": "Philadelphia",
                    "return_date": "2019-03-10"
                }
            }
        },
        "user_utterance": [
            "Hi! I'm interested in visiting a child-friendly Museum in New York City. Do you have any suggestions?",
            "Can you tell me if there is an entrance fee?",
            "What is the contact number?",
            "Can you help me find 3 rooms at a nearby four star hotel?",
            "Can you tell me what the room rate is and if they offer wifi?",
            "That sounds perfect.",
            "I'm not ready to book yet.",
            "Yes, I'd like to find a round trip flight there.",
            "I will depart on March 6th and return on March 10th.",
            "I will be coming from Philadelphia.",
            "Is there room for 2 passengers? When does it touch down in New York?",
            "Great. Thank you."
        ],
        "system_utterance": [
            "I have 10 places that meet your criteria. May I suggest the American Folk Art Museum if you would like to visit a Museum?",
            "Yes, there is an entrance fee.",
            "You can reach them at (212) 265-1040.",
            "A popular 4 star hotel in that area is 1 Hotel Brooklyn Bridge.",
            "The hotel does have wifi and rooms run at $240 per night.",
            "Do you wish to make a reservation at this time?",
            "Is there something else I can help you with?",
            "What day will you be leaving and when will you be returning?",
            "Where are you traveling from?",
            "There are 4 flights that may work for you. If you like traveling with American Airlines, they have an 8:45 am flight for $108 per person. The return flight departs at 7:55 am.",
            "It would be for 1 passenger and it will arrive at 9:36 am.",
            "You're welcome. Have a wonderful day."
        ]
    },
    {
        "dialogue_id": "20_00019",
        "service": "Travel_1",
        "service_call": {
            "method": {
                "method": "SearchRoundtripFlights",
                "parameters": {
                    "airlines": "Southwest Airlines",
                    "departure_date": "2019-03-04",
                    "destination_city": "Philadelphia",
                    "origin_city": "New York",
                    "return_date": "2019-03-09"
                }
            }
        },
        "user_utterance": [
            "Hello. Can you find me a free child-friendly attraction in Philadelphia?",
            "What phone number?",
            "Neat. What other attractions are there?",
            "What's their phone number?",
            "Okay, good to know. I now want to book one room at a hotel in the area.",
            "I'd rather have a 4 star hotel with Wi-Fi.",
            "Sounds good to me.",
            "Not now. I have to focus on how I'll get to Philadelphia. Can you find me a Southwest Airlines round flight from New York that returns March 9th?",
            "On the 4th of this month.",
            "Great. Thanks, I need nothing else."
        ],
        "system_utterance": [
            "Sure. There's 10 attractions there, including the tourist attraction Art Museum Steps.",
            "You can call them at 215-763-8100.",
            "The park Bartram's Garden is another.",
            "You can call 215-729-5281.",
            "How about the 3 star Aka University City?",
            "Okay. I found 10 hotels for you that are 4 star. One of those is Hilton Philadelphia at Penn's Landing.",
            "Want to book a room there?",
            "On what day will you leave?",
            "Want to take the Southwest Airlines flights that leaves at 6:35 pm, returns at 3:30 pm, and costs $119 a passenger.",
            "Have a great day!"
        ]
    },
    {
        "dialogue_id": "20_00020",
        "service": "Travel_1",
        "service_call": {
            "method": {
                "method": "SearchRoundtripFlights",
                "parameters": {
                    "departure_date": "2019-03-02",
                    "destination_city": "Portland",
                    "origin_city": "New York",
                    "return_date": "2019-03-11"
                }
            }
        },
        "user_utterance": [
            "Will you find attractions?",
            "Portland.",
            "Child-friendly?",
            "Free entry?",
            "Fantastic. Will you reserve a hotel room?",
            "Great. Will you find a round trip flight going there?",
            "I plan to leave from New York and return on 11th of March.",
            "Saturday this week.",
            "Arrival time at destination?",
            "Returning flight arrives when? Arrive the next day?",
            "Cool.",
            "That's all. Thanks."
        ],
        "system_utterance": [
            "Which city?",
            "I found 10 attractions. Crystal Springs Rhododendron Garden is a Park.",
            "Yes, it's fun for the kids.",
            "Yes, it's free.",
            "Aloft Portland Airport At Cascade Station is a 3 star hotel.",
            "Departing from? Return date?",
            "Departure date?",
            "Please confirm a $603 reservation on American Airlines with a flight that departs at 9:15 am and return flight at 4:45 pm.",
            "3:28 pm arrival.",
            "It arrives at 5:31 am on the next day.",
            "Anything else?",
            "Have a wonderful day."
        ]
    },
    {
        "dialogue_id": "20_00021",
        "service": "Travel_1",
        "service_call": {
            "method": {
                "method": "SearchRoundtripFlights",
                "parameters": {
                    "departure_date": "2019-03-01",
                    "destination_city": "London",
                    "origin_city": "Seattle",
                    "return_date": "2019-03-11"
                }
            }
        },
        "user_utterance": [
            "Would you find me attractions to visit?",
            "Find London, England attractions.",
            "Okay, good. I would like to find a hotel room there. I need 1 hotel room.",
            "Sounds good.",
            "No, I do not want to make a reservation. I would like to find a round trip flight.",
            "I would like to return on 11th of this month.",
            "I want to fly out today.",
            "Find Seattle flights.",
            "Sounds good.",
            "No, that's all. Thank you so much for helping."
        ],
        "system_utterance": [
            "Where could I search for attractions?",
            "How about checking out 30 St Mary Axe (The Gherkin)? It's a historical landmark.",
            "45 Park Lane is a nice 5 star hotel.",
            "Would you like to make the reservation?",
            "What day do you want to find the return flight?",
            "What date do you want to travel?",
            "What city will you depart from?",
            "I found 3 flights that you may like. How about flying with American Airlines? This flight leaves at 10:35 am and the return leaves at 6:55 am local time. It's $772 per passenger.",
            "Would I be able to assist with anything else?",
            "Have a great day."
        ]
    },
    {
        "dialogue_id": "20_00022",
        "service": "Travel_1",
        "service_call": {
            "method": {
                "method": "SearchRoundtripFlights",
                "parameters": {
                    "departure_date": "2019-03-05",
                    "destination_city": "Sydney",
                    "number_checked_bags": "0",
                    "origin_city": "Seattle",
                    "passengers": "3",
                    "return_date": "2019-03-14"
                }
            }
        },
        "user_utterance": [
            "I need some attractions to go see.",
            "Check in Sydney, Australia.",
            "Okay, so can I find a hotel there? I just need one room, like maybe at a one star hotel.",
            "Does it have any sort of wifi?",
            "How much does it cost per night for 1 room?",
            "Okay, that sounds fine. I need a round trip flight for a party of three.",
            "We want to depart sometime around like next Tuesday. Yeah, that day.",
            "Oh, we're leaving from Seattle. And I personally have 0 bags to check in. I would prefer to return on the 14th of this month.",
            "Is there anything else?",
            "That sounds great!",
            "No, thank you for all that."
        ],
        "system_utterance": [
            "In which city would you like to search in?",
            "You should see ANZ Stadium. It is a Sports Venue that is highly favored.",
            "28 Hotel Sydney matches your description. It is a 1 star hotel.",
            "No, the hotel does not have wifi.",
            "1 room will cost $312 per night.",
            "On which date would you like to travel?",
            "Which day would you like to take your return flight? Which city would you like to depart from?",
            "There are 2 flights which match your search. Would you like to fly with Delta Airlines? The flight will take off at 8:25 PM local time. The return flight will take off at 3:55 PM local time. The ticket price is $627.",
            "Would you like to fly with United Airlines? The flight will take off at 10:45 AM local time. The return flight will take off at around 11:55 PM local time. The ticket price is $673 per passenger.",
            "Is there anything else I may help you with.",
            "Of course. Have a wonderful day."
        ]
    },
    {
        "dialogue_id": "20_00023",
        "service": "Travel_1",
        "service_call": {
            "method": {
                "method": "SearchRoundtripFlights",
                "parameters": {
                    "departure_date": "2019-03-01",
                    "destination_city": "Paris",
                    "number_checked_bags": "0",
                    "origin_city": "Chicago",
                    "return_date": "2019-03-07"
                }
            }
        },
        "user_utterance": [
            "I'm looking for something to do, please search for attractions in the area.",
            "Please search for attractions in Paris.",
            "Does this place have free admission? What is the contact information for this attraction?",
            "Thank you. I'd like to book a hotel room in that area. I would like to book 2 rooms at a 1 star hotel.",
            "That works for me. Please find some round trip flights to travel there.",
            "I'd like to leave today from Chicago. I have 0 checked bags.",
            "I would like to fly back on the 7th of March.",
            "That works for me, thank you. That's all."
        ],
        "system_utterance": [
            "In which area should I search for attractions?",
            "Okay. I've found an attraction called the American Church in Paris. This attraction is a Place of Worship. How does this sound?",
            "There is free admission to the attraction, and their phone number is 1 40 62 05 00.",
            "Okay, there are 10 results matching your criteria. I've found one result called the Ac Hotel By Marriott Paris Porte Maillot that is a 1 star hotel. How does this sound?",
            "Okay, when will you be flying?",
            "When would you like to return?",
            "Okay, there are 2 results that match your criteria. One is an American Airlines flight that departs at 9:50 am and returns at 12:20 pm. The cost of one ticket is $665. How does this sound?",
            "Enjoy the rest of your day."
        ]
    },
    {
        "dialogue_id": "20_00024",
        "service": "Travel_1",
        "service_call": {
            "method": {
                "method": "SearchRoundtripFlights",
                "parameters": {
                    "departure_date": "2019-03-04",
                    "destination_city": "New York",
                    "number_checked_bags": "0",
                    "origin_city": "Atlanta",
                    "return_date": "2019-03-10"
                }
            }
        },
        "user_utterance": [
            "Can you show me attractions I can visit.",
            "Find something for me to do in New York City.",
            "Will the entrance be free and what is the phone number.",
            "I would like a hotel room at a one star hotel for one room.",
            "Yes, that is good.",
            "No, I don't want to reserve a room but want to search a round trip flight there too.",
            "I would like to fly out the 4th of March.",
            "I need flights from Atlanta returning the 10th of this month.",
            "Will there be anything else?",
            "What else is there. I have 0 bags for check in.",
            "Okay that works.",
            "No that is all the help I need."
        ],
        "system_utterance": [
            "Where can I search for attractions?",
            "I see 10 attractions of interest to check out 92nd Street Y a Performing Arts Venue.",
            "The phone number is (212) 415-5788. The entrance is not free.",
            "I see 10 hotels from 1 Hotel Brooklyn Bridge a nice 1 star hotel.",
            "Do you wish to reserve a hotel room?",
            "What date do you want to travel?",
            "What day and city do you want to depart from?",
            "I have 4 flights with American Airlines with a departing 11:10 am flight and a returning flight 7:55 pm flight local time at $244 per passenger.",
            "How about a flight with Delta Airlines leaving 7:55 pm and returning 1:25 pm for $269 a person.",
            "What about Southwest Airlines taking off the flight at 1:40 pm local time and returning 3:45 pm local time for $252 a passenger.",
            "Can I assist you with anything else?",
            "Have a nice day."
        ]
    },
    {
        "dialogue_id": "20_00025",
        "service": "Travel_1",
        "service_call": {
            "method": {
                "method": "SearchRoundtripFlights",
                "parameters": {
                    "departure_date": "2019-03-03",
                    "destination_city": "London",
                    "origin_city": "San Francisco",
                    "return_date": "2019-03-13"
                }
            }
        },
        "user_utterance": [
            "Can you get me fun attractions?",
            "In London, UK.",
            "Fine, get me a room near there.",
            "Something else please.",
            "How much and what's their number?",
            "Fine, I need to take a plane there.",
            "I am leaving san Francisco on March 3rd and will go back on the 13th.",
            "Fine, got it."
        ],
        "system_utterance": [
            "What city please?",
            "There are 10. You should see 30 St Mary Axe (The gherkin). Its one of their best Historical Landmark.",
            "10 options await. What about 45 park lane. I has 5 stars.",
            "a 3 star option is Abc Hyde Park Hotel.",
            "$186 per night and the phone is +44 20 7706 4660.",
            "What date do you want to go? When will you return from and where?",
            "How about American Airlines? They leave at 5 am and then the return is at 2 am. Cost is $772 each.",
            "Have a good trip."
        ]
    },
    {
        "dialogue_id": "20_00026",
        "service": "Travel_1",
        "service_call": {
            "method": {
                "method": "SearchRoundtripFlights",
                "parameters": {
                    "airlines": "Delta Airlines",
                    "departure_date": "2019-03-05",
                    "destination_city": "New York",
                    "number_checked_bags": "0",
                    "origin_city": "Vancouver",
                    "passengers": "3",
                    "return_date": "2019-03-14"
                }
            }
        },
        "user_utterance": [
            "I would like to see the sites on my trip. Can you give me some recommendations?",
            "I am interested in searching for places to see and visit in NYC",
            "Excellent. I also need to book a hotel room for one for my trip there",
            "Can you tell me the exact location for this hotel?",
            "Great, that works for me. I also need to find a round trip flight to go there with zero bags to check",
            "I would like to depart from Vancouver and I am looking to return on March 14th",
            "I would like to leave on the 5th of this month",
            "Were there other options? I would like 3 seats and I prefer to fly with Delta Airlines",
            "And at what time does the return flight land?",
            "Can you tell me if this is an Economy ticket, and whether the flight has one stop?",
            "Great, sounds good",
            "No, that's it for me, thanks!"
        ],
        "system_utterance": [
            "In what location would you like me to find sites to see?",
            "There are 10 sites that you may like. There is a Performing Arts Venue called 92nd Street Y that you might want to see.",
            "There are 10 hotels that match your preferences. One is a lovely 4 star hotel called 1 Hotel Brooklyn Bridge",
            "They are located at 60 Furman Street, Brooklyn",
            "What date would you like to depart and from what city?",
            "And what is your departure date?",
            "There is an American Airlines flight that leaves at 1:30 am local time and the return flight departs at 9:15 am local time. The price for this ticket is $637 per ticket",
            "There is 1 flight with Delta Airlines that leaves at 10:15 am local time, and the return flight is at 9:50 am local time. That flight price is $681 per ticket",
            "The return flight lands at 3:47 pm",
            "The ticket is an Economy class ticket and there is 1 stop on this flight",
            "Will there be anything additional?",
            "Enjoy your day!"
        ]
    },
    {
        "dialogue_id": "20_00027",
        "service": "Travel_1",
        "service_call": {
            "method": {
                "method": "SearchRoundtripFlights",
                "parameters": {
                    "departure_date": "2019-03-03",
                    "destination_city": "Los Angeles",
                    "origin_city": "Seattle",
                    "return_date": "2019-03-06"
                }
            }
        },
        "user_utterance": [
            "I want dome child friendly attractions in Los angeles",
            "Tell me their contact number.",
            "Cool, I also need to find a room there",
            "Sounds perfect to me",
            "No, find me a round trip fight there instead",
            "I leave day after tomorrow",
            "I need to return next wednesday",
            "Leaving from Seattle",
            "Sounds perfect to me",
            "No, thanks. that would be all"
        ],
        "system_utterance": [
            "If you like museum, there is autry museum of the american west which is a great place",
            "It is 323-667-2000",
            "I found 10 hotels for you. How about the 2 star ac hotel by marriott beverly hills?",
            "Should I book a room here?",
            "What date are you traveling on?",
            "What about the date of the return flight?",
            "City of departure?",
            "How about the alaska airlines flight at 11:10 am that costs $244? The return flight leaves at 1:45 pm",
            "Is there anything else I can help with?",
            "Have a wonderful trip"
        ]
    },
    {
        "dialogue_id": "20_00028",
        "service": "Travel_1",
        "service_call": {
            "method": {
                "method": "SearchRoundtripFlights",
                "parameters": {
                    "departure_date": "2019-03-01",
                    "destination_city": "New York",
                    "flight_class": "Economy",
                    "origin_city": "Seattle",
                    "passengers": "2",
                    "return_date": "2019-03-06"
                }
            }
        },
        "user_utterance": [
            "can you show me some cool places to visit?",
            "anywhere in new york works.",
            "is it free? what's their number?",
            "okay that's cool.",
            "can you fine me one hotel room there?",
            "what's the address? do they have wifi there?",
            "are there any others? maybe a 2 star hotel?",
            "that works for me.",
            "no not now.",
            "i need a round trip flight there.",
            "i want to leave today.",
            "i'm leaving from seattle, and i want to get back on the 6th of this month.",
            "any others? i need 2 economy seats.",
            "thanks, that's everything."
        ],
        "system_utterance": [
            "where should i look",
            "there's 10 places i found for you. how about a performing arts venue over on 92nd street y?",
            "their number is (212) 415-5788, but it's not free.",
            "is there anything else?",
            "i found 10 hotels for you. there's a 4 star hotel called the 1 hotel brooklyn bridge.",
            "they offer wifi there. it's over on 60 furman street, brooklyn.",
            "there's a 2 star hotel there called 1 hotel central park.",
            "do you want to book a room?",
            "is there anything else?",
            "what day do you want to leave?",
            "when are you returning? where are you departing from?",
            "there's a southwest airlines flight that leaves at 3:05 pm and returns at 6:25 am. it costs $629.",
            "there's a united airlines flight that costs $536 and it leaves at 10:35 am and the return flight leaves at 7:40 pm.",
            "have a great day."
        ]
    },
    {
        "dialogue_id": "20_00029",
        "service": "Travel_1",
        "service_call": {
            "method": {
                "method": "SearchRoundtripFlights",
                "parameters": {
                    "departure_date": "2019-03-01",
                    "destination_city": "Chicago",
                    "origin_city": "Washington",
                    "return_date": "2019-03-10"
                }
            }
        },
        "user_utterance": [
            "show me attractions",
            "in chi-town",
            "okay then good",
            "I want a room",
            "tell me phpne",
            "does it have wifi?",
            "any other hotels?",
            "yes that works",
            "washington today on the 10th",
            "premium economy seating",
            "all good to go",
            "No thank you"
        ],
        "system_utterance": [
            "where to look?",
            "10 there 360 chicago tourist attraction",
            "anything else for you?",
            "ac hotel by marriott chicago downtown 10 hotels 3 stars",
            "+1 312-981-6600",
            "it does have wifi",
            "ace hotel chicago 4 star",
            "what day then?",
            "american airlines 6:40 pm 9:40 am $314 a passenger",
            "economy seat then",
            "can I assist with any other matter?",
            "Have a good one"
        ]
    },
    {
        "dialogue_id": "20_00030",
        "service": "Travel_1",
        "service_call": {
            "method": {
                "method": "SearchRoundtripFlights",
                "parameters": {
                    "airlines": "Delta Airlines",
                    "departure_date": "2019-03-01",
                    "destination_city": "Paris",
                    "origin_city": "Washington",
                    "return_date": "2019-03-04"
                }
            }
        },
        "user_utterance": [
            "Can you find me some attractions to visit?",
            "Search in Paris.",
            "Great! Can you find me a hotel room nearby? I'd like 1 room in a four star hotel.",
            "Sounds good. Can you also find me a round trip flight, preferably with Delta Airlines?",
            "I need a flight out of Washington for the 1st of this month. I want to return on the 4th.",
            "How many checked bags can I have?",
            "What is the departure airport?",
            "All right. Thank you for now."
        ],
        "system_utterance": [
            "Where should I search?",
            "I have found you 10 attractions. You might like to visit the American Church in Paris. It is a Place of Worship.",
            "I have found 10 hotels that you might like. How about the Ac Hotel By Marriott Paris Porte Maillot? It is a nice 4 star hotel.",
            "What will be your departure date, city and return date?",
            "How about a 5:55 pm flight on Delta Airlines? The return flight departs at 9:15 am local time and costs $608 per passenger.",
            "You are allowed 0 checked bags.",
            "The flight departs from Dulles International Airport.",
            "You're welcome. Have a nice day."
        ]
    },
    {
        "dialogue_id": "20_00031",
        "service": "Travel_1",
        "service_call": {
            "method": {
                "method": "SearchRoundtripFlights",
                "parameters": {
                    "departure_date": "2019-03-02",
                    "destination_city": "Kuala Lumpur",
                    "origin_city": "Seattle",
                    "return_date": "2019-03-06"
                }
            }
        },
        "user_utterance": [
            "Would you find me some attractions I could go to?",
            "I'd like attractions in Phoenix, AZ.",
            "What is the phone number and is the entrance free?",
            "Could you think of something else? I'm interested in a religious spot.",
            "Nice, but do you have anything else?",
            "Please try searching again. Look for Kuala Lumpur attractions. I need something child friendly.",
            "Sounds good. I want a hotel room there. I need 1 room.",
            "Do you have something else? I'm interested in a 1 star.",
            "Okay, sounds awesome.",
            "No, not at the momet.",
            "I want to look for round trip flights going there as well.",
            "Look for Seattle flights returning next Wednesday.",
            "I would like to leave on Saturday this week.",
            "Cool.",
            "No, thanks though."
        ],
        "system_utterance": [
            "Where should I look for attractions?",
            "There are 10 attractions that should be of interest. What about Arizona Capitol Museum? It's a museum.",
            "The phone number is 602-926-3620. No, it is not free.",
            "Check out Dream City Church * Phoenix. It's a Place of Worship.",
            "Sorry, I can't find anything that fits tht criteria. Could I help with something else?",
            "Check out Jamek Mosque. It's a Place of Worship.",
            "Alila Bangsar is a nice 5 star.",
            "Aloft Kuala Lumpur Sentral is a nice 1 star.",
            "Would you like to make a reservation?",
            "Could I help with something else?",
            "What city do you want to go from and wht day do you want the return flight?",
            "What date will you be traveling?",
            "I have 1 flight for you. What about Delta Airlines? This flight takes off at 8 am local time and the return flight takes off 5:15 pm local time. This ticket is $699 per person.",
            "Could I help with another thing?",
            "Have a great day."
        ]
    },
    {
        "dialogue_id": "20_00032",
        "service": "Travel_1",
        "service_call": {
            "method": {
                "method": "SearchRoundtripFlights",
                "parameters": {
                    "airlines": "United Airlines",
                    "departure_date": "2019-03-02",
                    "destination_city": "New York",
                    "flight_class": "Economy",
                    "number_checked_bags": "0",
                    "origin_city": "Seattle",
                    "return_date": "2019-03-11"
                }
            }
        },
        "user_utterance": [
            "Hi, can you help me find some attractions?",
            "I'm going to be in New York.",
            "Does is cost?",
            "Ok, I guess I'll look for a hotel near there. I will need one room. It doesn't have to be fancy, a 2 star hotel will be fine, but I do need wi-fi.",
            "That will work. I'll also need a round trip flight, economy tickets will be fine.",
            "I am leaving from Seattle.",
            "I plan on returning on the 11th and would like United Airlines if they have a flight. I'll have 0 bags.",
            "I hope to fly there on the 2nd. I might be able to change that if there is nothing available.",
            "I think that will work. I don't need anything else."
        ],
        "system_utterance": [
            "Sure, where are you hoping to do something?",
            "There are 10 attractions. One good one is a performing arts venue called 92nd Street Y.",
            "Yes, there is an admission fee.",
            "There are 10 hotels that fit your needs. A really nice 2 star hotel in the area is 1 Hotel Brooklyn Bridge.",
            "Sure, which city will you be departing from?",
            "Alright, what day will you be returning?",
            "What date will you be heading to New York?",
            "I think we can find something. There is 1 flight on United Airlines taking off at 10:35 am with the return flight taking off at 7:40 pm. This ticket is reasonably priced at $564.",
            "Ok, enjoy your day!"
        ]
    },
    {
        "dialogue_id": "20_00033",
        "service": "Travel_1",
        "service_call": {
            "method": {
                "method": "SearchRoundtripFlights",
                "parameters": {
                    "departure_date": "2019-03-03",
                    "destination_city": "Portland",
                    "origin_city": "Las Vegas",
                    "return_date": "2019-03-13"
                }
            }
        },
        "user_utterance": [
            "I'm looking for attractions to see.",
            "Look in Portland.",
            "Alright that sounds interesting. I also need a hotel room there.",
            "Yes, that is workable.",
            "No, not right now, thank you.",
            "I need a round trip flight there as well.",
            "Leaving from Las Vegas.",
            "I'd like to fly out on the 3rd of March and come back the 13th of this month.",
            "When is the arrival time? And what class is the seat?",
            "Okay, thank you.",
            "No, that was all, thank you."
        ],
        "system_utterance": [
            "Where are you wanting to see attractions?",
            "I found 10 possibilities. What about a park, like Crystal Springs Rhododendron Garden?",
            "I found 10 hotels. What about a 3 star hotel called Aloft Portland Airport At Cascade Station ?",
            "Would you like to go ahead and reserve the room?",
            "Is there anything else I can assist with?",
            "Where will you be leaving from?",
            "And what do you want for you departure and returning dates?",
            "I found 3 flights. There is a $420 American Airlines flight leaving at 1:05 pm. The return flight leaves at 7:05 am.",
            "It's an economy seat, and you would land at 5:50 pm local time.",
            "Is there anything else I could help with?",
            "Enjoy!"
        ]
    },
    {
        "dialogue_id": "20_00034",
        "service": "Travel_1",
        "service_call": {
            "method": {
                "method": "SearchRoundtripFlights",
                "parameters": {
                    "departure_date": "2019-03-01",
                    "destination_city": "Los Angeles",
                    "origin_city": "Washington",
                    "return_date": "2019-03-10"
                }
            }
        },
        "user_utterance": [
            "I want you to find me some attractions which I can visit. I would like an attraction which welcomes children. I do not mind the type of the attraction.",
            "I am interested in attractions in LA.",
            "Alright, that is nice.",
            "I also want to find a room in a hotel there.",
            "Is there some other hotel which I might want to stay in?",
            "Can you find some other hotel I might like? I am interested for a 3 star hotel.",
            "Can you give me the address of this hotel?",
            "Can you check if the hotel provides wifi? Can you also tell me the phone number of the hotel?",
            "That seems nice. I need also to find a a round trip flight to go there which leaves on March 1st. I want to return on 7th of this month.",
            "I am interested in flights which leave from Washington. I will be returning from my trip on March 10th.",
            "Can you tell me the number of stops this flight has?",
            "Can you tell me when the flight will be arriving at my destination, and when the returning flight will be arriving?",
            "Okay, that is good.",
            "Nothing. I appreciate your help."
        ],
        "system_utterance": [
            "Can you tell me where you want me to search for the attractions?",
            "You might consider visiting Autry Museum of the American West, which is a Museum.",
            "Is there something else you want me to help you with?",
            "A good 2 star hotel which I can suggest is Ac Hotel By Marriott Beverly Hills.",
            "Another nice 3 stal hotel I can recommend is the Airtel Plaza Hotel.",
            "You might also consider staying at the Best Western Burbank Airport Inn, which is a good 3 star hotel.",
            "The address of the hotel is 7615 Lankershim Boulevard, North Hollywood, California 91605, United States.",
            "I can confirm that the hotel provides wifi, and if you want to call them you can at +1 818-765-2900.",
            "Can you tell me from which city do you want to leave?",
            "How would you like to have the flight with American Airlines which leaves at 4:25 pm local time, and when it returns it flies at 10:15 pm local time. The ticket for this flight costs $363 per passenger.",
            "From what I can see, this flight has 0 stops.",
            "You outbound flight will arrive at 7:10 pm local time, and when it returns it arrives at 7 am.",
            "Is there something else I can help you with?",
            "Have a good time!"
        ]
    },
    {
        "dialogue_id": "20_00035",
        "service": "Travel_1",
        "service_call": {
            "method": {
                "method": "SearchRoundtripFlights",
                "parameters": {
                    "airlines": "United Airlines",
                    "departure_date": "2019-03-01",
                    "destination_city": "Philadelphia",
                    "flight_class": "Economy",
                    "origin_city": "Atlanta",
                    "return_date": "2019-03-04"
                }
            }
        },
        "user_utterance": [
            "I'd like to visit an attraction.",
            "Look in Philly.",
            "What else do you have?",
            "Is it free to attend?",
            "What else is there?",
            "I'd like a hotel there. It should be a 2 star hotel and have Wi-Fi.",
            "Where is it? How much would it cost?",
            "What else is there? I need 1 room.",
            "What else is there? A 1 star hotel is fine.",
            "That sounds fine.",
            "I don't. I want a round trip flight there. Look for economy class tickets from United Airlines. I'm leaving March 1st.",
            "I'm going from Atlanta. I'm returning March 4th.",
            "That's fine then.",
            "No, that is all."
        ],
        "system_utterance": [
            "What city should I look in?",
            "Art Museum Steps is a tourist attraction.",
            "Barnes Foundation is a museum.",
            "No, entry is not free.",
            "Bartram's Garden is a park.",
            "I found 10 hotels for you. Aka University City is a 2 star hotel.",
            "It costs $261 per nights. The address is Cira Centre South, 2929 Walnut Street.",
            "Aloft Philadelphia Airport is a 2 star hotel.",
            "I found 8 hotels for you. Aloft Philadelphia Downtown is a 1 star hotel.",
            "Would you like a reservation?",
            "What city are you leaving from? When would you want your return flight?",
            "I've got 1 flight. A United Airlines flight takes off at 4:20 am and costs $354. The return flight leaves at 7:55 pm.",
            "Do you need anything else?",
            "Have a nice day."
        ]
    },
    {
        "dialogue_id": "20_00036",
        "service": "Travel_1",
        "service_call": {
            "method": {
                "method": "SearchRoundtripFlights",
                "parameters": {
                    "departure_date": "2019-03-02",
                    "destination_city": "Paris",
                    "flight_class": "Premium Economy",
                    "origin_city": "Washington",
                    "return_date": "2019-03-11"
                }
            }
        },
        "user_utterance": [
            "Hi, are there any nice attractions which I can visit?",
            "Something in Paris is fine.",
            "Sure, could you get me 1 room at a hotel there?",
            "Are there any alternative 1 star hotels?",
            "That is fine with me.",
            "No, that is not needed.",
            "Could you get me a round trip flight there too?",
            "Likely on the 11th.",
            "I would prefer to travel on Premium Economy seats on March 2nd.",
            "From Washington, please.",
            "What time will I arrive at my destination and does this have 1 layover?",
            "I see, that is great.",
            "No, that is all. Thanks!"
        ],
        "system_utterance": [
            "Where would you like the attractions to be located at?",
            "There are 10 attractions available, would you like to visit a Place of Worship called American Church in Paris?",
            "Sure, would you like a 4 star hotel called Ac Hotel By Marriott Paris Porte Maillot?",
            "How about a 1 star hotel called Amastan Paris?",
            "Would you need a reservation there?",
            "Sure, could I further assist you?",
            "Any when will you be returning?",
            "When will you be departing hten?",
            "Sure, where will you be departing from?",
            "Would you like an American Airlines flight departing at 4:10 am and returning at 3 am costing $1,009?",
            "You will reach at 1:12 am and there are 1 layovers for this flight.",
            "Could I further assist you?",
            "No worries, enjoy!"
        ]
    },
    {
        "dialogue_id": "20_00037",
        "service": "Travel_1",
        "service_call": {
            "method": {
                "method": "SearchRoundtripFlights",
                "parameters": {
                    "airlines": "United Airlines",
                    "departure_date": "2019-03-01",
                    "destination_city": "London",
                    "origin_city": "Seattle",
                    "return_date": "2019-03-10"
                }
            }
        },
        "user_utterance": [
            "Could you find me some attractions in london, england?",
            "Sounds good.",
            "I'd like a hotel there, one room with one star please.",
            "Yeah, that sounds good. Could you find me a flight leaving today returning on the 10th of this month on united airlines?",
            "Seattle.",
            "Thanks, that's all I need"
        ],
        "system_utterance": [
            "I found 10 options. How about a historical landmark like 30 st mary axe (The gherkin)?",
            "Anything else you need?",
            "I found 10 options. How about 45 park lane, with 1 star?",
            "What city do you want to depart from?",
            "I found this united airlines flight: it leaves at 10:45 am and returns at 9:30 am, the cost is $756 per head.",
            "Have a good day."
        ]
    },
    {
        "dialogue_id": "20_00038",
        "service": "Travel_1",
        "service_call": {
            "method": {
                "method": "SearchRoundtripFlights",
                "parameters": {
                    "departure_date": "2019-03-01",
                    "destination_city": "Seattle",
                    "origin_city": "Los Angeles",
                    "return_date": "2019-03-05"
                }
            }
        },
        "user_utterance": [
            "show me some attractions to see",
            "find them in seattle, wa",
            "okay that is 1 star",
            "yes that works",
            "Los angeles 1st of this month to 5th of this month",
            "anything else for you?",
            "will it be here day after?",
            "alright thank you"
        ],
        "system_utterance": [
            "where should I look for attractions?",
            "brandon lee and bruce lee's grave site tourist attraction",
            "ace hotel seattle 1 star",
            "which way do you want?",
            "alaska airlines 1:45 pm 11:10 am $274",
            "american airlines 5:55 pm 7:50 pm $317 per person",
            "the next day",
            "have a good one"
        ]
    },
    {
        "dialogue_id": "20_00039",
        "service": "Travel_1",
        "service_call": {
            "method": {
                "method": "SearchRoundtripFlights",
                "parameters": {
                    "departure_date": "2019-03-01",
                    "destination_city": "Paris",
                    "number_checked_bags": "0",
                    "origin_city": "Philadelphia",
                    "return_date": "2019-03-14"
                }
            }
        },
        "user_utterance": [
            "Would you show me museum attractions without an entry fee? I need something child friendly.",
            "Look for attractions in Paris, France.",
            "Could you tell me their phone number?",
            "Okay, good. I'd like to find a hotel room there. I need 1 room.",
            "What is the phone number and how much is it per night?",
            "Sounds good to me.",
            "No, I don't want to reserve right now. I need to look for a round trip flight to go there and I have 0 bags.",
            "Find flights in Philadelphia leaving on March 1st and returning on 14th of March.",
            "How many passengers was this for and when does the flight get to my destination?",
            "Thank you. That's all I need."
        ],
        "system_utterance": [
            "What city do I need to find attractions in?",
            "There are 10 attractions that should be good. Cite de l'architecture et du patrimoine is a nice museum.",
            "The phone number is 1 58 51 52 00.",
            "I have 10 hotels that could match. Ac Hotel By Marriott Paris Porte Maillot is a nice 4 star.",
            "The phone number is +33 1 84 82 49 09 and is $80 per night.",
            "Would you like to make a reservation?",
            "What date do you want to travel and return? What city would you like to leave from?",
            "I have 1 flight that should work. What about American Airlines? This flight leaves at 8:45 pm local time and the return flight leaves at 3 am local time. It costs $562 per passenger.",
            "The flight arrives at 2:22 pm for 1.",
            "Have a great day."
        ]
    },
    {
        "dialogue_id": "20_00040",
        "service": "Travel_1",
        "service_call": {
            "method": {
                "method": "SearchRoundtripFlights",
                "parameters": {
                    "departure_date": "2019-03-03",
                    "destination_city": "Paris",
                    "origin_city": "Washington",
                    "return_date": "2019-03-08"
                }
            }
        },
        "user_utterance": [
            "Can you find me some place to visit?",
            "In Paris, France.",
            "Can I take my children there?",
            "What's the phone number? Is it free to enter?",
            "Excellent. I'd like to book one room at a four star hotel in the area.",
            "What's the phone number?",
            "Okay, good to know.",
            "Yes. Find me a round trip flight there.",
            "I leave Washington on the 3rd and hope to return next Friday.",
            "Will it arrive the day after?",
            "When will the returning flight arrive?",
            "Alright, thank you.",
            "Not now. Thanks for everything!"
        ],
        "system_utterance": [
            "Sure. Where, exactly?",
            "I found 10 places of interest to you, such as the place of worship American Church in Paris.",
            "Yes, it's child friendly.",
            "You can call 1 40 62 05 00, and it's free to enter.",
            "I found 10 hotels for you. How about the 4 star AC Hotel by Marriott Paris Porte Maillot?",
            "The number is +33 1 84 82 49 09.",
            "Can I help with anything further?",
            "From what city? When are you leaving and returning?",
            "How about the American Airlines flight that leaves at 4:10 am, returns at 3 am, and a ticket for which costs $634?",
            "It arrives at the next day, yes.",
            "It'll arrive at 8:25 am.",
            "Can I help you some more?",
            "Have a wonderful day!"
        ]
    },
    {
        "dialogue_id": "20_00041",
        "service": "Travel_1",
        "service_call": {
            "method": {
                "method": "SearchRoundtripFlights",
                "parameters": {
                    "departure_date": "2019-03-04",
                    "destination_city": "New York",
                    "origin_city": "Philadelphia",
                    "return_date": "2019-03-11"
                }
            }
        },
        "user_utterance": [
            "Can you find me a child-friendly attraction in New York City without an entry fee?",
            "Okay, great! Can you find me 1 hotel room in a 2 star hotel near there?",
            "Is there anything else I may like?",
            "Is there anything else? I would like the hotel to have wifi.",
            "That sounds good.",
            "Not right now, thank you.",
            "Can you find me a round trip flight going there?",
            "I want to return on the 11th of this month.",
            "I want to leave on the 4th.",
            "I am leaving from Philadelphia.",
            "Sounds good, thanks. That's all I need."
        ],
        "system_utterance": [
            "The American Museum of Natural History is a popular Museum.",
            "1 Hotel Brooklyn Bridge has a 2 star rating. How does that sound?",
            "1 Hotel Central Park is another hotel with a 2 star rating. Does this work for you?",
            "I found 8 hotels for you. 11 Howard is rated 2 stars. How does that sound?",
            "Would you like to make a reservation?",
            "Is there anything else I can help you with?",
            "When would you like to return?",
            "Which day would you like to leave?",
            "Which city are you leaving from?",
            "I found 4 flights for you. There is a flight with American Airlines leaving at 8:45 pm and returning at 7:55 am for $113 per passenger. How does that sound?",
            "Okay, have a great day!"
        ]
    },
    {
        "dialogue_id": "20_00042",
        "service": "Travel_1",
        "service_call": {
            "method": {
                "method": "SearchRoundtripFlights",
                "parameters": {
                    "airlines": "United Airlines",
                    "departure_date": "2019-03-08",
                    "destination_city": "New York",
                    "origin_city": "Delhi",
                    "return_date": "2019-03-14"
                }
            }
        },
        "user_utterance": [
            "Find me some events to go to.",
            "Look in NY.",
            "That works. I need a 4 star hotel with wifi near there.",
            "That works for me.",
            "No, not right now.",
            "Find me a round trip flight that goes there.",
            "I will depart on March 8th and return on the 14th of March.",
            "I am departing from Delhi.",
            "Find me United Airlines flights.",
            "That works.",
            "No, thanks for everything."
        ],
        "system_utterance": [
            "What city do you want?",
            "Search revealed 10 results. 92nd Street Y is a Performing Arts Venue.",
            "Search revealed 10 results. 1 Hotel Brooklyn Bridge is a 4 star hotel near there.",
            "Shall I get you a hotel room?",
            "Do you need more help?",
            "What are your departing and return dates?",
            "What is your departure city?",
            "American Airlines has a flight that leaves at 7 am and the second flight leaves at 12:35 pm with at cost of $593 a person.",
            "United Airlines has a flight with departure times of 9:15 pm and then 9:05 am respectively with a cost at $474 a person.",
            "Do you need more help?",
            "Have a great day."
        ]
    },
    {
        "dialogue_id": "20_00043",
        "service": "Travel_1",
        "service_call": {
            "method": {
                "method": "SearchRoundtripFlights",
                "parameters": {
                    "airlines": "Delta Airlines",
                    "departure_date": "2019-03-04",
                    "destination_city": "Los Angeles",
                    "flight_class": "Economy",
                    "origin_city": "Las Vegas",
                    "passengers": "3",
                    "return_date": "2019-03-14"
                }
            }
        },
        "user_utterance": [
            "show some places",
            "look in la",
            "phone number for me",
            "okay good then",
            "how much then?",
            "any other ones? one star one room",
            "any other ones?",
            "economy three seats delta airlines",
            "4th of this month to the 14th",
            "from las vegas",
            "okay then that works",
            "no thank you"
        ],
        "system_utterance": [
            "where to look?",
            "10 places angels flight railway historical landmark",
            "213-626-1901 and no fee",
            "ac hotel by marriott beverly hills 2 star",
            "+1 323-852-7000 $156",
            "airtel plaza hotel 1 star",
            "banana bungalow - hollywood hostel 1 star",
            "what day then?",
            "what city then?",
            "delta airlines 10:10 am to 10:10 pm $215",
            "anything else for you?",
            "bye bye now"
        ]
    },
    {
        "dialogue_id": "20_00044",
        "service": "Travel_1",
        "service_call": {
            "method": {
                "method": "SearchRoundtripFlights",
                "parameters": {
                    "airlines": "American Airlines",
                    "departure_date": "2019-03-05",
                    "destination_city": "San Francisco",
                    "origin_city": "Las Vegas",
                    "return_date": "2019-03-12"
                }
            }
        },
        "user_utterance": [
            "I want you to find me some attractions I can visit.",
            "I am interested in finding attractions in San Fran.",
            "Alright, nice. Now I need to find 1 room in a 4 star hotel there, so that I can have a place to stay. The hotel I am looking for should have wifi.",
            "That is nice. Now I want to find a round trip flight with American Airlines so I can go there. I want to take the flight on the 5th.",
            "The date when I plan to return is on the 12th.",
            "I am interested for a flight which leaves from Las Vegas.",
            "Okay that is good.",
            "No. I appreciate your help very much!"
        ],
        "system_utterance": [
            "Where do you want me to look for the attractions?",
            "You might consider visiting Alcatraz, which is a Historical Landmark.",
            "A good 4 star hotel I can recommend is Argonaut Hotel.",
            "Can you tell me the day when you will be returning?",
            "Can you tell me the city from where you will leave?",
            "How would you like to fly with American Airlines, with the flight which leaves at 6:50 am local time, and when it returns it takes off at 5:25 am local time. The ticket for this flight costs $191 per passenger.",
            "Is there something else I can help you with?",
            "Have a good time!"
        ]
    },
    {
        "dialogue_id": "20_00045",
        "service": "Travel_1",
        "service_call": {
            "method": {
                "method": "SearchRoundtripFlights",
                "parameters": {
                    "departure_date": "2019-03-03",
                    "destination_city": "Paris",
                    "number_checked_bags": "0",
                    "origin_city": "Philadelphia",
                    "return_date": "2019-03-05"
                }
            }
        },
        "user_utterance": [
            "Get me some good activities please.",
            "Try Paris.",
            "Is it free there?",
            "Why don't you set me up with 1 room in a Three Star hotel?",
            "What's the nightly charge?",
            "Fine, do that.",
            "NO, first do a round trip ticket there?",
            "On the 3rd from Philadelphia.",
            "I'm returning on March 5th and have 0 check in bags.",
            "Fine, that's quite enough."
        ],
        "system_utterance": [
            "Where should I search?",
            "Try going to a place of worship. Go to American Church in Paris.",
            "Sure, it's a church.",
            "Sure, how about Ac Hotel by Marriott paris Porte Maillot? It has 3 stars.",
            "It's only $80 american.",
            "How about a reservation?",
            "What date do you want to go? Where will you leave to get there?",
            "When will you come back?",
            "There is 1 option. American Airlines 8:45 am and the return boards at 3 am. The cost will be $586 per ticket.",
            "Have safe travels."
        ]
    },
    {
        "dialogue_id": "20_00046",
        "service": "Travel_1",
        "service_call": {
            "method": {
                "method": "SearchRoundtripFlights",
                "parameters": {
                    "departure_date": "2019-03-01",
                    "destination_city": "London",
                    "origin_city": "San Francisco",
                    "return_date": "2019-03-12"
                }
            }
        },
        "user_utterance": [
            "I would like to visit a shopping district.",
            "Preferably in London, UK.",
            "Is it free?",
            "OK, I need to find two rooms in a 1 star hotel.",
            "That sounds good.",
            "Not right now. I do want a round trip flight from San Francisco to Londo.",
            "I want to fly out on the 1st of this month and return on the 12th of March.",
            "Ok, that is fine.",
            "No, that is all."
        ],
        "system_utterance": [
            "In which area?",
            "Borough Market is a shopping area.",
            "No, it is not.",
            "There are 10 options. 45 Park Lane is a 1 star hotel.",
            "Would you like a reservation?",
            "When do you want to travel?",
            "I have 1 flight on American Airlines. The flight leaves at 5 am and returns at 2 am. The ticket cost is $788.",
            "Can I help you with anything else?",
            "Have a nice day."
        ]
    },
    {
        "dialogue_id": "20_00047",
        "service": "Travel_1",
        "service_call": {
            "method": {
                "method": "SearchRoundtripFlights",
                "parameters": {
                    "airlines": "Delta Airlines",
                    "departure_date": "2019-03-01",
                    "destination_city": "New York",
                    "origin_city": "Atlanta",
                    "return_date": "2019-03-13"
                }
            }
        },
        "user_utterance": [
            "Hey, how are you doing. Can you help me find a nice Sports Venue in NY?",
            "What's the number? Is it a child-friendly establishment?",
            "Okay, great. Thanks for the help. Could you also help locate a nice hotel in the area?",
            "What's the address for the place?",
            "Any other hotels you think I'd like? I'm okay with a three star hotel.",
            "What's the address and phone number?",
            "Okay, that sounds good. Thanks.",
            "No, I'm not ready to get a room just yet.",
            "Yeah, i'd like to get a round trip flight out to NY. I'd like to leave out on the 1st and I much prefer Delta Airlines to the rest.",
            "I'm taking a trip out of Atlanta.",
            "I want to be in the sky on the 13th of this month.",
            "What class of ticket is it? Will the flight arrive by the next day?",
            "Alright, thanks for the info.",
            "Nope, that's it. Thanks for the help."
        ],
        "system_utterance": [
            "Sure thing. I suggest checking out the Sports Venue called Chelsea Piers Sports and Entertainment Complex.",
            "I would say it's a pretty nice place to take children to. The number is 212-336-6666.",
            "How about the 1 Hotel Brooklyn Bridge? It's a very nice 4 star hotel.",
            "They are located at 60 Furman Street, Brooklyn.",
            "I found 9 hotels matching your search. 1 Hotel Central Park is a very nice 3 star rated hotel.",
            "They are located at 1414 6th Avenue and the number is +1 212-703-2001.",
            "Would you like to book your reservation today?",
            "Okay, anything else I can help you with today?",
            "Okay, which city are you flying out of?",
            "What date would you like to depart?",
            "Okay, I've found 1 flight for you. There is a Delta Airlines flight departing at 7:55 pm local time. Your return flight will be leaving at 1:25 pm. Total costs round trip will be $242 per passenger.",
            "The ticket is for an Economy class seat. Your flight will arrive at its destination the same day it takes off.",
            "Anything else I can help you with today?",
            "My pleasure. Have a good day."
        ]
    },
    {
        "dialogue_id": "20_00048",
        "service": "Travel_1",
        "service_call": {
            "method": {
                "method": "SearchRoundtripFlights",
                "parameters": {
                    "departure_date": "2019-03-04",
                    "destination_city": "Phoenix",
                    "flight_class": "Economy",
                    "origin_city": "San Francisco",
                    "passengers": "4",
                    "return_date": "2019-03-09"
                }
            }
        },
        "user_utterance": [
            "I need help finding attractions to visit, around Phoenix.",
            "All right, cool. Please find me two rooms in a 1 star hotel there. The hotel must have wifi.",
            "That works for me. Could you also find round trip flights there?",
            "Please find flights departing from San Francisco.",
            "I'd like to fly out on the 4th.",
            "Look for Economy class tickets with a return date of 9th of March.",
            "You mentioned 4 flights. Please make another suggestion.",
            "No. What else can you find that has four seats available?",
            "Okay, thank you, that will be all."
        ],
        "system_utterance": [
            "Your search yielded 10 suitable attractions. How about visiting the Museum known as Arizona Capitol Museum?",
            "I found Aloft Phoenix-Airport, a nice 1 star hotel.",
            "What's your origin city?",
            "What's your preferred travel date?",
            "Please tell me your preferred return date.",
            "Among the 4 suitable flights I found is an outbound American Airlines flight leaving at 12:25 pm local time, with an inbound flight that departs at 9:30 am local time. The ticket price is $223 per passenger.",
            "Sure. The next flight is an outbound Delta Airlines flight leaving at 11:45 am local time, with an inbound flight that departs at 7:55 pm local time . The ticket price is $305 per passenger. Would that interest you?",
            "Okay, no problem. I found 2 flights that you may like. Southwest Airlines has an outbound flight leaving at 2 pm local time, with a return flight that leaves at 11:10 am local time. The ticket price is $219 per passenger. Would that work?",
            "Have a nice day."
        ]
    },
    {
        "dialogue_id": "20_00049",
        "service": "Travel_1",
        "service_call": {
            "method": {
                "method": "SearchRoundtripFlights",
                "parameters": {
                    "airlines": "Delta Airlines",
                    "departure_date": "2019-03-02",
                    "destination_city": "London",
                    "origin_city": "Chicago",
                    "return_date": "2019-03-04"
                }
            }
        },
        "user_utterance": [
            "Show me some attractions to visit in the Performing arts venue.",
            "Please look in London.",
            "Okay good.",
            "I would like to find a hotel room there.",
            "Tell me its phone number.",
            "Yes, that is good.",
            "I would like to search to fly round trip with Delta Airlines.",
            "I would like to return next Monday.",
            "Look from Chicago the 2nd of March.",
            "Okay, that is all."
        ],
        "system_utterance": [
            "Where should I look for attractions?",
            "I see 10 attractions to check out including Alexandra Palace a Performing Arts Venue.",
            "What else can I assist with?",
            "I see 10 matching hotels including 45 Park Lane a 5 star hotel.",
            "The number is +44 20 7493 4545.",
            "Can I assist you with anything else?",
            "What day are you returning on the flight?",
            "What date are you travelling and from which city?",
            "Do you wish to fly Delta Airlines taking off 11:30 am and returning 9:20 am for $611 per person.",
            "Have a great day."
        ]
    },
    {
        "dialogue_id": "20_00050",
        "service": "Travel_1",
        "service_call": {
            "method": {
                "method": "SearchRoundtripFlights",
                "parameters": {
                    "departure_date": "2019-03-02",
                    "destination_city": "London",
                    "origin_city": "New York",
                    "return_date": "2019-03-05"
                }
            }
        },
        "user_utterance": [
            "Please show me attractions to visit without an entry fee.",
            "Please look in London.",
            "What other places can you think of?",
            "Tell me the phone number.",
            "Okay, I'd like to find one hotel room there at a two star hotel.",
            "Yes, that is good.",
            "I would like to search round trip flights from New York.",
            "I would like to return the 5th of March.",
            "I would like to fly out the 2nd of March.",
            "Okay.",
            "No, thanks for everything."
        ],
        "system_utterance": [
            "Where should I be searching attractions?",
            "You can check out 30 St Mary Axe (The Gherkin), a historical landmark.",
            "Check out Alexandra Palace Ice Rink a sports venue.",
            "The phone number is 20 8365 2121.",
            "A nice 2 star hotel is 45 Park Lane.",
            "Can I assist you with anything else?",
            "What day are you returning on the flight?",
            "What date are you travelling?",
            "Do you wish to fly American Airlines taking off 7:40 pm returning at 2 am for $442 per passenger.",
            "What else can I assist with?",
            "Have a great day."
        ]
    },
    {
        "dialogue_id": "20_00051",
        "service": "Travel_1",
        "service_call": {
            "method": {
                "method": "SearchRoundtripFlights",
                "parameters": {
                    "departure_date": "2019-03-02",
                    "destination_city": "Portland",
                    "origin_city": "San Diego",
                    "return_date": "2019-03-11"
                }
            }
        },
        "user_utterance": [
            "I want you to find me some attractions in Portland which I can visit.",
            "Alright, good. Now I need to find 1 room in a two star hotel, so that I can have a place to sleep there. The hotel I am looking for should have wifi.",
            "Can you give me the address of this hotel?",
            "Can you give me their phone number?",
            "That is good. I also want to find a round trip flight so I can go there, and I want to leave with my flight tomorrow.",
            "I want to have a flight from San Diego, and the date when I plan returning is on 11th of March.",
            "That is very good.",
            "Nothing. I appreciate your help!"
        ],
        "system_utterance": [
            "There are 10 attractions which you might like. You can consider visiting Crystal Springs Rhododendron Garden, which is a Park.",
            "A good 2 star hotel I can recommend is Aloft Portland Airport At Cascade Station.",
            "The hotel can be found at 9920 Northeast Cascades Parkway.",
            "If you want to call them you can at +1 503-200-5678.",
            "Can you tell me the day when you will be returning, and from which city will you be departing?",
            "There are 5 flight which match what you want. How would you like flying with an Alaska Airlines flight which leaves at 1:15 pm local time, and when it returns it takes off at 11:35 pm local time. The ticket for this flight costs $264 per passenger.",
            "Is there something else I can help you with?",
            "Have a good time!"
        ]
    },
    {
        "dialogue_id": "20_00052",
        "service": "Travel_1",
        "service_call": {
            "method": {
                "method": "SearchRoundtripFlights",
                "parameters": {
                    "departure_date": "2019-03-02",
                    "destination_city": "London",
                    "flight_class": "Economy",
                    "number_checked_bags": "0",
                    "origin_city": "Atlanta",
                    "passengers": "3",
                    "return_date": "2019-03-10"
                }
            }
        },
        "user_utterance": [
            "I want to find some attractions to see",
            "In london, England",
            "Is the entry here free?",
            "Is it child friendly? Give me its phone numer",
            "Suggest me some more places",
            "Cool, help me find a hotel there as well",
            "Cool, I also need to find for round trip flights there from atlanta. Three seats with 0 check in bags",
            "On 2nd of march",
            "On 10th of this month, economy tickets",
            "Which is the airport it flies from?",
            "Thanks, that would be all"
        ],
        "system_utterance": [
            "WHich city are you searching in",
            "30 st mary axe (the gherkin) is a great historical landmark",
            "Yes it is",
            "Its a child friendly place. Its number is 20 7071 5029",
            "How about alexandra palace, a performing arts venue",
            "I have 10 places for you. How about the 5 star 45 park lane?",
            "What date are you planning to travel?",
            "What about the return flight?",
            "How about the american airlines flight that takes off at 6:30 pm at $571. Its return flight is at 2 am",
            "It is hartsfield-Jackson international airport",
            "Have a great trip!"
        ]
    },
    {
        "dialogue_id": "20_00053",
        "service": "Travel_1",
        "service_call": {
            "method": {
                "method": "SearchRoundtripFlights",
                "parameters": {
                    "departure_date": "2019-03-01",
                    "destination_city": "Los Angeles",
                    "origin_city": "Sydney",
                    "return_date": "2019-03-05"
                }
            }
        },
        "user_utterance": [
            "I want to look for something interesting to do. What places are there to visit?",
            "Look for something in Los Angeles.",
            "Sure, that sounds great. I also want to find a hotel to stay.",
            "What other options are there?",
            "That one sounds great. For now just get me a round trip flight. I will need it to get there.",
            "Look for flights on Sydney on March 1st.",
            "Look for a return fligh on March 5th.",
            "Thanks a lot.",
            "No, that would be all."
        ],
        "system_utterance": [
            "Where do you want to look for?",
            "There is Angels Flight Railway, it is a historical Landmark.",
            "There are 10 hotels for you. How about Ac Hotel By Marriott Beverly Hills, it has a 2 star rating.",
            "There is also Airtel Plaza Hotel, it has a 3 star rating.",
            "From where do you want to leave? When do you want to fly?",
            "When do you want to return?",
            "There are 2 flights for you. There is a flight with Delta Airlines, the departure takes off at 3:55 pm and the returning flight takes off at 4:35 pm. It has a cost of $386.",
            "Is there anything else I can help you with?",
            "Have a great day."
        ]
    },
    {
        "dialogue_id": "20_00054",
        "service": "Travel_1",
        "service_call": {
            "method": {
                "method": "SearchRoundtripFlights",
                "parameters": {
                    "departure_date": "2019-03-01",
                    "destination_city": "Paris",
                    "number_checked_bags": "0",
                    "origin_city": "Chicago",
                    "return_date": "2019-03-07"
                }
            }
        },
        "user_utterance": [
            "Can you find me some attractions I can visit? What I am looking for is a Place of Worship.",
            "I am interested in attractions in Toronto, Canada.",
            "Can you give me their phone number?",
            "Nice, is there some other attractions you can recommend that are in Paris, France.",
            "Alright, good. Now I want to find two rooms in a two star hotel there, so I will have a place to stay in.",
            "That seems nice. I also want you to find me a round trip flight which leaves from Chicago. I have 0 bags for check in in the flight. The date when I want to fly out is March 1st.",
            "I want to have my returning flight on Thursday next week.",
            "Very good. Thank you, that would be all!"
        ],
        "system_utterance": [
            "Can you tell me where I should look for the attractions?",
            "You might consider visiting BAPS Shri Swaminarayan Mandir, which is a Place of Worship.",
            "If you want to call them you can at 416-798-2277.",
            "There are 9 attractions which match your request. You might consider visiting American Church in Paris, which is a Place of Worship.",
            "There are 10 hotels which match what you are looking for. One of the hotels is the Ac Hotel By Marriott Paris Porte Maillot, which is a nice 2 star hotel.",
            "Can you tell me the day when you will be returning?",
            "There are 2 flights which match your request. How would you like to have the flight with American Airlines which leaves at 9:50 am local time, and when it returns it takes off at 12:20 pm local time? The ticket for this flight costs $665 per passenger.",
            "Have a wonderful time!"
        ]
    },
    {
        "dialogue_id": "20_00055",
        "service": "Travel_1",
        "service_call": {
            "method": {
                "method": "SearchRoundtripFlights",
                "parameters": {
                    "departure_date": "2019-03-03",
                    "destination_city": "Paris",
                    "origin_city": "Chicago",
                    "return_date": "2019-03-07"
                }
            }
        },
        "user_utterance": [
            "Can you help me find attractions to visit?",
            "I'm looking in Paris.",
            "Okay, what else do you have? I'm looking for a performance venue.",
            "Okay, great. I also need to find a room in a hotel nearby.",
            "Yes, that sounds good. I want to search for round trip flight going there as well. I want to fly out on the 3rd.",
            "I will be leaving from Chicago. I plan to return on the 7th of March.",
            "How many stops does the flight have?",
            "Okay, sounds good.",
            "No, that's all I need. Thanks."
        ],
        "system_utterance": [
            "In what city should I search for attractions?",
            "The American Church in Paris is a place of worship. Does that sound like what you're looking for?",
            "I have 10 attractions that might interest you. How about Arab World Institute? That is a performing arts venue.",
            "The AC Hotel By Marriott Paris Porte Maillot is a nice 4 star hotel.",
            "Which day do you want to return? Which city are you departing from?",
            "I found 3 flights for you. American Airlines has a flight for $638 at 8:25 am local time. The returning flight takes off at 12:20 pm local time. How about that one?",
            "That flight has 1 stop.",
            "Can I help you with anything else?",
            "Have a good day."
        ]
    },
    {
        "dialogue_id": "20_00056",
        "service": "Travel_1",
        "service_call": {
            "method": {
                "method": "SearchRoundtripFlights",
                "parameters": {
                    "departure_date": "2019-03-02",
                    "destination_city": "Los Angeles",
                    "origin_city": "Chicago",
                    "return_date": "2019-03-06"
                }
            }
        },
        "user_utterance": [
            "Is there any attractions in LA you can find without an entry fee?",
            "Is this museum child-friendly?",
            "How can I contact this museum?",
            "Alright, did you find any other attractions in LA?",
            "Great, I want to find a one star hotel near there, that has two rooms available.",
            "Sounds good, can you also find me a round trip flight that goes there, it should return on Wednesday next week.",
            "I want to fly out on the 2nd, and will depart from Chicago.",
            "That flight sounds great, that is all I need for now, thanks."
        ],
        "system_utterance": [
            "How about a museum, the Autry Museum of the American West?",
            "The Autry Museum of the American West is a perfect place to take your kids along for a day.",
            "Contact this museum by calling 323-667-2000.",
            "I also found a historical landmark you can visit, you should check out the Bradbury Building.",
            "There is a nice 1 star hotel near the historical landmark, would you be interested in staying at the AC Hotel by Marriott Beverly Hills?",
            "From which city do you want to depart from, and on what date would you like to travel?",
            "I found an American Airlines flight that costs $327 per passenger from 4 total flights, it takes off at 10:30 pm local time, and will return at 5:20 am local time.",
            "Understood, hope you enjoy the rest of your day."
        ]
    },
    {
        "dialogue_id": "20_00057",
        "service": "Travel_1",
        "service_call": {
            "method": {
                "method": "SearchRoundtripFlights",
                "parameters": {
                    "airlines": "United Airlines",
                    "departure_date": "2019-03-02",
                    "destination_city": "New York",
                    "number_checked_bags": "0",
                    "origin_city": "London",
                    "return_date": "2019-03-13"
                }
            }
        },
        "user_utterance": [
            "Would you find me attractions in New York City? I need something child friendly.",
            "Any other attractions you could think of?",
            "Thank you. I want to find a hotel room there.",
            "What is the address and cost per night?",
            "Would there be anything else I would like? I need one room with wifi.",
            "Sounds goood to me. Find me a round trip flight that goes there from London. I have 0 bags and would like to fly on United Airlines.",
            "I would like to fly out on the 2nd and return on the 13th.",
            "Would this be a first class ticket and when does the flight arrive?",
            "Sounds good.",
            "No, thank you for helping."
        ],
        "system_utterance": [
            "There are 10 attractions that are good. What about American Folk Art Museum? It's a museum.",
            "How about the museum American Museum of Natural History.",
            "1 Hotel Brooklyn Bridge is a nice 4 star hotel.",
            "It costs $240 per night and the address is 60 Furman Street, Brooklyn.",
            "1 Hotel Central Park is a nice 5 star hotel.",
            "What date do you want to travel on and on which day would the return flight have to be?",
            "Would you like to go on United Airlines at 10:35 pm and return at 6:45 pm? This costs $551 per passenger.",
            "This is an economy ticket that arrives at 2:57 am local time.",
            "Could I assist you with anything else?",
            "Have a great day."
        ]
    },
    {
        "dialogue_id": "20_00058",
        "service": "Travel_1",
        "service_call": {
            "method": {
                "method": "SearchRoundtripFlights",
                "parameters": {
                    "airlines": "United Airlines",
                    "departure_date": "2019-03-04",
                    "destination_city": "Sydney",
                    "number_checked_bags": "0",
                    "origin_city": "Phoenix",
                    "return_date": "2019-03-10"
                }
            }
        },
        "user_utterance": [
            "I'm visiting Sydney, NSW and want to find some attractions to visit. Can you see if there is a good child-friendly nature preserve I could go to?",
            "That sounds cool. What else did you find?",
            "Ok, that sounds good. Can you look up hotels around there?",
            "What else is there? I need two rooms by the way.",
            "Yeah, that one sounds good.",
            "No, not right now.",
            "Yes, can you look up round trip flights to go there? I will have zero bags and usually fly United Airlines. I'll be coming back on the 10th of this month.",
            "Can you find me a flight out of Phoenix on the 4th of March?",
            "That could work. How many stops does it have?",
            "Ok. Does it get there the day after, and when does it arrive back?",
            "Ok, thanks for the info. That's all I need for now."
        ],
        "system_utterance": [
            "Sure, I found 6 nature preserve attractions. How about Featherdale Wildlife Park?",
            "It looks like Gordons Bay is a pretty popular Nature Preserve also.",
            "Sure, how about 28 Hotel Sydney? It's a nice 4 star hotel in that area.",
            "There's another 4 star hotel called 57 Hotel. How about that?",
            "Ok, want to make a reservation?",
            "Ok, anything else I can do then?",
            "Ok. Where will you be flying out of and on what day?",
            "Sure. I found one United Airlines flight for $638 that departs at 9:40 am on the day there, and 11:55 pm on the way back. How about that?",
            "It has 1 stop.",
            "Yes, you'd be arriving there the next day, and on the way back it lands at 4:07 pm.",
            "No problem. Have a good day."
        ]
    },
    {
        "dialogue_id": "20_00059",
        "service": "Travel_1",
        "service_call": {
            "method": {
                "method": "SearchRoundtripFlights",
                "parameters": {
                    "departure_date": "2019-03-02",
                    "destination_city": "Sydney",
                    "flight_class": "Premium Economy",
                    "number_checked_bags": "0",
                    "origin_city": "Las Vegas",
                    "return_date": "2019-03-11"
                }
            }
        },
        "user_utterance": [
            "Show me some attractions to see",
            "Search in Sydney, NSW",
            "Cool, find me a hotel there as well",
            "Cool, sounds perfect",
            "No, not right now.",
            "Sure, Find me round trip flight that flies out on March 2nd",
            "On 11th of March",
            "It is Las Vegas. I want premium economy tickets and zero check in bags",
            "I need 3 tickets. What is the arrival time?",
            "Thanks. That would be all"
        ],
        "system_utterance": [
            "Where should I search for them in",
            "I have found 10 places for you. How about ANZ stadium which is a sports venue?",
            "How about the 4 star 28 Hotel Sydney",
            "Should I book a room for you?",
            "Is there anything else I can help with?",
            "When would the return flight be?",
            "Which is the city of departure?",
            "I found 2 flights for you. How about the delta airlines flight that takes off at 8:30 pm and returns at 3:55 pm. The cost is $925",
            "This is for 1 passenger. It arrives at 11:31 pm",
            "Have a great trip"
        ]
    },
    {
        "dialogue_id": "20_00060",
        "service": "Travel_1",
        "service_call": {
            "method": {
                "method": "SearchRoundtripFlights",
                "parameters": {
                    "departure_date": "2019-03-02",
                    "destination_city": "Phoenix",
                    "flight_class": "Premium Economy",
                    "origin_city": "Portland",
                    "return_date": "2019-03-14"
                }
            }
        },
        "user_utterance": [
            "please find me a historical spot in phoenix, az",
            "what is the entrance fee and is this child-friendly",
            "ok, can you also find me a hotel",
            "yes thats perfect",
            "no not right now",
            "please find me a flight to get there",
            "i am traveling from portland on premium economy on saturday this week",
            "i want to return on 14th of march",
            "when does it arrive ?",
            "cool",
            "no that's it"
        ],
        "system_utterance": [
            "i recommend you hole in the rock in historical landmark",
            "this is free and it is child-friendly",
            "what about aloft phoenix-airport with 3 star",
            "would you like to book a room",
            "what else can i do for you",
            "what city are you traveling from and what date",
            "when would you like to come back",
            "there is 1 flight with american airlines for $446 depart at 7:05 am with return flight depart at 10:45 am",
            "you will arrive at 10 am",
            "what else can i do for you",
            "have a nice day"
        ]
    },
    {
        "dialogue_id": "20_00061",
        "service": "Travel_1",
        "service_call": {
            "method": {
                "method": "SearchRoundtripFlights",
                "parameters": {
                    "departure_date": "2019-03-03",
                    "destination_city": "Toronto",
                    "number_checked_bags": "0",
                    "origin_city": "Los Angeles",
                    "passengers": "3",
                    "return_date": "2019-03-12"
                }
            }
        },
        "user_utterance": [
            "I'm looking for some attractions to visit.",
            "I'm looking for a child-friendly attraction in Toronto, Canada.",
            "Okay, that sounds good. I also need a three star hotel there.",
            "What is the price per night and the address?",
            "Okay, thanks. I need a round trip flight for three people departing from Los Angeles as well. I'm checking 0 bags.",
            "I'm departing on the 12th of March and returning on Sunday this week.",
            "Does the flight arrive the day after it departs?",
            "Okay, thank you. That is all I needed."
        ],
        "system_utterance": [
            "What area do you want to search in?",
            "How about the Tourist Attraction 3D Toronto Sign?",
            "The Best Western Plus Toronto North York Hotel & Suites is a 3 star hotel.",
            "The hotel costs $216 per night and the address is 50 Norfinch Drive.",
            "What date are you departing on and returning on?",
            "There is a Delta Airlines flight departing at 10:05 am for $443 per ticket. The return flight leaves at 6:45 pm.",
            "Yes, the flight arrives on the next day.",
            "Have a great day."
        ]
    },
    {
        "dialogue_id": "20_00062",
        "service": "Travel_1",
        "service_call": {
            "method": {
                "method": "SearchRoundtripFlights",
                "parameters": {
                    "departure_date": "2019-03-05",
                    "destination_city": "Delhi",
                    "origin_city": "San Francisco",
                    "return_date": "2019-03-14"
                }
            }
        },
        "user_utterance": [
            "show different attractions",
            "find them in delhi",
            "adventure island theme park",
            "is it for kids?",
            "okay good then",
            "tell me phone",
            "tell me address",
            "yes that works",
            "san francisco next tuesday 14th of march",
            "0 stops for you",
            "okay then good",
            "no thank you"
        ],
        "system_utterance": [
            "where to look then?",
            "10 are there adventure island theme park",
            "no it is free",
            "yes it is",
            "aloft new delhi aerocity 4 stars",
            "+91 11 4565 0000",
            "5b igi t3 road, delhi - ajmer expressway, aerocity, new delhi",
            "what date then?",
            "2 flights american airlines 6:30 am 7:40 am $531",
            "0 stops 0 stops",
            "anything else for you?",
            "bye bye then"
        ]
    },
    {
        "dialogue_id": "20_00063",
        "service": "Travel_1",
        "service_call": {
            "method": {
                "method": "SearchRoundtripFlights",
                "parameters": {
                    "departure_date": "2019-03-03",
                    "destination_city": "New York",
                    "origin_city": "San Francisco",
                    "return_date": "2019-03-12"
                }
            }
        },
        "user_utterance": [
            "Could you find me some historical landmark to visit?",
            "new york.",
            "Could you find me a hotel there?",
            "Works for me. could you find me a round trip flight heading there?",
            "I'd like to leave from san francisco the day after tomorrow and return march 12th.",
            "Alright",
            "No i'm all set."
        ],
        "system_utterance": [
            "Sure, where?",
            "the bayonne bridge is a historical landmark.",
            "There's 1 hotel brooklyn bridge, it's got 4 stars.",
            "When are you departing, and from where? When would you like to return?",
            "I found a flight with american airlines leaving at 5 am local time and returning at 9:15 am local time. It's $391 per ticket.",
            "Do you need anything else?",
            "Have a great day."
        ]
    },
    {
        "dialogue_id": "20_00064",
        "service": "Travel_1",
        "service_call": {
            "method": {
                "method": "SearchRoundtripFlights",
                "parameters": {
                    "airlines": "American Airlines",
                    "departure_date": "2019-03-03",
                    "destination_city": "Toronto",
                    "origin_city": "Chicago",
                    "passengers": "2",
                    "return_date": "2019-03-05"
                }
            }
        },
        "user_utterance": [
            "Show me attractions to visit.",
            "Please find attractions for Toronto.",
            "Okay that is good.",
            "I would like to find a 1 star hotel for 1 room.",
            "What other hotels might I like?",
            "Yes, that will be great. I'd like to search round trip flights from Chicago there.",
            "I would like to travel the day after tomorrow.",
            "I would like two seats returning next Tuesday with American Airlines.",
            "Thanks and that is all."
        ],
        "system_utterance": [
            "Where can I search attractions.",
            "Check 3D Toronto sign a Tourist Attraction.",
            "Is there anything else to help you with?",
            "Best Western Plus Toronto North York Hotel & Suites is a nice 1 star hotel.",
            "The 1 star Best Western Premier Toronto Airport Carlingview Hotel is nice.",
            "When would you like to travel?",
            "What day would you like to have a return flight?",
            "I have 1 flight for you with American Airlines leaving 4:05 am returning 10:45 am costing $177.",
            "Have a great day."
        ]
    },
    {
        "dialogue_id": "20_00065",
        "service": "Travel_1",
        "service_call": {
            "method": {
                "method": "SearchRoundtripFlights",
                "parameters": {
                    "airlines": "Delta Airlines",
                    "departure_date": "2019-03-01",
                    "destination_city": "Paris",
                    "flight_class": "Economy",
                    "origin_city": "San Francisco",
                    "return_date": "2019-03-13"
                }
            }
        },
        "user_utterance": [
            "Hello. Can you find me an interesting place to visit?",
            "Look at Paris, France.",
            "Can I take my daughter there?",
            "Is it free to enter?",
            "Okay, nice. I want to book 2 rooms at a hotel there.",
            "How much will I have to pay each night?",
            "Okay. Good to know. I need a round trip flight to get there. An economy Delta Airlines flight is ideal.",
            "I will leave San Francisco on the 1st and return on the 13th.",
            "What airport does it depart from?",
            "How many checked bags can I bring?",
            "Okay, good to know.",
            "No, that's all for now."
        ],
        "system_utterance": [
            "Sure. Where should I search?",
            "Okay. There's the American Church in Paris place of worship.",
            "Yes, this place is child friendly.",
            "It is free.",
            "How about the 4 star AC Hotel by Marriott Paris Porte Maillot?",
            "The nightly cost is $432.",
            "Where will you leave from? When will you leave and return?",
            "Okay. I found 1 flight for you. How does the $689 Delta Airlines flight that leaves at 1:30 pm and returns at 9:15 am sound?",
            "From SFO International Airport.",
            "You can bring 0 checked bags.",
            "Can I help you some more?",
            "Have a great day."
        ]
    },
    {
        "dialogue_id": "20_00066",
        "service": "Travel_1",
        "service_call": {
            "method": {
                "method": "SearchRoundtripFlights",
                "parameters": {
                    "departure_date": "2019-03-01",
                    "destination_city": "London",
                    "origin_city": "Philadelphia",
                    "passengers": "4",
                    "return_date": "2019-03-03"
                }
            }
        },
        "user_utterance": [
            "Could you find me some attractions in London, UK?",
            "Sure, could you find me ahotel there too?",
            "Works for me. Could you find a round trip flight going there as well? I'd like to leave from philadelphia on the 1st of this month.",
            "THe 12th of this month.",
            "Could you find me 4 seats leaving on the 3rd of this month?",
            "Alright.",
            "Thanks, that's all I need"
        ],
        "system_utterance": [
            "How about this historical landmark, 30 st mary axe (The gherkin)?",
            "I found 10 options. How about the 5 star hotel 45 park lane?",
            "Okay, when do you want to return?",
            "How about an american airlines flight with the departing flight leaving at 8:45 pm and the return flight leaving at 2 am. It costs $526 per ticket.",
            "How about a delta airlines flight leaving at 4:20 am and returning at 4 pm local time? It's $552 per ticket.",
            "Do you need anything else?",
            "Have a good day."
        ]
    },
    {
        "dialogue_id": "20_00067",
        "service": "Travel_1",
        "service_call": {
            "method": {
                "method": "SearchRoundtripFlights",
                "parameters": {
                    "departure_date": "2019-03-02",
                    "destination_city": "London",
                    "origin_city": "San Francisco",
                    "return_date": "2019-03-12"
                }
            }
        },
        "user_utterance": [
            "I am looking for something fun to do that is child-friendly, an attraction like a playground, any recommendations?",
            "I am searching for attractions in London, UK.",
            "Sounds cool, can you tell me more about the other attractions you found?",
            "Great, can you also find me a hotel room near there?",
            "Perfect, I will also need a round trip flight going there as well?",
            "I will depart from San Francisco.",
            "Planning to fly out on the 2nd, and will return on March 12th.",
            "Sounds all right, thanks, that is all I needed."
        ],
        "system_utterance": [
            "Where are you looking for attractions or playgrounds?",
            "From 6 attractions I found, would you be interested in a sports venue, the Alexandra Palace Ice Rink?",
            "How about another type of sports venue, the All England Lawn Tennis & Croquet Club?",
            "I found a 5 star hotel near there, how about 45 Park Lane?",
            "From which city will you be departing from?",
            "On which date would you like to travel, and when will you return?",
            "How about flying on American Airlines, there is a flight taking off at 5 am, its return flight takes of at 2 am, and it costs $823 per passenger?",
            "No problem, have a good day."
        ]
    },
    {
        "dialogue_id": "20_00068",
        "service": "Travel_1",
        "service_call": {
            "method": {
                "method": "SearchRoundtripFlights",
                "parameters": {
                    "airlines": "United Airlines",
                    "departure_date": "2019-03-03",
                    "destination_city": "Toronto",
                    "origin_city": "Los Angeles",
                    "return_date": "2019-03-11"
                }
            }
        },
        "user_utterance": [
            "I want to visit a park",
            "In toronto, ontario",
            "Give me their phone number",
            "Cool. I also want to book a hotel room there",
            "Tell me the address",
            "No, show me a one star place",
            "Cool, Help me searching a round trip united airlines flight that flies out of Los Angeles on 3rd of this month",
            "On 11th of this month",
            "What is the time of arrival of return flight?",
            "Thanks, that works",
            "No, thanks, That would be all"
        ],
        "system_utterance": [
            "Which city are you looking in ?",
            "Allan gardens is a nice park there",
            "It is 416-392-7288",
            "How about the 3 star best western plus toronto north york hotel & suites?",
            "It is 50 norfinch drive",
            "How about the 1 star best western premier toronto airport carlingview hotel",
            "When is your return flight planned?",
            "There is a united airlines flight at 6:15 am whose return flight leaves at 4:10 pm and costs $554",
            "At 10:35 pm",
            "Is there anything else I can help with?",
            "have a great trip"
        ]
    },
    {
        "dialogue_id": "20_00069",
        "service": "Travel_1",
        "service_call": {
            "method": {
                "method": "ReserveHotel",
                "parameters": {
                    "check_in_date": "2019-03-02",
                    "location": "London",
                    "number_of_rooms": "3",
                    "place_name": "Abc Hyde Park Hotel",
                    "stay_length": "7"
                }
            }
        },
        "user_utterance": [
            "find some attractions",
            "find in london",
            "okay good then 1 room",
            "I want 3 rooms",
            "tell me number",
            "sounds very good",
            "this saturday seven days",
            "sure this works",
            "thanks a lot"
        ],
        "system_utterance": [
            "where to look?",
            "10 places 30 st mary axe (the gherkin) historical landmark",
            "45 park lane 5 stars",
            "abc hyde park hotel 3 stars",
            "+44 20 7706 4660",
            "wanna get it?",
            "abc hyde park hotel march 2nd 3 rooms london 7 days",
            "it was booked",
            "have a good day"
        ]
    },
    {
        "dialogue_id": "20_00070",
        "service": "Travel_1",
        "service_call": {
            "method": {
                "method": "ReserveHotel",
                "parameters": {
                    "check_in_date": "2019-03-05",
                    "location": "San Francisco",
                    "number_of_rooms": "1",
                    "place_name": "Argonaut Hotel",
                    "stay_length": "1"
                }
            }
        },
        "user_utterance": [
            "I'm interested in finding attractions to visit? I am particularly interested in a Historical Landmark.",
            "I would like to find attractions in SF.",
            "Okay, that sounds fine. Can you do a search for hotels around that area as well? I would like 1 room.",
            "Are there other hotels that meet my preferences?",
            "That sounds fine. I want to make a reservation at that hotel.",
            "I want to check in on later today.",
            "I will stay for five days.",
            "No, I will only stay for 1 day.",
            "No, you will check in next Tuesday.",
            "Yes, that is good.",
            "What is the phone number and street address of the hotel?",
            "Thank you, your help is greatly appreciated.",
            "No thank you, you have helped me a lot."
        ],
        "system_utterance": [
            "What city do you want me to find attractions in?",
            "I have found 8 attractions that you may be interested in. One you should look at is Alcatraz, it's a historical landmark.",
            "I have located 10 hotels that match your preferences. One is a hotel called Amsterdam Hostel San Francisco. Its rating is 1 star.",
            "There is a 4 star hotel called Argonaut Hotel.",
            "What is the day that you want to check in?",
            "How many days are you going to stay there?",
            "Okay, can you confirm these details: You would like to book 1 hotel room in the Argonaut hotel in San Francisco for 5 days and you will be checking in on March 1st.",
            "Please confirm these details: You will check in on March 1st and you will stay for 1 day.",
            "Confirm these details if you would: You want to check in on March 5th and you will stay for 1 day.",
            "The hotel has been successfully booked.",
            "The phone number is +1 415-563-0800 and the address is 495 Jefferson Street.",
            "Are there any other things you need help with?",
            "Goodbye, and have a fine day!"
        ]
    },
    {
        "dialogue_id": "20_00071",
        "service": "Travel_1",
        "service_call": {
            "method": {
                "method": "ReserveHotel",
                "parameters": {
                    "check_in_date": "2019-03-02",
                    "location": "Philadelphia",
                    "number_of_rooms": "3",
                    "place_name": "Aka University City",
                    "stay_length": "5"
                }
            }
        },
        "user_utterance": [
            "show me some attractions",
            "find in philadelphia",
            "okay good then",
            "tell me the price",
            "tell me their phone",
            "check in tomorrow",
            "for 4 days",
            "I want 3",
            "five days stay",
            "tell me address",
            "thanks a lot",
            "No thank you"
        ],
        "system_utterance": [
            "where do I look?",
            "10 attractions check art museum steps tourist attraction",
            "10 hotels aka university city 3 stars",
            "it is $138 a night",
            "it is +1 215-372-9000",
            "how long stay?",
            "aka university city march 2nd philadelphia 1 room 4 days",
            "aka university city 3 rooms",
            "5 days 3 room",
            "it is cira centre south, 2929 walnut street",
            "anything else then?",
            "Bye bye then"
        ]
    },
    {
        "dialogue_id": "20_00072",
        "service": "Travel_1",
        "service_call": {
            "method": {
                "method": "ReserveHotel",
                "parameters": {
                    "check_in_date": "2019-03-08",
                    "location": "Paris",
                    "number_of_rooms": "1",
                    "place_name": "Aparthotel Adagio Paris Montmartre",
                    "stay_length": "4"
                }
            }
        },
        "user_utterance": [
            "can you show me some cool places to visit?",
            "anywhere in paris, france.",
            "okay cool, can you get me 1 room at a 3 star hotel around there?",
            "are there any other hotels?",
            "is smoking allowed there?",
            "that works for me, can you book it?",
            "i want to check in on the 4th of this month.",
            "i'll be there for 4 days.",
            "actually, can you make my check in date the 8th of march?",
            "yeah that's perfect. what's their number?",
            "what's their nightly rate?",
            "thanks, that's all for now."
        ],
        "system_utterance": [
            "where should i look?",
            "there's 10 places i found for you. there's a place of worship there called the american church in paris.",
            "there's 10 places i found for you. there's a 3 star hotel there called the aparthotel adagio access paris la villette.",
            "there's also a 3 star hotel called the aparthotel adagio paris montmartre.",
            "yes, you can smoke there.",
            "when do you want to check in?",
            "how long will your stay be?",
            "okay so you want 1 room for 4 days at the aparthotel adagio paris montmartre in paris on march 4th?",
            "okay so you want to check in on march 8th at the aparthotel adagio paris montmartre.",
            "it's been booked. you can reach them at +33 1 42 57 14 55.",
            "it'll cost $72 a night.",
            "have a great day."
        ]
    },
    {
        "dialogue_id": "20_00073",
        "service": "Travel_1",
        "service_call": {
            "method": {
                "method": "ReserveHotel",
                "parameters": {
                    "check_in_date": "2019-03-06",
                    "location": "Paris",
                    "number_of_rooms": "1",
                    "place_name": "Ac Hotel By Marriott Paris Porte Maillot",
                    "stay_length": "6"
                }
            }
        },
        "user_utterance": [
            "Hi, are there any nice attractions I can visit at a Museum in Paris?",
            "I see, are there any alternatives?",
            "That sounds great!",
            "Could you get me one four star room at a hotel in that area too?",
            "Sure, how can I contact them?",
            "I see, and where can I visit them?",
            "That sounds amazing.",
            "Sure, could you make one for me please?",
            "Likely for six days.",
            "I will be checking in on the 6th of this month.",
            "Sure, how much will this cost me each night?",
            "I see, can I smoke there?",
            "Sure, that is all I need, thanks!",
            "No, that is all. Thank you so much."
        ],
        "system_utterance": [
            "Sure, how about Cite de l'architecture et du patrimoine, a museum?",
            "There is also a museum called Cognacq-Jay Museum.",
            "Do you need further assistance?",
            "There are 10 hotels available, would you like a 4 star hotel called Ac Hotel By Marriott Paris Porte Maillot?",
            "You can contact them at +33 1 84 82 49 09.",
            "You locate them at 6 Rue Gustave Charpentier, 75017.",
            "Would you like a reservation there?",
            "How long will you be staying there for?",
            "And when do you plan to stay from?",
            "Please confirm your reservation for 1 room at Ac Hotel by Marriott Paris Porte Maillot in Paris on March 6th for 6 days.",
            "Your reservation has been made, which will cost you $456 each night.",
            "No, you are not allowed to.",
            "Is there anything I can help you with?",
            "No worries, have an enjoyable trip."
        ]
    },
    {
        "dialogue_id": "20_00074",
        "service": "Travel_1",
        "service_call": {
            "method": {
                "method": "ReserveHotel",
                "parameters": {
                    "check_in_date": "2019-03-04",
                    "location": "London",
                    "number_of_rooms": "2",
                    "place_name": "Ace Hotel London",
                    "stay_length": "4"
                }
            }
        },
        "user_utterance": [
            "can you find me some attraction to go to",
            "please search for religious spot in london",
            "is this place child-friendly",
            "what is their number",
            "ok, can you also find me two room hotel with 4 star in that area",
            "perfect",
            "yes please",
            "i am staying for 4 days",
            "i will check in on monday next week",
            "yes please",
            "thank you that's all i need now"
        ],
        "system_utterance": [
            "what category do you prefer",
            "you should go to all saints, margaret street for place of worship",
            "yes this is a child friendly place to go",
            "their number is 20 7636 1788",
            "i found 10 hotels. what about ace hotel london with 4 star",
            "would you like to book the hotel",
            "how long are you staying",
            "when are you checking in",
            "please confirm your booking for 2 rooms with ace hotel london in london for 4 days on march 4th",
            "your room is booked",
            "have a nice day"
        ]
    },
    {
        "dialogue_id": "20_00075",
        "service": "Travel_1",
        "service_call": {
            "method": {
                "method": "ReserveHotel",
                "parameters": {
                    "check_in_date": "2019-03-08",
                    "location": "New York",
                    "number_of_rooms": "2",
                    "place_name": "Amsterdam Court Hotel",
                    "stay_length": "1"
                }
            }
        },
        "user_utterance": [
            "looking for wildlife spot",
            "find in nyc",
            "okay good",
            "1 room three stars",
            "tell me address",
            "two rooms then",
            "any other ones?",
            "sounds very good",
            "friday next week",
            "1 day it will be",
            "sure this works",
            "thanks a lot"
        ],
        "system_utterance": [
            "where to look?",
            "bronx zoo nature preserve",
            "anything else then?",
            "11 howard 3 star hotel",
            "11 howard street $72",
            "adria hotel & conference center 3 stars",
            "amsterdam court hotel 3 stars",
            "wanna get it?",
            "how long then?",
            "amsterdam court hotel march 8th 1 day new york 2 rooms",
            "it was booked",
            "bye bye then"
        ]
    },
    {
        "dialogue_id": "20_00076",
        "service": "Travel_1",
        "service_call": {
            "method": {
                "method": "ReserveHotel",
                "parameters": {
                    "check_in_date": "2019-03-01",
                    "location": "Philadelphia",
                    "number_of_rooms": "1",
                    "place_name": "Fairfield Inn & Suites By Marriott Philadelphia Downtown/Center City",
                    "stay_length": "6"
                }
            }
        },
        "user_utterance": [
            "Hello, I'd like to find a museum in Philly that's good for kids.",
            "That sounds good! Now I need to find 1 room in a 2 star hotel in the area.",
            "Yeah, that works for me.",
            "Yes please, I'd like to check in today if possible.",
            "I want to have the room for six days.",
            "That's exactly right. Can you get me their number and address?",
            "Thanks so much, you've been a big help.",
            "No thanks, you've done it all."
        ],
        "system_utterance": [
            "I found 10 places you may like. You could try Barnes Foundation, which is a cool museum.",
            "There are 3 hotels for you. One is a 2 star hotel called Fairfield Inn & Suites by Marriott Philadelphia Downtown/Center City.",
            "Should I book you a room there?",
            "Okay, how long would you like to stay there?",
            "Great, confirming 1 room at Fairfield Inn & Suites by Marriott Philadelphia Downtown/Center City in Philadelphia, checking in on March 1st and staying for 6 days.",
            "The room is successfully booked! You can call them at +1 800-228-2800 and the hotel is located at 261 South 13th Street.",
            "Can I do anything more for you?",
            "Goodbye, have a nice day today!"
        ]
    },
    {
        "dialogue_id": "20_00077",
        "service": "Travel_1",
        "service_call": {
            "method": {
                "method": "ReserveHotel",
                "parameters": {
                    "check_in_date": "2019-03-10",
                    "location": "London",
                    "number_of_rooms": "1",
                    "place_name": "45 Park Lane",
                    "stay_length": "4"
                }
            }
        },
        "user_utterance": [
            "Find me some events to see.",
            "Look in London, England.",
            "Does this place have free entry?",
            "That is good. I need a hotel near there also.",
            "Do they allow smoking?",
            "How much does it cost a night?",
            "That is great. Get me a room there for March 10th.",
            "I want to stay for four days.",
            "That is correct. What is their location and contact number?",
            "Thanks for the help.",
            "No, that is all. Thanks."
        ],
        "system_utterance": [
            "What city shall I look in?",
            "Search revealed 10 results. 30 St Mary Axe (The Gherkin) is a Historical Landmark.",
            "They do offer free entry.",
            "45 Park Lane is a 5 star hotel.",
            "They do not allow smoking.",
            "A room costs $350 a night.",
            "How many days will you stay there?",
            "You want 1 room for 4 days at 45 Park Lane in London starting on March 10th, correct?",
            "Your room is booked. You can contact them at +44 20 7493 4545 and you can visit them at 45 Park Lane.",
            "Do you need more help?",
            "Goodbye, have a wonderful day."
        ]
    },
    {
        "dialogue_id": "20_00078",
        "service": "Travel_1",
        "service_call": {
            "method": {
                "method": "ReserveHotel",
                "parameters": {
                    "check_in_date": "2019-03-08",
                    "location": "San Diego",
                    "number_of_rooms": "1",
                    "place_name": "Bahia Resort Hotel",
                    "stay_length": "4"
                }
            }
        },
        "user_utterance": [
            "Can you find me some child friendly attractions?",
            "I need to find some things in San Diego.",
            "Okay what else did you find?",
            "What else did you find?",
            "Okay that sounds good. Can you find me a hotel also? I need 1 room.",
            "Sounds great, thanks.",
            "Please make the reservation.",
            "I will be there 4 days.",
            "I will check in on the 8th of this month.",
            "Yes that is correct. Do they allow smoking? What is the street address?",
            "Thanks for your help. That's all I need for now."
        ],
        "system_utterance": [
            "Where should I check?",
            "Balboa Park is a nice park.",
            "Balboa theatre is a nice performing arts venue.",
            "The Birch Aquarium at Scripps Institution of Oceanography is a great nature preserve.",
            "I found 10 hotels you may like. How about Bahia Resort Hotel which is rated 3 stars.",
            "Can I do anything else for you?",
            "How long do you need the room?",
            "What is your check in date?",
            "You want 1 room at the Bahia Resort Hotel on March 8th for 4 days in San Diego, correct?",
            "Your room has been reserved. They are located at 998 West Mission Bay Drive and they do not allow smoking.",
            "Okay have a great day!"
        ]
    },
    {
        "dialogue_id": "20_00079",
        "service": "Travel_1",
        "service_call": {
            "method": {
                "method": "ReserveHotel",
                "parameters": {
                    "check_in_date": "2019-03-04",
                    "location": "Portland",
                    "number_of_rooms": "1",
                    "place_name": "Best Western Plus Portland Airport Hotel & Suites",
                    "stay_length": "3"
                }
            }
        },
        "user_utterance": [
            "Any good tourist traps worth seeing?",
            "What about Portland, OR.",
            "Is this place free? How can I talk to them?",
            "Then I'm there. Find me a hotel to stay in.",
            "I dunno. Keep going.",
            "What will that run me?",
            "That's my speed.",
            "Book the hotel.",
            "Book it for 3 days beginning next Monday.",
            "That's right. Should I bring my bong?",
            "Great. You're good at this.",
            "No. I'm all good."
        ],
        "system_utterance": [
            "Depends on the place.",
            "You should visit this park, Crystal Springs Rhododendron Garden.",
            "Call them at 503-771-8386. It's free.",
            "Try Aloft Portland Airport at Cascade Station. They have 3 stars.",
            "Ok. There is Best Western Plus Portland Airport Hotel & Suites. 2 star place.",
            "$168 a night.",
            "Great. What else?",
            "Give me the dates.",
            "1 room for 3 days at the Best Western Plus Portland Airport Hotel & Suites in Portland beginning on March 4th?",
            "No. There is no smoking. You have a room.",
            "Thanks. Anything else?",
            "Glad I could be of help."
        ]
    },
    {
        "dialogue_id": "20_00080",
        "service": "Travel_1",
        "service_call": {
            "method": {
                "method": "ReserveHotel",
                "parameters": {
                    "check_in_date": "2019-03-05",
                    "location": "Anaheim",
                    "number_of_rooms": "1",
                    "place_name": "Anaheim Rv Park",
                    "stay_length": "7"
                }
            }
        },
        "user_utterance": [
            "Can you help me find attractions to visit?",
            "I want some attractions in Anaheim.",
            "Okay. What hotels are in that area?",
            "Is smoking allowed there? What's their street address?",
            "Any other hotels that match my criteria? I need one rooms in a hotel that allows smoking.",
            "Sounds good. I would like to reserve a room there. I'm looking to check in on the 5th for 2 days.",
            "Sorry, change of plans. I'll be staying for seven days.",
            "Yes. What's the price per night? What is their street address?",
            "Thanks, that is very helpful.",
            "No, thanks, that's all."
        ],
        "system_utterance": [
            "What city are you interested in?",
            "I have 10 attractions that may interest you. You should check out Angel Stadium of Anaheim. That's a sports venue.",
            "The Anaheim Desert Inn And Suites is a 2 star hotel. How about that one?",
            "No, smoking is not allowed on the property. Their street address is 1600 South Harbor Boulevard.",
            "Anaheim RV Park is a 2 star hotel. Would you like that one?",
            "Please confirm: You are reserving 1 room at Anaheim RV Park in Anaheim. You're checking in on March 5th and you will be staying for 2 days.",
            "Please confirm: You will be staying for 7 days at your hotel in Anaheim.",
            "Your hotel has been booked. Their address is 200 West Midway Drive. The rate is $174 per night.",
            "Is there anything else I can help you with today?",
            "Have a good day."
        ]
    },
    {
        "dialogue_id": "20_00081",
        "service": "Travel_1",
        "service_call": {
            "method": {
                "method": "ReserveHotel",
                "parameters": {
                    "check_in_date": "2019-03-05",
                    "location": "Seattle",
                    "number_of_rooms": "1",
                    "place_name": "Best Western Plus Pioneer Square Hotel Downtown",
                    "stay_length": "4"
                }
            }
        },
        "user_utterance": [
            "find some attractions",
            "look in seattle",
            "tell me phone",
            "okay good then 3 stars",
            "staying 4 days",
            "5th of this month",
            "is there smoking?",
            "thanks a lot",
            "no thank you"
        ],
        "system_utterance": [
            "where to search?",
            "tourist attraction brandon lee and bruce lee's grave site 10 places",
            "it is 206-322-1582",
            "best western plus pioneer square hotel downtown 3 stars",
            "when is check in?",
            "best western plus pioneer square hotel downtown march 5th 1 in seattle 4 days",
            "phone is +1 206-340-1234",
            "anything else then?",
            "bye bye now"
        ]
    },
    {
        "dialogue_id": "20_00082",
        "service": "Travel_1",
        "service_call": {
            "method": {
                "method": "ReserveHotel",
                "parameters": {
                    "check_in_date": "2019-03-04",
                    "location": "New York",
                    "number_of_rooms": "1",
                    "place_name": "Bklyn House Hotel",
                    "stay_length": "5"
                }
            }
        },
        "user_utterance": [
            "Find me some attractions",
            "in New york city",
            "Search for a one room in a 2 star hotel",
            "Is smoking allowed and whats their number?",
            "book it",
            "form next monday for next 5 days",
            "ok, whats the address sand cost per night",
            "thanks a lot",
            "no,"
        ],
        "system_utterance": [
            "where to look in",
            "I found 10 attractions of which there is the performing arts venue , the 92nd street Y",
            "Bklyn House Hotel is 2 star",
            "its +1 718-388-4433 smoking is allowed",
            "whats the check in and check out?",
            "please confirm: Booking 1 room at the Bklyn House Hotel in New York for march 4th checkin for 5 days",
            "booked. the address is 9 Beaver street, brooklyn and $100 a night",
            "any thing else?",
            "bye"
        ]
    },
    {
        "dialogue_id": "20_00083",
        "service": "Travel_1",
        "service_call": {
            "method": {
                "method": "ReserveHotel",
                "parameters": {
                    "check_in_date": "2019-03-01",
                    "location": "Washington D.C.",
                    "number_of_rooms": "1",
                    "place_name": "Arc The.Hotel",
                    "stay_length": "5"
                }
            }
        },
        "user_utterance": [
            "I'm looking for attraction I can go to.",
            "I want to look in District of Columbia.",
            "What's the cost for it?",
            "Is it okay for kids to go to? And do they have a number I can call them at?",
            "Alright, nice, what else do you recommend?",
            "Sounds good. Help me look for hotels around there too.",
            "Okay, nice. I want to book 1 room with a check in of the 1st of this month for 5 days.",
            "Yes, that's correct. What's the hotel's phone number? And do they allow smoking there?",
            "Okay, you've been of great help. That's all the help I need."
        ],
        "system_utterance": [
            "Where would you like to look?",
            "You might like 56 Signers of the Declaration of Independence Memorial. It's a Nature Preserve.",
            "It's free.",
            "I would say it's okay for kids. You can call them at 202-426-6841.",
            "You might like Cathedral of St. Matthew the Apostle. It's a Place of Worship.",
            "There's a 3 star hotel called Arc The.Hotel around that area.",
            "I'll book you 1 room at Arc The.Hotel in Washington D.C. with a check in on March 1st for 5 days, is that correct?",
            "I've booked the room. The hotel's number is +1 202-337-6620. You cannot smoke there.",
            "Okay, take care and have a fine day!"
        ]
    },
    {
        "dialogue_id": "20_00084",
        "service": "Travel_1",
        "service_call": {
            "method": {
                "method": "ReserveHotel",
                "parameters": {
                    "check_in_date": "2019-03-10",
                    "location": "Paris",
                    "number_of_rooms": "2",
                    "place_name": "Ac Hotel By Marriott Paris Porte Maillot",
                    "stay_length": "3"
                }
            }
        },
        "user_utterance": [
            "I want to find something to visit. What interesting attractions are there?",
            "Find something in Paris.",
            "That sounds great. I need somewhere to stay, could you find me some hotels in there",
            "Sure, that one sounds good. Please book two rooms.",
            "Make it from the 10th for three days.",
            "That is correct.",
            "Thanks a lot.",
            "No, that would be all for now."
        ],
        "system_utterance": [
            "Where do you want to look for?",
            "There are 10 possible attractions you might like in Paris. You could go to American Church in Paris, it is a Place of Worship.",
            "There is a 4 star rated hotel available, the Ac Hotel By Marriott Paris Porte Maillot.",
            "When do you want to check in? For how long do you want the reservation?",
            "Please confirm: Booking 2 2rooms at Ac Hotel By Marriott Paris Porte Maillot in Paris from March 10th for 3 days.",
            "The rooms have been booked.",
            "Is there anything else I can help you with?",
            "Have a great day."
        ]
    },
    {
        "dialogue_id": "20_00085",
        "service": "Travel_1",
        "service_call": {
            "method": {
                "method": "ReserveHotel",
                "parameters": {
                    "check_in_date": "2019-03-08",
                    "location": "London",
                    "number_of_rooms": "1",
                    "place_name": "Ace Hotel London",
                    "stay_length": "6"
                }
            }
        },
        "user_utterance": [
            "Can you suggest some attractions to see in London?",
            "Sounds good. Can you check on some hotels?",
            "What's another choice?",
            "Can you check again. I would like one room in a 4 star hotel.",
            "How much is it? Do they allow smoking?",
            "Okay. Can you make a reservation there?",
            "I'd like to check in on the 8th and will be staying six days.",
            "That's right. What's their address and phone number?",
            "Thank you so much.",
            "No thanks. This is perfect."
        ],
        "system_utterance": [
            "I found 10 you may like. There's a historical landmark 30 St Mary Axe (The Gherkin)",
            "I found 10 hotels. There's a 5 star hotel called 45 Park Lane.",
            "ABC Hyde Park Hotel is a 3 star.",
            "Ace Hotel London is a 4 star.",
            "They do not allow smoking anywhere on the property. The cost is $304 a night.",
            "When did you want to check in and how long will you be staying?",
            "Please verify: You would like 1 room for 6 days starting March 8th at Ace Hotel London in London.",
            "100 Shoreditch High Street, their number is +44 20 7613 9800. Your room is confirmed.",
            "Is there anything else you need?",
            "Have a great day! Bye."
        ]
    },
    {
        "dialogue_id": "20_00086",
        "service": "Travel_1",
        "service_call": {
            "method": {
                "method": "ReserveHotel",
                "parameters": {
                    "check_in_date": "2019-03-04",
                    "location": "Washington D.C.",
                    "number_of_rooms": "3",
                    "place_name": "Arc The.Hotel",
                    "stay_length": "7"
                }
            }
        },
        "user_utterance": [
            "Can you find me a place I can visit? Make sure it's free.",
            "In Washington, please.",
            "Okay, good to know. Can you book me a three room hotel in the area?",
            "What's the phone number? Is smoking allowed there?",
            "Good to know. I'd like to book the rooms.",
            "For seven days, starting on the 4th.",
            "That is correct. Can I also have an address and a nightly price?",
            "Okay, thanks. You were a great help. That'll be all."
        ],
        "system_utterance": [
            "At what location?",
            "There's a nature preserve there called 56 Signers of the Declaration of Independence Memorial.",
            "Sure thing. There's a 3 star hotel called Arc The.Hotel.",
            "You can call +1 202-337-6620. You can't smoke there.",
            "For how long?",
            "Okay. You want to book 3 rooms at Arc The.Hotel in Washington D.C. for 7 days starting on March 4th?",
            "I booked your rooms. Enjoy your stay. You can reach them at 824 New Hampshire Avenue Northwest, Washington, District of Columbia 20037, United States, and you'll have to pay them $261 for each night you stay there.",
            "Have a great day! See you later."
        ]
    },
    {
        "dialogue_id": "20_00087",
        "service": "Travel_1",
        "service_call": {
            "method": {
                "method": "ReserveHotel",
                "parameters": {
                    "check_in_date": "2019-03-09",
                    "location": "San Diego",
                    "number_of_rooms": "2",
                    "place_name": "Grande Colonial La Jolla",
                    "stay_length": "4"
                }
            }
        },
        "user_utterance": [
            "I'd like a Park in SD, if possible without entry fee",
            "Sounds interesting, but I want something child-friendly",
            "Can I get their contact number?",
            "Perfect! I need one room in a four star hotel in that area",
            "I would prefer another hotel. I need two rooms",
            "How much does it cost per night? Can I get the address?",
            "Can you tell me more hotels?",
            "Yes, It's fine for me!",
            "Yes, I want to book a room for four days",
            "The arrival day is the 9th",
            "Yes, It's correct. Thanks",
            "Thanks a lot for helping!",
            "No, thanks, It's all for today"
        ],
        "system_utterance": [
            "I found a Park, Cabrillo National Monument",
            "I found 2 attractions. I suggest La Jolla Shores Park, a Park",
            "Sure! Contact number is 619-221-8899",
            "There are 10 hotels. Catamaran Resort Hotel And Spa is a 4 star hotel",
            "There are 9 hotels. I suggest the 4 star hotel Estancia La Jolla Hotel & Spa",
            "The hotel costs $248 per night. Its address is 9700 North Torrey Pines Road, La Jolla, California 92037, United States",
            "What about the 4 stars hotel Grande Colonial La Jolla?",
            "Do you want to book it?",
            "What is the arrival day?",
            "2 rooms at Grande Colonial La Jolla, in San Diego, from March 9th for 4 days. Is it correct?",
            "Your reservation is confirmed!",
            "Do you need anything else?",
            "Have a nice day"
        ]
    },
    {
        "dialogue_id": "20_00088",
        "service": "Travel_1",
        "service_call": {
            "method": {
                "method": "ReserveHotel",
                "parameters": {
                    "check_in_date": "2019-03-01",
                    "location": "San Diego",
                    "number_of_rooms": "1",
                    "place_name": "Catamaran Resort Hotel And Spa",
                    "stay_length": "6"
                }
            }
        },
        "user_utterance": [
            "Give me some attractions I should visit.",
            "I want San Diego.",
            "Fine, what about a four star hotel there?",
            "Fien, I'd like to reserve a room I want to check in on the 1st of march and stay six days.",
            "Perfect, thank you.",
            "How much per night there? What address is it?",
            "Great, you're a real pip you know it?"
        ],
        "system_utterance": [
            "Where are you looking for?",
            "You should check out Balboa Park. It's a park there. (From the old Columbian exhibition there).",
            "There are 10 choices. One is Catamaran Resort Hotel and Spa. It has 4 stars.",
            "To be clear: 1 room at Catamaran Resort Hotel and Spa, on March 1st for 6 days, in San Diego.",
            "Your hotel is booked.",
            "It's at 3999 Mission Boulevard. Cost is $296 nightly.",
            "Fine, thanks and enjoy SD."
        ]
    },
    {
        "dialogue_id": "20_00089",
        "service": "Travel_1",
        "service_call": {
            "method": {
                "method": "ReserveHotel",
                "parameters": {
                    "check_in_date": "2019-03-03",
                    "location": "Chicago",
                    "number_of_rooms": "2",
                    "place_name": "Acme Hotel Company Chicago",
                    "stay_length": "4"
                }
            }
        },
        "user_utterance": [
            "Can you show me available attraction? I want to something child-friendly. Anything is okay.",
            "Look for events in Chicago.",
            "What's the number and fee?",
            "Great, could you look for hotels too. Find places I can smoke at.",
            "Sounds great. I want one room for 7 days and will be checking in on Wednesday next week.",
            "No, I changed my mind, I want to stay four days in two rooms.",
            "And make check-in on this Sunday.",
            "Yes, what's their address and phone number?",
            "Thanks, you have been great!",
            "No, thanks, goodbye."
        ],
        "system_utterance": [
            "Where should I search?",
            "There are 10 events in Chicago you might like. The tourist Attraction 360 Chicago may interest you.",
            "Entry is free and the number is 888-875-8439.",
            "I found 10 hotels for you. Acme Hotel Company Chicago is a 3 star hotel.",
            "Please confirm the following: Booking 1 room for 7 days at Acme Hotel Company Chicago in Chicago. You're checking in on March 6th.",
            "Please confirm the following: You will be staying 4 days and want 2 rooms.",
            "Please confirm the following: You will be checking in Acme Hotel Company Chicago on March 3rd.",
            "The hotel was successfully booked. The number is +1 312-894-0800 and the address is 15 East Ohio Street.",
            "May I assist you further?",
            "Have a great day!"
        ]
    },
    {
        "dialogue_id": "20_00090",
        "service": "Travel_1",
        "service_call": {
            "method": {
                "method": "ReserveHotel",
                "parameters": {
                    "check_in_date": "2019-03-09",
                    "location": "London",
                    "number_of_rooms": "1",
                    "place_name": "45 Park Lane",
                    "stay_length": "2"
                }
            }
        },
        "user_utterance": [
            "Can you get me a fun place to visit?",
            "Get me London UK.",
            "Great. What about a hotel there?",
            "Can I smoke there?",
            "Great, I hate stinky smokers.",
            "Please, I want to go there on the 9th of this month and stay for two days.",
            "You got each nuance.",
            "Thanks so much, I almost feel bad about not giving you a tip.",
            "No, but I do love the way you help me."
        ],
        "system_utterance": [
            "Where should I check?",
            "Well, one I keep hearing about over and over is the 30 St Mary Axe (The Gherkin). It's a historical landmark.",
            "10 or more choices, starting with the 5 star, 45 Park lane.",
            "No, it's banned on the property.",
            "Do you need a reservation?",
            "To be clear: 1 room for 2 days at 45 Park Lane. Checking in on March 9th. It's in London.",
            "You're set then.",
            "No worries, anything else?",
            "Bye now, thanks, I love helping."
        ]
    },
    {
        "dialogue_id": "20_00091",
        "service": "Travel_1",
        "service_call": {
            "method": {
                "method": "ReserveHotel",
                "parameters": {
                    "check_in_date": "2019-03-09",
                    "location": "Atlanta",
                    "number_of_rooms": "1",
                    "place_name": "Ac Hotel By Marriott Atlanta Downtown",
                    "stay_length": "3"
                }
            }
        },
        "user_utterance": [
            "I want to go somewhere any ideas?",
            "Find me somewhere in ATL please.",
            "Hey, that sounds pretty interesting. Find me a hotel around there please.",
            "Tell me some more hotels.",
            "That one sounds nice.",
            "Yes get me a room please.",
            "I plan to stay three days.",
            "I plan to be there on the 9th of March.",
            "That was my request.",
            "Wait, how much will that cost and do you have a number I can get for them?",
            "You sure made everything easier, you can go now."
        ],
        "system_utterance": [
            "Where do you want to go?",
            "One idea is a Park called Atlanta Botanical Garden.",
            "I pulled up 10 so far. This one rates 4 stars, its the Ac Hotel By Marriott Atlanta Buckhead At Phipps Plaza.",
            "This one gets 3 stars its the Ac Hotel By Marriott Atlanta Downtown",
            "Would you like to book a room there?",
            "How many days do you plan on being there?",
            "When would you be arriving?",
            "Here's what I've got you would like to reserve 1 room for 3 days in Atlanta at the Ac Hotel By Marriott Atlanta Downtown and you are arriving March 9th is that your desire?",
            "Your room is reserved.",
            "The room is $180 each night and they can be reached at +1 404-524-5555.",
            "Later, have a wonderful day."
        ]
    },
    {
        "dialogue_id": "20_00092",
        "service": "Travel_1",
        "service_call": {
            "method": {
                "method": "ReserveHotel",
                "parameters": {
                    "check_in_date": "2019-03-06",
                    "location": "Atlanta",
                    "number_of_rooms": "1",
                    "place_name": "Ac Hotel By Marriott Atlanta Downtown",
                    "stay_length": "3"
                }
            }
        },
        "user_utterance": [
            "Can you tell me about some attractions in Atlanta, GA that are good for kids?",
            "Alright, nice. I'm looking for a three star hotel there too.",
            "Can you tell me their phone number, and does the hotel allow smoking?",
            "Okay, cool. I'd like to book a room.",
            "I want to check in on Wednesday next week and I plan to stay for three day.",
            "Yes, that's all correct. Can you tell me the exact location and the cost per night?",
            "Thanks, you've been a lot of help. I don't need any further help."
        ],
        "system_utterance": [
            "Atlanta Botanical Garden is a Park you might enjoy.",
            "Ac Hotel By Marriott Atlanta Downtown is a hotel with 3 stars.",
            "You can call them at +1 404-524-5555. And the hotel does not allow smoking there.",
            "When do you want to check in and how many days will you be staying?",
            "I'll book you 1 room at Ac Hotel By Marriott Atlanta Downtown in Atlanta with a check in on March 6th and a stay for 3 days. Are all those details correct?",
            "I've booked the room. They are located at 101 Andrew Young International Boulevard Northwest. The cost is $216 per night.",
            "Okay, farewell and take care."
        ]
    },
    {
        "dialogue_id": "20_00093",
        "service": "Travel_1",
        "service_call": {
            "method": {
                "method": "ReserveHotel",
                "parameters": {
                    "check_in_date": "2019-03-03",
                    "location": "Seattle",
                    "number_of_rooms": "1",
                    "place_name": "Ace Hotel Seattle",
                    "stay_length": "7"
                }
            }
        },
        "user_utterance": [
            "Can you find me some attractions without any entry fee?",
            "Seattle.",
            "What's the phone number?",
            "Cool, can you find hotels there too.",
            "Sounds good make the reservation.",
            "The day after tomorrow.",
            "Seven days.",
            "Sounds good.",
            "Thank you for everything.",
            "Nope that's it."
        ],
        "system_utterance": [
            "Where should I search?",
            "You should check out the Museum Chihuly Garden and Glass.",
            "206-753-4940.",
            "I found 10 hotels. How about the Ace Hotel Seattle with 2 stars?",
            "When do you want to check in?",
            "How long should I make the reservation for.",
            "Please confirm the following: 1 room for 7 days at the Ace Hotel Seattle in Seattle with a check in on March 3rd.",
            "Your reservation was successful.",
            "Is there anything else I can assist with?",
            "Have a great day!"
        ]
    },
    {
        "dialogue_id": "20_00094",
        "service": "Travel_1",
        "service_call": {
            "method": {
                "method": "ReserveHotel",
                "parameters": {
                    "check_in_date": "2019-03-05",
                    "location": "Philadelphia",
                    "number_of_rooms": "1",
                    "place_name": "Aka University City",
                    "stay_length": "5"
                }
            }
        },
        "user_utterance": [
            "I'm looking for some attractions to visit.",
            "Look for attractions in Philly.",
            "That sounds great. I need to find a hotel there as well.",
            "That hotel sounds good.",
            "Yes, I do.",
            "I'm checking in on the 5th of March.",
            "I need one room for five days.",
            "Yes, that is right.",
            "Thank you, that is all I needed."
        ],
        "system_utterance": [
            "What location do you want to search?",
            "I found 10 attractions for you. How about the Tourist Attraction Art Museum Steps?",
            "There are 10 hotels nearby. How about the 3 star hotel Aka University City?",
            "Do you want to make a reservation?",
            "When are you checking in?",
            "How long will you be staying?",
            "Okay, I have a reservation for 1 room at the Aka University City in Philadelphia. You will be checking in on March 5th for 5 days, correct?",
            "I have confirmed the reservation.",
            "Have a great day."
        ]
    },
    {
        "dialogue_id": "20_00095",
        "service": "Travel_1",
        "service_call": {
            "method": {
                "method": "ReserveHotel",
                "parameters": {
                    "check_in_date": "2019-03-03",
                    "location": "Philadelphia",
                    "number_of_rooms": "1",
                    "place_name": "Aloft Philadelphia Downtown",
                    "stay_length": "7"
                }
            }
        },
        "user_utterance": [
            "Can you find me a place to visit?",
            "Search Philly.",
            "Is it free to enter? Can I bring my kids?",
            "Okay, glad to hear. Can you find me a hotel there as well?",
            "What about another hotel?",
            "And another hotel?",
            "Can I smoke there?",
            "What's the phone number?",
            "Okay, great. I'd like to reserve that hotel.",
            "For seven days, starting the day after tomorrow.",
            "That sounds right.",
            "Where are they located?",
            "Thanks. You've been such a great help. I need nothing more for now."
        ],
        "system_utterance": [
            "Where should I search?",
            "There's the Art Museum Steps tourist attraction.",
            "It's free and child friendly.",
            "There's the 3 star Aka University City.",
            "There's the 3 star Aloft Philadelphia Airport.",
            "There's the 3 star Aloft Philadelphia Downtown.",
            "Smoking is strictly forbidden.",
            "You can dial +1 215-607-2020.",
            "For how long?",
            "You want to book 1 room at Aloft Philadelphia Downtown in Philadelphia for 7 days, starting March 3rd?",
            "I've booked the hotel.",
            "At 101 North Broad Street.",
            "See you later. Have a great day!"
        ]
    },
    {
        "dialogue_id": "20_00096",
        "service": "Travel_1",
        "service_call": {
            "method": {
                "method": "ReserveHotel",
                "parameters": {
                    "check_in_date": "2019-03-01",
                    "location": "Toronto",
                    "number_of_rooms": "1",
                    "place_name": "Bisha Hotel Toronto",
                    "stay_length": "4"
                }
            }
        },
        "user_utterance": [
            "I'm looking for attractions to see.",
            "Look around Toronto, Ontario.",
            "Ok, that's neat. What else is there? Is there anything child-friendly without an entrance fee?",
            "Can you find me their contact number?",
            "Thanks! I also need to find 1 hotel room, smoking allowed.",
            "Okay, sounds great.",
            "Yes, let's go ahead and do that.",
            "I'd like to check in on the 1st of this month and stay for four days.",
            "Yes, that's perfect. Can I also get their phone number and street address?",
            "Thanks for all the help.",
            "No, that was it, thank you."
        ],
        "system_utterance": [
            "Where would you like me to look?",
            "There is a tourist attraction there called the 3D Toronto Sign.",
            "I found 10 possibilities. There is a place of worship called BAPS Shri Swaminarayan Mandir.",
            "Their phone number is 416-798-2277.",
            "There is a 4 star hotel called Bisha Hotel Toronto.",
            "Would you like to go ahead and reserve a room?",
            "When do you want your check in date to be? And how long do you want to stay there?",
            "Please confirm: You want to book 1 room at Bisha Hotel Toronto in Toronto on March 1st for a 4 day stay. Is that correct?",
            "Your reservation is complete. They are located at 80 Blue Jays Way and their contact number is +1 416-551-2800.",
            "Is there anything else I can assist you with?",
            "Enjoy!"
        ]
    },
    {
        "dialogue_id": "20_00097",
        "service": "Travel_1",
        "service_call": {
            "method": {
                "method": "ReserveHotel",
                "parameters": {
                    "check_in_date": "2019-03-07",
                    "location": "Los Angeles",
                    "number_of_rooms": "2",
                    "place_name": "Beverly Hills Marriott",
                    "stay_length": "3"
                }
            }
        },
        "user_utterance": [
            "Please show me some attractions to visit.",
            "Please look for attractions in LAX.",
            "Okay could you look for four -star hotels 2 rooms.",
            "That is good. I'd like to reserve the hotel.",
            "I would like to stay three days.",
            "I would like to check in Thursday next week.",
            "Sure that is good.",
            "Thanks for your help for now."
        ],
        "system_utterance": [
            "Where can I search for attractions?",
            "Please check out Angels Flight Railway a Historical Landmark.",
            "A 4 star hotel is called Beverly Hills Marriott.",
            "What is your length of stay?",
            "When will you plan to check in?",
            "Please confirm a hotel in Beverly Hills Marriott checking in March 7th for 3 days 2 rooms in Los Angeles.",
            "I booked the hotel successfully.",
            "Bye and have a nice day."
        ]
    },
    {
        "dialogue_id": "20_00098",
        "service": "Travel_1",
        "service_call": {
            "method": {
                "method": "ReserveHotel",
                "parameters": {
                    "check_in_date": "2019-03-02",
                    "location": "San Diego",
                    "number_of_rooms": "1",
                    "place_name": "Best Western Mission Bay",
                    "stay_length": "5"
                }
            }
        },
        "user_utterance": [
            "I'm going on a short trip with my boyfriend. Can you look up attractions for us to see?",
            "We'll be in San Diego.",
            "Cool, thanks. Can you also find a hotel for me? Just two stars is fine.",
            "Yeah, that sounds fine.",
            "Yes, can you make a reservation for 1 room for 5 days? I'll be checking in tomorrow.",
            "Yes, that's right.",
            "Great, thanks for all your help. That's all for now."
        ],
        "system_utterance": [
            "Sure, where at?",
            "Alright. If you're interested in visiting a Park, Balboa Park looks pretty good.",
            "Ok, I found 10 2 star hotels in that area. How about Best Western Mission Bay?",
            "Do you want to make a reservation?",
            "Sure. To confirm, you want to make a reservation for 1 room at the Best Western Mission Bay in San Diego for 5 days starting March 2nd. Is that right?",
            "Ok, I've made your reservation.",
            "No problem. Have a good day."
        ]
    },
    {
        "dialogue_id": "20_00099",
        "service": "Travel_1",
        "service_call": {
            "method": {
                "method": "ReserveHotel",
                "parameters": {
                    "check_in_date": "2019-03-08",
                    "location": "New York",
                    "number_of_rooms": "1",
                    "place_name": "1 Hotel Brooklyn Bridge",
                    "stay_length": "4"
                }
            }
        },
        "user_utterance": [
            "Can you tell me about attractions, such as place of interest, that I can go to? I also want it to be good for kids.",
            "I want to search in NY.",
            "Is there a number I can call them at? And what's the entrance fee?",
            "Alright, nice. What hotels are around there?",
            "That sounds like it'll work. Please book me a room with a check in on March 8th.",
            "I'll be there for four days.",
            "Yeah, that's good.",
            "Okay, thanks for all the help. I'm good for now."
        ],
        "system_utterance": [
            "Where would you like to search for the attractions?",
            "I've found 10 attractions you might like. There's Bethesda Terrace which is a Tourist Attraction.",
            "You can call them at 212-310-6600. There is no entrance fee, it is free.",
            "There's a 4 star hotel called 1 Hotel Brooklyn Bridge there.",
            "How many days will you be there?",
            "I'll book you 1 room at 1 Hotel Brooklyn Bridge in New York starting on March 8th for 4 days. Is that good with you?",
            "The hotel room is booked.",
            "Have a good day and take care!"
        ]
    },
    {
        "dialogue_id": "20_00100",
        "service": "Travel_1",
        "service_call": {
            "method": {
                "method": "ReserveHotel",
                "parameters": {
                    "check_in_date": "2019-03-08",
                    "location": "San Francisco",
                    "number_of_rooms": "2",
                    "place_name": "Beck'S Motor Lodge",
                    "stay_length": "4"
                }
            }
        },
        "user_utterance": [
            "I want to find some attractions that I can visit.",
            "I am interested in attractions in San Fran.",
            "Alright, nice. I also want to find a hotel in that area. The hotel I am looking for should be a two star one.",
            "That is good. I want to make a reservation for this hotel. I need two have two rooms in this hotel, and I will go there Friday next week.",
            "I will be staying at the hotel for four days.",
            "Yes, this one is good.",
            "I appreciate it, you have helped me a lot! That would be all."
        ],
        "system_utterance": [
            "Can you tell me where do you want me to look for the attractions?",
            "There are 10 attractions which you might like. How would you consider visiting Alcatraz, which is a Historical Landmark?",
            "A hotel I can suggest is Beck'S Motor Lodge, which is a 2 star hotel.",
            "Can you tell me how long are you planning to stay there?",
            "Can you please confirm that you want to have 2 rooms for 4 days at Beck'S Motor Lodge in San Francisco, and that you will go there on March 8th?",
            "Your requested booking has been made.",
            "Good bye, have a good time!"
        ]
    },
    {
        "dialogue_id": "20_00101",
        "service": "Travel_1",
        "service_call": {
            "method": {
                "method": "ReserveHotel",
                "parameters": {
                    "check_in_date": "2019-03-01",
                    "location": "Vancouver",
                    "number_of_rooms": "1",
                    "place_name": "Atrium Inn Vancouver",
                    "stay_length": "2"
                }
            }
        },
        "user_utterance": [
            "I want to find some attractions I can visit.",
            "I want the attraction to welcome children, and to be located in Vancouver BC. I do not mind the kind of attraction.",
            "Alright, is there some other attraction you can recommend?",
            "Alright, nice. I also want to find hotels which are in that area.",
            "Can you give me the phone number? Can you tell me if the smoking is allowed in the hotel?",
            "Seems good. I want to make a reservation at the hotel. I will be staying at the hotel for four days.",
            "I will be going at the hotel on the 2nd.",
            "That is not right, because I will go at the hotel today, and I will be staying there for 2 days.",
            "Yes, that is correct.",
            "Can you tell me how much it will cost me per night?",
            "Can you give me the street address of the hotel?",
            "I appreciate it, you have helped me a lot! That would be all!"
        ],
        "system_utterance": [
            "Can you tell me where you want me to look for the attractions?",
            "You might consider visiting Dr. Sun Yat-Sen Classical Chinese Garden, which is a Park.",
            "How would you consider visiting FlyOver Canada, which is a Theme Park?",
            "There are 10 hotels which you might like staying in. One of the hotels is the Atrium Inn Vancouver, which is a 3 star hotel.",
            "If you want to call them you can at +1 604-254-1000. Unfortunately, smoking is not allowed at the hotel.",
            "Can you tell me when you will go there?",
            "Can you please confirm that you want to book 1 room for 4 days at the Atrium Inn Vancouver hotel in Vancouver for March 2nd?",
            "Can you please confirm that you want to stay at the hotel for 2 days, and that you will be going there on March 1st?",
            "Your requested booking at the hotel has been made.",
            "Staying at this hotel will cost you $150 per night.",
            "The hotel can be found at the following address 2889 East Hastings Street.",
            "Good bye, and have a wonderful day!"
        ]
    },
    {
        "dialogue_id": "20_00102",
        "service": "Travel_1",
        "service_call": {
            "method": {
                "method": "ReserveHotel",
                "parameters": {
                    "check_in_date": "2019-03-01",
                    "location": "London",
                    "number_of_rooms": "1",
                    "place_name": "Abercorn House",
                    "stay_length": "6"
                }
            }
        },
        "user_utterance": [
            "I would like to find a historical spot in London, UK that is kid appropriate.",
            "Are there any other?",
            "Great. Can you find me a one star hotel in that area as well?",
            "Can you book me a room please. That one sounds good.",
            "I will be there 6 days.",
            "Checking in today.",
            "Yes. That's right.",
            "Where are they located?",
            "Thanks for everything.",
            "No. That's will be all."
        ],
        "system_utterance": [
            "30 St Mary Axe (The Gherkin) is a historical Landmark in the area.",
            "ArcelorMittal Orbit is another historical landmark.",
            "There are 10 options. Abercorn house is a 1 star hotel in the area.",
            "For how many days?",
            "What's your check in date?",
            "Please confirm you want me to book 1 room for 6 days at the Abercorn House on March 1st in London.",
            "Your room was successfully booked.",
            "They're at 28-30 Bute Gardens.",
            "Can I help you further?",
            "Okay. Have a great day. Goodbye."
        ]
    },
    {
        "dialogue_id": "20_00103",
        "service": "Travel_1",
        "service_call": {
            "method": {
                "method": "ReserveHotel",
                "parameters": {
                    "check_in_date": "2019-03-07",
                    "location": "Washington D.C.",
                    "number_of_rooms": "1",
                    "place_name": "Arc The.Hotel",
                    "stay_length": "5"
                }
            }
        },
        "user_utterance": [
            "can you find me somewhere fun to go",
            "please search in dc",
            "is this child-friendly",
            "what is their contact number",
            "ok can you also find me a hotel to stay in that area",
            "is this smoking allow and what is the price",
            "perfect, please reserve 1 room for me",
            "i want to stay for 6 days and check in on next monday",
            "no please change it to five days and checking in next thursday",
            "yes pleas. what is their address",
            "thank you thats all i need"
        ],
        "system_utterance": [
            "where should i saerch in",
            "would you like to go to a nature preserve called 56 signers of the declaration of independence memorial",
            "yes it is",
            "you can reach them at 202-426-6841",
            "what about arc the.hotel with a 3 star",
            "this is non smoking property and it is $87 per night",
            "when do you want to check in and how long are you staying",
            "please confirm your booking for 1 room with arc the.hotel in washington d.c. on march 4th for 6 days",
            "please confirm your changes to 5 days stay and check in on march 7th",
            "their address is 824 new hampshire avenue northwest, washington, district of columbia 20037, united states",
            "have a nice day"
        ]
    },
    {
        "dialogue_id": "20_00104",
        "service": "Travel_1",
        "service_call": {
            "method": {
                "method": "ReserveHotel",
                "parameters": {
                    "check_in_date": "2019-03-03",
                    "location": "Anaheim",
                    "number_of_rooms": "1",
                    "place_name": "Castle Inn & Suites",
                    "stay_length": "6"
                }
            }
        },
        "user_utterance": [
            "show some attractions",
            "Look in anaheim",
            "okay then thanks",
            "one star hotel",
            "sounds very good",
            "six days it seems",
            "the 3rd I think",
            "tell me the price",
            "thanks a lot"
        ],
        "system_utterance": [
            "where to look?",
            "angel stadium of anaheim sports venue",
            "anythingelse for you?",
            "castle inn & suites 1 star",
            "how long then?",
            "when will you check in?",
            "castle inn & suites march 3rd anaheim 6 days 1 room",
            "$40 a night",
            "bye bye now"
        ]
    },
    {
        "dialogue_id": "20_00105",
        "service": "Travel_1",
        "service_call": {
            "method": {
                "method": "ReserveHotel",
                "parameters": {
                    "check_in_date": "2019-03-07",
                    "location": "Los Angeles",
                    "number_of_rooms": "1",
                    "place_name": "Ac Hotel By Marriott Beverly Hills",
                    "stay_length": "5"
                }
            }
        },
        "user_utterance": [
            "Can you show me some attractions to visit in LAX? I'm most interested in a museum.",
            "Is that attraction free? Would you say it's child-friendly?",
            "Okay, thanks. What hotels are that area?",
            "Yes, that's good.",
            "Yes, please go ahead and do that.",
            "I want to check in on the 7th and stay for 5 days.",
            "Yes, that's right.",
            "Thanks, that's all that I needed."
        ],
        "system_utterance": [
            "You could check out the Autry Museum of the American West. That is a museum.",
            "Yes, it's free and it's a pretty nice place for kids.",
            "I have 10 hotels matching your request. There is a 2 star hotel called AC Hotel By Marriott Beverly Hills. Would you like that one?",
            "Would you like to reserve a room at the hotel now?",
            "How long will you be staying? When would you like to check in?",
            "Please confirm your details: You are reserving 1 room at the AC Hotel By Marriott Beverly Hills in Los Angeles. You're checking in on March 7th and you will be staying for 5 days.",
            "Your hotel has been booked.",
            "Have a good day."
        ]
    },
    {
        "dialogue_id": "20_00106",
        "service": "Travel_1",
        "service_call": {
            "method": {
                "method": "ReserveHotel",
                "parameters": {
                    "check_in_date": "2019-03-01",
                    "location": "San Francisco",
                    "number_of_rooms": "1",
                    "place_name": "Beck'S Motor Lodge",
                    "stay_length": "7"
                }
            }
        },
        "user_utterance": [
            "I'm interested in visiting attractions that are kid friendly.",
            "I'm interested in San Francisco attractions.",
            "Sounds neat.",
            "I want to search for hotels over there.",
            "What other hotels are there?",
            "Where's that located?",
            "How about other hotels?",
            "Can you tell me the address and the cost of a room per night?",
            "I like the sound of that.",
            "Yes, please book a room for 7 days with a check in of later today.",
            "Everything is correct. Does the hotel allow smoking? And what's a number I can call them at?",
            "Thank you for all the help.",
            "No, thanks again. You've been great."
        ],
        "system_utterance": [
            "What city are you interested in?",
            "There are 10 attractions you might like. There's the Historical Landmark Alcatraz Island that you can visit.",
            "Do you need help with anything else?",
            "Amsterdam Hostel San Francisco is a 1 star hotel.",
            "Argonaut Hotel is a 4 star hotel?",
            "It's located at 495 Jefferson Street.",
            "Beck'S Motor Lodge is a 2 star hotel.",
            "They are located at 2222 Market Street and it's $156 for a room per night.",
            "Do you want me to book a room.",
            "I'll book you 1 room for 7 days at Beck'S Motor Lodge in San Francisco with a check in on March 1st. Is everything correct?",
            "I've booked the room. There's no smoking at the hotel. You can call them at +1 415-621-8212.",
            "Do you need anything else?",
            "Have a good day and take care!"
        ]
    },
    {
        "dialogue_id": "20_00107",
        "service": "Travel_1",
        "service_call": {
            "method": {
                "method": "ReserveHotel",
                "parameters": {
                    "check_in_date": "2019-03-10",
                    "location": "Paris",
                    "number_of_rooms": "1",
                    "place_name": "Ac Hotel By Marriott Paris Porte Maillot",
                    "stay_length": "3"
                }
            }
        },
        "user_utterance": [
            "I want to go explore something new, help me find some attractions please.",
            "I really want to get out and experience Paris, France.",
            "Okay, that could work. Let's all find some hotels in the area. I know i'll be tired after all that site seeing.",
            "Sound perfect. Can you help me reserve a room for 3 days, I'll need to check in on March 10th please.",
            "You sure did. Find out the nightly price and I'll also need their phone number too.",
            "Great, that will be all for now."
        ],
        "system_utterance": [
            "Sure, I would love to help you. First, tell me where you would like to search?",
            "That sounds fantastic. I've got 10 suggestions for you. let me start by suggesting the American Church in Paris. This is a place of Worship, and is a very popular attraction.",
            "Sure thing, I did gather 10 options that meet your search criteria. May I suggest first, Ac Hotel By Marriott Paris Porte Maillot, this is a 4 star hotel.",
            "I can indeed help you. First, let's confirm I got this right. We will reserve 1 room for 3 days at Ac Hotel By Marriott Paris Porte Maillot in Paris on March 10th. Did I understand correctly?",
            "Great news, I was able to successfully book this room for you. The room will be $208 nightly and the number listed for the hotel is +33 1 84 82 49 09.",
            "Glad to help. Enjoy your day."
        ]
    },
    {
        "dialogue_id": "20_00108",
        "service": "Travel_1",
        "service_call": {
            "method": {
                "method": "ReserveHotel",
                "parameters": {
                    "check_in_date": "2019-03-02",
                    "location": "Chicago",
                    "number_of_rooms": "2",
                    "place_name": "Acme Hotel Company Chicago",
                    "stay_length": "6"
                }
            }
        },
        "user_utterance": [
            "Help me look for attractions I can go to in Chicago. I'm looking for a museum that kids can go to.",
            "What's the cost of entry?",
            "That's terrific. Help me find a hotel there, I'm going to need 2 rooms.",
            "Can people smoke at the hotel? And what's the phone number of the hotel?",
            "What other three star hotels are there?",
            "I like the sound of that. I'd like to book a room.",
            "I want to check in tomorrow and I'm going to stay for 6 days.",
            "Everything is correct.",
            "Thanks so much for all the help. I don't need any more help."
        ],
        "system_utterance": [
            "You might like the American Writers Museum, it's a Museum.",
            "It's free to go to.",
            "There are 10 hotels that match. Ac Hotel By Marriott Chicago Downtown is a 3 star hotel.",
            "There's no smoking at the hotel. The hotel's phone number is +1 312-981-6600.",
            "There are 9 matches. Acme Hotel Company Chicago is a 3 star hotel.",
            "What's your check in date and how long will you be there?",
            "I'll book you 2 rooms at Acme Hotel Company Chicago in Chicago for check in on March 2nd for 6 days. Is everything correct?",
            "I've booked you the rooms.",
            "Have a fine day and take care."
        ]
    },
    {
        "dialogue_id": "20_00109",
        "service": "Travel_1",
        "service_call": {
            "method": {
                "method": "ReserveHotel",
                "parameters": {
                    "check_in_date": "2019-03-05",
                    "location": "Las Vegas",
                    "number_of_rooms": "3",
                    "place_name": "Budget Suites Of America",
                    "stay_length": "5"
                }
            }
        },
        "user_utterance": [
            "I want you to find me some attractions I can visit. I am interested in attractions which do not have an entry fee, and are located in Las Vegas",
            "Nice, can you suggest some other attraction? I am interested for a mall.",
            "Does this attraction welcome children? Can you give me their phone number?",
            "Alright, fine. Can you find me some hotels in that area too? More specifically I am looking for a one star hotel.",
            "Can you give me the address of the hotel? Can you check if smoking is allowed in this hotel?",
            "Seems nice. I want to make a reservation for 2 days at this hotel.",
            "I will be going at the hotel on 11th of March.",
            "No it is not right, because I want to go to the hotel on the 5th.",
            "That is wrong, because I need to have three rooms, and I will stay at the hotel for 5 days.",
            "Alright, this is good. Can you tell me how much it will cost per night? Can you give me their phone number?",
            "I appreciate it, you have helped me a lot!",
            "Nothing. I appreciate it, you were quite helpful!"
        ],
        "system_utterance": [
            "There are 5 attractions which you might be interested in. You might consider visiting DISCOVERY Children's Museum, which is a Museum.",
            "There is 1 attraction which matches your request. How would you like visiting Fremont Street Experience, which is a Shopping Area?",
            "If you want to call them you can at 702-678-5600. From what I can tell, this attraction does not welcome children.",
            "A good 1 star hotel is Budget Suites of America.",
            "I am glad to say that the smoking is allowed in the hotel. The address of the hotel is 2219 North Rancho Drive.",
            "Can you tell me when will you be going there?",
            "Can you please confirm that you want to book 1 room for 2 days at the Budget Suites of America in Las Vegas, and that you will go there on March 11th?",
            "Can you please confirm that you want to stay at the hotel for 2 days, and that you will go there on March 5th?",
            "Can you please confirm that you want 3 rooms booked for you at the hotel, and that you want to stay for 5 days?",
            "Your requested rooms have been booked. If you want to call them you can at +1 702-638-1800. The room will cost you $93 per night.",
            "Is there something else you want me to help you with?",
            "Good bye! Have a good time!"
        ]
    }
]