[
    {
        "dialogue_id": "12_00000",
        "service": "RentalCars_1",
        "service_call": {
            "method": {
                "method": "ReserveCar",
                "parameters": {
                    "dropoff_date": "2019-03-02",
                    "pickup_date": "2019-03-01",
                    "pickup_location": "Canterbury Village",
                    "pickup_time": "15:00",
                    "type": "Standard"
                }
            }
        },
        "user_utterance": [
            "I'm looking to rent a car.",
            "I want the car at 3 pm from Concord.",
            "I'll get it later today and return it this Saturday.",
            "That'll work for me.",
            "Yeah, but let's do it later. I want to look for an apartment around there.",
            "I want three bed rooms.",
            "That place seems great. I want to visit it later today, so can you schedule that?",
            "Yeah, schedule it.",
            "Do they allow pets there, and what's their telephone number?",
            "Thanks so much. I also want to reserve that rental car we talked about.",
            "Yeah, that's what I want. How much is it in total?",
            "Thanks for all the help.",
            "No, thanks for helping me out."
        ],
        "system_utterance": [
            "What time do you want to pick up the car and where do you want to get it from?",
            "What date do you want to get it and what date do you want return it?",
            "There's a nice Standard Accord available at Canterbury Village that you can pick up on March 1st.",
            "Do you want me to reserve the car for you?",
            "How many bed rooms do you need?",
            "There's a very good apartment at City Walk Apartment Homes located at 1688 Clayton Road. It has 3 bed rooms, 2 bath, $3,550 per month.",
            "I'll schedule you a visit to City Walk Apartment Homes on March 1st?",
            "The visit has been scheduled.",
            "They don't allow pets there. Their telephone number is 925-671-3845.",
            "I'll reserve the Standard car at Canterbury Village for pick up at March 1st at 3 pm and drop off on March 2nd. Is that good for you?",
            "I've reserved you the car. It is $36 in total.",
            "Is there anything else I can do for you?",
            "Have a wonderful day."
        ]
    },
    {
        "dialogue_id": "12_00001",
        "service": "RentalCars_1",
        "service_call": {
            "method": {
                "method": "ReserveCar",
                "parameters": {
                    "dropoff_date": "2019-03-13",
                    "pickup_date": "2019-03-12",
                    "pickup_location": "Canterbury Village",
                    "pickup_time": "12:30",
                    "type": "Standard"
                }
            }
        },
        "user_utterance": [
            "i am searching for a rental intermediate car and i need it on March 7th at 5:15 pm",
            "I require to pick up the car from concord and i want it till 13th of March",
            "Is there anything more available? I need to pick up the car around half past 12 in the afternoon from March 12th",
            "Can i know the total cost?",
            "That is okay",
            "Now now and i have to find an apartment in that area now",
            "The apartment should have 2 bedrooms",
            "Can you search any other apartments for me?",
            "Is it a furnished apartment? Can i know its phone number?",
            "Yes, this is cool.",
            "I like to fix a visit to this apartment on march 12th.",
            "Okay, this is perfect. Can i know that, are they welcome pets.",
            "Thank you. Could you book a car you searched earlier?",
            "Okay, this is perfect.",
            "Thank you so much"
        ],
        "system_utterance": [
            "Which place you need to pick up the car and til which date you require the car?",
            "I have selected 6 cars of your likings. One among them is a Standard Camry car available to pick up Clayton Valley on March 7th",
            "There is a nice Standard Accord car available at Canterbury Village for picking up on March 12th",
            "Your total booking cost comes around $31",
            "You need to book the car?",
            "What number of bedrooms you need in the apartment?",
            "I have selcted 10 apartmenst of your choice. One among them is a good property called as Casa Pino Condos in 1580 Clayton Road # 1 which has 2 bedrooms and 2 baths. The apartment rent is $3,200 per month",
            "There is a nice property located at 1711 Detroit Avenue called Courtyard Apartments with 2 bed rooms and 2 baths. The rent is $2900 per month.",
            "925-686-6868 is the phone number and it is not furnished.",
            "Do you want to fix the visit to this apartment?",
            "Please give confirmation details: Your visit to Courtyard Apartments on march 12th is fixed",
            "Your visit to the apartment is fixed. They welcomw pets.",
            "Please give confirmation details:Your pick up from Canterbury Village on march 12th at 12:30 pm with standard car and drop-off date is march 13th.",
            "Your car has been booked.",
            "Have a nice day."
        ]
    },
    {
        "dialogue_id": "12_00002",
        "service": "RentalCars_1",
        "service_call": {
            "method": {
                "method": "ReserveCar",
                "parameters": {
                    "dropoff_date": "2019-03-10",
                    "pickup_date": "2019-03-06",
                    "pickup_location": "Canterbury Village",
                    "pickup_time": "18:30",
                    "type": "Compact"
                }
            }
        },
        "user_utterance": [
            "Hi, could you help me search for a spacious car please?",
            "Likely from the 7th of this month.",
            "I will need the car for pickup at Concord at around half past 6 in the evening till the 10th.",
            "Are there any alternatives? Could I have a small car for pickup on Wednesday next week instead?",
            "That is fine with me!",
            "Perhaps later, could you get me an apartment in that area first?",
            "Just 2 will do.",
            "That is great! Could you schedule me an appointment there please?",
            "Sorry, could I visit them on 7th of this month instead?",
            "Sure, may I know if pets are allowed at the property and how do I contact them?",
            "I see, could you make the reservation for the car now?",
            "Sure, how much does this cost me?",
            "Sure, that is all I need, thank you!"
        ],
        "system_utterance": [
            "Sure, when will you intend to use the car from?",
            "Sure, when, where and what time will you be using the car?",
            "Sure, there are 2 cars you may like, how about a Full-size CR-V located at Canterbury Village on March 7th for your pickup?",
            "Sure, how about a compact Cooper located at Canterbury Village on March 6th for your pickup?",
            "Would you like to make a reservation?",
            "Sure, how many bed rooms are you looking for?",
            "Sure, would you like to stay at Casa Pino Condos in 1580 Clayton Road # 1 with 2 bedrooms and 2 baths which will cost you $3,200 each month?",
            "Will you be visiting them on March 6th?",
            "Please confirm your visit to Casa Pino Condos on March 7th.",
            "Your visit has been scheduled. You can bring your pets to their premises and contact them at 925-827-3700.",
            "Sure, please confirm your reservation for a compact car at Canterbury Village from March 6th at 6:30 pm to March 10th.",
            "Your reservation has been made, which will cost you $112 in total.",
            "No worries, enjoy your trip!"
        ]
    },
    {
        "dialogue_id": "12_00003",
        "service": "RentalCars_1",
        "service_call": {
            "method": {
                "method": "ReserveCar",
                "parameters": {
                    "dropoff_date": "2019-03-07",
                    "pickup_date": "2019-03-03",
                    "pickup_location": "SFO International Airport",
                    "pickup_time": "10:30",
                    "type": "Standard"
                }
            }
        },
        "user_utterance": [
            "I need a car to drive, how about renting it?",
            "the place must be san francisco and the time is 10:30. I'll give it back on march 7th",
            "it's the 3rd",
            "I like but I need you to take care of something else right now, look for an apartment",
            "3 are more than enough",
            "do you also know their phone number?",
            "can you also verify is the apartment needs furniture and if I can bring my pet with me?",
            "then I really think I should move on and look for something different, find a place with two bathrooms",
            "this one is better than the other one, book a visit for me on the 3rd",
            "that's right",
            "check if I can bring a pet with me",
            "now it's time to book that car before it's too late",
            "excellent, everything is alright now",
            "thanks.",
            "no, I don't have any more needs"
        ],
        "system_utterance": [
            "it's a wonderful idea. where do you want it to be? do you know date and time for the rental to start?",
            "what's the first date you'll need it from?",
            "I've searched at the sfo international airport and there are 4 cars ready for you on march 3rd. How about an altima? it's a standard car.",
            "how many bedrooms do you need?",
            "then you have 10 apartments to chose from. On the property called baycrest there's an apartment with 3 bedrooms and 3 bathrooms. the location is 201 harrison street and the rent is $4,400 for every single month you live there",
            "yes I do and it's 415-543-1135",
            "pets are not welcome and the furniture is absent",
            "there's another property called buchanan park and I can show you 6 more options. the location is 1150 webster street and you'll have 3 bedrooms and 2 bathrooms by paying $3,750 every single month",
            "I'll do it only after you confirm me this: you asked me to book a visit to an aprtment in buchanan park on march 3rd",
            "you'll see it on the given date",
            "no you can't do that there",
            "confirm me the next details: you want a standard car from march 3rd at 10:30 am to march 7th. the car will wait for you at sfo international airport",
            "I can confirm you that the booking procedure has been successful",
            "ask me something else, I'm ready to satisfy your needs",
            "goodbye sir"
        ]
    },
    {
        "dialogue_id": "12_00004",
        "service": "RentalCars_1",
        "service_call": {
            "method": {
                "method": "ReserveCar",
                "parameters": {
                    "dropoff_date": "2019-03-09",
                    "pickup_date": "2019-03-07",
                    "pickup_location": "BART Station",
                    "pickup_time": "15:00",
                    "type": "Compact"
                }
            }
        },
        "user_utterance": [
            "I'd like to look for a a Compact car to rent.",
            "I want to get it on March 7th and return it on the 9th of March.",
            "I want to get it around the afternoon 3.",
            "I'd like to get it at Walnut Creek.",
            "How much will that cost in total?",
            "Okay, that's good. I also need to look for an apartment there.",
            "I need three bed room?",
            "Does the apartment come with furniture? And do they allow for pets?",
            "What other apartments are there? There should be three baths.",
            "That sounds very nice.",
            "Yes, please schedule that.",
            "No, I want to go there on the 9th of March.",
            "Yes, please schedule it. Is it a furnished apartment?",
            "Thanks so much. I want to rent that car from earlier.",
            "Yes, that's correct.",
            "Thanks so much for the help. I'll be going now."
        ],
        "system_utterance": [
            "When do you want to get the car and return it?",
            "And what time do you want to get it?",
            "And where would you like to pick the car up from?",
            "There are 5 cars that match. There's a nice Compact Bolt available for pick up at BART Station on March 7th.",
            "It is $58 in total.",
            "How many bed rooms do you need?",
            "There are 10 apartments that are good. There's a very good place at Affordable Housing Associates on 150 Sierra Drive. It has 3 bed rooms, 3 baths, and rent is $4,150 per month.",
            "The apartment does not come with furniture. They do not allow pets.",
            "There's a very good place at Archstone Walnut Creek on 1445 Treat Boulevard. It has 3 bed rooms, 3 baths, and rent is $4,150 per month.",
            "Do you want to visit the apartment?",
            "Do you want to go there on March 7th?",
            "I'll schedule a visit for you to Archstone Walnut Creek on March 9th, correct?",
            "I've scheduled the visit. It is not a furnished apartment.",
            "I'll reserve the Compact car for you for pick up at BART Station on March 7th at 3 pm and drop off on March 9th, is everything correct?",
            "I've reserved the car for you.",
            "Have a wonderful day!"
        ]
    },
    {
        "dialogue_id": "12_00005",
        "service": "RentalCars_1",
        "service_call": {
            "method": {
                "method": "ReserveCar",
                "parameters": {
                    "dropoff_date": "2019-03-02",
                    "pickup_date": "2019-03-01",
                    "pickup_location": "Central District",
                    "pickup_time": "16:30",
                    "type": "Standard"
                }
            }
        },
        "user_utterance": [
            "Please find me a rental car available for pick up from Fremont around morning 11:15. I'll be dropping it off on the 4th.",
            "I need the car later today, and therefore wish to pick it up around 4:30 in the evening.",
            "What other options do you have?",
            "How much will it cost in total?",
            "That won't work for me. Please find something I can keep until this Saturday.",
            "How much will it cost in total?",
            "That works for me. Please also search for apartments in that area.",
            "It should be a two bedrooms, one bath apartment.",
            "Is the apartment pet-friendly?",
            "Cool. That works for me.",
            "Sure, please book an appointment to see the property.",
            "That works for me.",
            "That's correct. Please get me the property's contact number and find out whether the apartment is furnished.",
            "Thank you very much. You've been very helpful. Please go ahead and reserve the car we found earlier.",
            "You got that right.",
            "Thank you very much. You've been very helpful. That will be all."
        ],
        "system_utterance": [
            "What time would you like to pick it up?",
            "How about a nice, Standard Accord, available for pickup on March 1st from Fremont BART Station?",
            "What do you think of the nice, Standard Altima, available for pickup on March 1st from Fremont BART Station?",
            "The total cost of your reservation is $96.",
            "Sure, no problem. Would you like the nice Standard Camry available for pick up at Central District on March 1st?",
            "The total cost of your reservation is $29.",
            "How many bedrooms should the apartment have?",
            "The very elegant Case Verde Apartment at 4101 Eggers Drive # 16 has 2 bedrooms, 1 bath apartments going for $2,700.",
            "I'm sorry, it doesn't welcome pets.",
            "Should I go ahead and book an appointment to see the property?",
            "Should I schedule the apartment visit for March 1st?",
            "Please confirm that you're booking an appointment to see Case Verde Apartment on March 1st.",
            "I have successfully booked your appointment to visit the apartment. You can reach them by phone at 510-796-4064, and it's an unfurnished apartment.",
            "Please confirm that you'd like to pick a Standard car from Central District on March 1st at 4:30 pm and drop it off on March March 2nd.",
            "I have successfully booked your car.",
            "Thank you, and do have yourself a wonderful day!"
        ]
    },
    {
        "dialogue_id": "12_00006",
        "service": "RentalCars_1",
        "service_call": {
            "method": {
                "method": "ReserveCar",
                "parameters": {
                    "dropoff_date": "2019-03-10",
                    "pickup_date": "2019-03-04",
                    "pickup_location": "Canterbury Village",
                    "pickup_time": "11:00",
                    "type": "Standard"
                }
            }
        },
        "user_utterance": [
            "Please help me find a rental car.",
            "I need it on 4th of this month at morning 11 until 10th of this month.",
            "I want a intermediate car and I want to pick it up from Concord.",
            "Good.",
            "Not now. Please help me find an apartment there.",
            "3 bed rooms.",
            "Yes, that one is good.",
            "Yes, please.",
            "No, on the 6th.",
            "Yes.",
            "Thanks, can you help me book the car you found earlier?",
            "Yes, how much is that?",
            "Thank you.",
            "No, thanks."
        ],
        "system_utterance": [
            "When and what time do you need it and until when you need the car?",
            "Where do you plan to pick it up?",
            "I found 4 cars and one is a Standard car available at Canterbury Village on March 4th and its a Accord.",
            "Will I reserve you the car now?",
            "How many bed rooms do you prefer?",
            "How about City Walk Apartment Homes at 1688 Clayton Road with 3 bed rooms and 2 baths for only $3,550 per month?",
            "Will I schedule you a visit to the property?",
            "Do you prefer visiting it on March 4th?",
            "Okay, you want to schedule a visit to City Walk Apartment Homes on March 6th. Please confirm.",
            "Your visit is now booked!",
            "Okay, you want to rent a Standard car and you will pick it up at Canterbury Village on March 4th at 11 am until March 10th. Please confirm.",
            "$186 in total. You car is now reserved!",
            "Anything else I can help you with?",
            "You are welcome!"
        ]
    },
    {
        "dialogue_id": "12_00007",
        "service": "RentalCars_1",
        "service_call": {
            "method": {
                "method": "ReserveCar",
                "parameters": {
                    "dropoff_date": "2019-03-12",
                    "pickup_date": "2019-03-10",
                    "pickup_location": "Canterbury Village",
                    "pickup_time": "13:30",
                    "type": "Standard"
                }
            }
        },
        "user_utterance": [
            "Could you please help me to find a rental car up to March 12th.",
            "I want to have the Concord car from the 10th of March. It has to pick up me around half past 1 in the afternoon.",
            "What is the total price?",
            "It is good.I wish to search for an apartment with two bed rooms.",
            "Is it furnished?",
            "whether they permit pets?",
            "It is good. I wish to Schedule a visit to the apartment on March 12th.",
            "It is nice.",
            "Thank you so much.",
            "It is nice.",
            "Thank you so much for your help.That is what I want."
        ],
        "system_utterance": [
            "In which place do you need to get picked up? When will you need it? Up to which date do you need the car?",
            "There is a nice Standard Accord car available at Canterbury Village on March 10th.",
            "The cost of reservation is $52",
            "Casa Pino Condos is a nice property situated at 1580 Clayton Road # 1. It has 2 bed rooms and 2 baths. The rent is $3,200 per month.",
            "It is fully furnished.",
            "Pets are permitted in the apartment.",
            "Kindly ensure that, your scheduling is done to visit Casa Pino Condos on March 12th.",
            "Your scheduling is done",
            "Kindly ensure that, There is a nice Standard Accord car available at Canterbury Village on March 10th at 1:30 pm. The drop off date is March 12th.",
            "Your car is booked.",
            "Have a nice day."
        ]
    },
    {
        "dialogue_id": "12_00008",
        "service": "RentalCars_1",
        "service_call": {
            "method": {
                "method": "ReserveCar",
                "parameters": {
                    "dropoff_date": "2019-03-05",
                    "pickup_date": "2019-03-03",
                    "pickup_location": "Fremont BART Station",
                    "pickup_time": "13:30",
                    "type": "Compact"
                }
            }
        },
        "user_utterance": [
            "Find for me a rental car in Fremont because I need a car from this Sunday till 5th of this month.",
            "Around 14:30 I want to pick it up.",
            "Anything else available you have?I want a small car to pick up around afternoon 1:30.",
            "Sounds very good.",
            "Find for me an apartment in that area with three bed rooms.",
            "Tell me their contact number.",
            "Other apartments you can find me with two baths?",
            "Something else with three baths.",
            "Is very good.I want to schedule a visit to an apartment on this Sunday.",
            "Yes that sounds very good.",
            "Book please for me the car that we have found earlier.",
            "Is perfect for me.Tell me the total cost.",
            "Thanks.That;s all that I wanted for now."
        ],
        "system_utterance": [
            "Tell me at what time you will need it?",
            "I have 6 options for you that you may like.Is a nice Standard Accord available at Fremont BART Station available for pick up on March 3rd.",
            "A nice Compact Bolt car is available for pick up on March 3rd at Fremont BART Station.",
            "With something else I can help you?",
            "I have 10 nice options for you.A very good property with 3 bed rooms and 2 baths is Alborada Apartments located at 1001 Beethoven Common.Rent per month is $3,900.",
            "510-797-1800 is the contact number.",
            "A very good property is Amber Court with 3 bed rooms and 2 baths located at 34050 Westchester Terrace.Cost per month $3,500.",
            "I have 9 nice apartment.A nice apartment is Carrington Apartments with 3 bed rooms and 3 baths located at 38900 Blacow Road.Cost per month is $4,350.",
            "You are scheduling a visit to Carrington Apartments in March 3rd.I'm right?",
            "Visit to the apartment is scheduled.",
            "You want to pick up a Compact car from Fremont BART Station.The pick up will be in March 3rd at 1:30 pm and the drop-off on March 5th.Is that correct?",
            "The car is reserved.In total your reservations cost $50.",
            "Have a nice day!"
        ]
    },
    {
        "dialogue_id": "12_00009",
        "service": "RentalCars_1",
        "service_call": {
            "method": {
                "method": "ReserveCar",
                "parameters": {
                    "dropoff_date": "2019-03-08",
                    "pickup_date": "2019-03-05",
                    "pickup_location": "Fremont BART Station",
                    "pickup_time": "19:30",
                    "type": "Standard"
                }
            }
        },
        "user_utterance": [
            "for some personal reasons, I need to rent a car from next tuesday at half past 7 in the evening",
            "the last day is next friday",
            "I want it to be in fremont",
            "first, I want you to tell me the price for it",
            "It's fair",
            "yes, I should but not at the moment",
            "you could find me an apartment in fremont with 1 bathroom and completely furnished",
            "yes and it's 2",
            "it has the characteristics I look for, book a visit and I'll see it for myself",
            "the date you picked is okay for me",
            "yup. see if pets are not a problem",
            "pass me their phone number",
            "do you still remember the car you found for me a moment ago? Now it's the right time to book it",
            "it's exactly what we discussed earlier",
            "you've been of a great help",
            "no I don't, go now"
        ],
        "system_utterance": [
            "you just have to tell me for how long you're going to need it",
            "where do you need your car to be?",
            "according to your instructions, there are 4 available car on march 5th at fremont bart station. how about a standard car, something like an accord?",
            "it's $93",
            "maybe, you should think about reserving it",
            "what may I do then?",
            "have you thought about the number of bedrooms you'll need?",
            "we can discuss about 4 places. if you go to 41342 roberts avenue, you'll find the granada apartments property and it has 2 bedrooms like you requested and 1 bathroom. it will cost you $2,750 every single month",
            "are you free to visit it on march 5th?",
            "let's recap the booking procedure. you want to visit the granada apartments property on march 5th",
            "your visit is confirmed. Pets are not a problem for this property",
            "it's 510-657-9766",
            "I still have in my memory those data, confirm them. you want to rent a standard car from march 5th at 7:30 pm untill march 8th. the car is located at fremont bart station",
            "you got your car",
            "my pleasure. do you still need my services?",
            "see you next time"
        ]
    },
    {
        "dialogue_id": "12_00010",
        "service": "RentalCars_1",
        "service_call": {
            "method": {
                "method": "ReserveCar",
                "parameters": {
                    "dropoff_date": "2019-03-11",
                    "pickup_date": "2019-03-08",
                    "pickup_location": "Fremont BART Station",
                    "pickup_time": "13:30",
                    "type": "Standard"
                }
            }
        },
        "user_utterance": [
            "I need a car on rent. Can you help me?",
            "I need the car around 1:30 in the afternoon on the 8th. I have to use it till March 11th",
            "Make it available at Fremont.",
            "Good. Now please look for an apartment there.",
            "I am looking for 3 bed rooms.",
            "Do you know whether it is furnished.",
            "Can I take pets in>",
            "Are there any other apartments?",
            "I think that will do.",
            "Yes, make a visit date.",
            "Please schedule it on March 11th.",
            "Ok, Please give their phone number. It is furnished?",
            "No, now please book the car we selected.",
            "Good, how much will be the cost?",
            "Thanks for great help."
        ],
        "system_utterance": [
            "Please tell me about the time and date of renting the car? How long will you use it?",
            "From where you will take it?",
            "You have 1 nice car, an Accord. Its a standard car. You can pick it up from Fremont BART Station on March 8th.",
            "Do you have any idea about number of rooms you needed?",
            "Then Alborada Apartments is right one located at 1001 Beethoven Common. It is with 3 bed rooms and 2 baths. the rent will be $3,900 per month.",
            "No, it is not furnished.",
            "Yes, you can take.",
            "Another suitable one is Amber Court at 34050 Westchester Terrace which is with 3 bed rooms and 2 bath. You have to pay $3500 per month as rent.",
            "Do you like to call at there?",
            "Are you available on March 8th?",
            "Please confirm, you are visiting Amber Court on March 11th.",
            "It is not furnished. You can contact them at 510-794-9981. Your appointment is fixed.",
            "Please confirm the details; you need a Standard car on March 8th at 1:30 pm from Fremont BART Station. You will drop it off on March 11th.",
            "You have to pay $81 as total cost. Congratulations, your car is reserved.",
            "Have a wonderful day."
        ]
    },
    {
        "dialogue_id": "12_00011",
        "service": "RentalCars_1",
        "service_call": {
            "method": {
                "method": "ReserveCar",
                "parameters": {
                    "dropoff_date": "2019-03-07",
                    "pickup_date": "2019-03-04",
                    "pickup_location": "Canterbury Village",
                    "pickup_time": "15:30",
                    "type": "Compact"
                }
            }
        },
        "user_utterance": [
            "Help me find a Compact car to rent. I'd like to pick it up at half past 3 in the afternoon and use it until the 7th of this month.",
            "I want to pick it up on Monday next week from Concord.",
            "What else is there?",
            "How much is the total for the car?",
            "Okay, I like that. Now I need to find an apartment there.",
            "I need three bed rooms.",
            "Okay, that will work. I want to visit them.",
            "Yes, that would be ideal.",
            "Yes, that's right.",
            "Thanks. Now about that car from earlier, I want to reserve it.",
            "Yes, that's correct.",
            "Thanks for all the help. I'll be going now."
        ],
        "system_utterance": [
            "What date do you want to pick it up and where would you like it to be?",
            "There are 5 cars that match. There's a nice Compact Bolt that's available for pick up at Canterbury Village on March 4th.",
            "There's a nice Compact Cooper that's available for pick up at Canterbury Village on March 4th.",
            "The total cor the car is $93.",
            "How many bed rooms do you need?",
            "I found 10 matches. There's a good property at City Walk Apartment Homes on 1688 Clayton Road. It has 3 bed rooms, 2 baths, and the rent is $3,550 per month.",
            "Would you like to visit them on March 4th?",
            "I'll schedule a visit for you to City Walk Apartment Homes on March 4th, is that right?",
            "The visit has been scheduled.",
            "I'll reserve the Compact car at Canterbury Village for pick up on March 4th at 3:30 pm and drop off on March 7th, correct?",
            "I've reserved the car for you.",
            "Have a terrific day!"
        ]
    },
    {
        "dialogue_id": "12_00012",
        "service": "RentalCars_1",
        "service_call": {
            "method": {
                "method": "ReserveCar",
                "parameters": {
                    "dropoff_date": "2019-03-06",
                    "pickup_date": "2019-03-04",
                    "pickup_location": "SJC International Airport",
                    "pickup_time": "18:00",
                    "type": "Standard"
                }
            }
        },
        "user_utterance": [
            "san jose intermediate car wednesday next week",
            "18:00 works for me",
            "next monday works",
            "what total cost?",
            "that works for me",
            "I want the apartment",
            "three bedrooms",
            "tell me number",
            "Yes that works",
            "yes that works",
            "yes that works",
            "can you book it?",
            "yes that works",
            "thanks a lot"
        ],
        "system_utterance": [
            "what time then?",
            "when do you want it?",
            "sjc international airport march 4th standard camry",
            "$72 in total",
            "wanna get the car?",
            "how many rooms?",
            "10 apartments 888 golden saratoga-cupertino apartment homes 1546 maurice lane $4,450 3 rooms 3 baths",
            "408-818-0710",
            "march 4th then",
            "888 golden saratoga-cupertino apartment homes march 4th",
            "it was scheduled",
            "sjc international airport march 4th standard car march 6th 6 pm",
            "it is reserved",
            "bye now thanks"
        ]
    },
    {
        "dialogue_id": "12_00013",
        "service": "RentalCars_1",
        "service_call": {
            "method": {
                "method": "ReserveCar",
                "parameters": {
                    "dropoff_date": "2019-03-12",
                    "pickup_date": "2019-03-07",
                    "pickup_location": "SFO International Airport",
                    "pickup_time": "16:30",
                    "type": "Standard"
                }
            }
        },
        "user_utterance": [
            "I need a car to rent till the 12th",
            "I need in SFO",
            "I want to rent it from the 7th",
            "I prefer around 16:30",
            "Yes, It's good for me",
            "Not now, thanks.",
            "Yes, I want an apartment there",
            "I need an apartment with 3 baths and 3 bed rooms",
            "It's very good! I want to visit the apartment",
            "No, I prefer on 11th of this month",
            "Yes, it is. Can I bring pets into the apartment?",
            "I want to book the car",
            "Yes, I confirm. You can book",
            "Thank you very much!",
            "No, It's all. Thanks"
        ],
        "system_utterance": [
            "In which city do you want to rent it?",
            "What day do you want to rent a car?",
            "What time do you prefer to pick it up?",
            "I found a Standard car, a Altima, at SFO International Airport available on March 7th",
            "Do you want to book it now?",
            "Do you need anything else?",
            "Whith how many bed rooms?",
            "There's Baycrest at 201 Harrison Street, with 3 bed rooms and 3 baths. The rental costs is $4,400 per month",
            "Do you want to schedule a visit on March 7th?",
            "A visit to Baycrest on March 11th. Is it correct?",
            "Your visit is confirmed! Unfortunately, pets are not allowed.",
            "A Standard car from SFO International Airport on March 7th at 4:30 pm, till March 12th. Do you confirm?",
            "Your car is booked!",
            "Can I do anything else for you?",
            "Have a good day"
        ]
    },
    {
        "dialogue_id": "12_00014",
        "service": "RentalCars_1",
        "service_call": {
            "method": {
                "method": "ReserveCar",
                "parameters": {
                    "dropoff_date": "2019-03-13",
                    "pickup_date": "2019-03-09",
                    "pickup_location": "Clayton Valley",
                    "pickup_time": "10:00",
                    "type": "Standard"
                }
            }
        },
        "user_utterance": [
            "I need to rent a car.",
            "From the 9th of march.",
            "Around morning 10.",
            "I want to pick it up in concord on the 13th.",
            "How much does it cost in all?",
            "Is there any other car available?",
            "That would be fine. I would need a 2 bedroom apartment to stay in when I get there.",
            "May I have the number for there?",
            "Are pets allowed in the apartment and is it furnished?",
            "I want to schedule a visit of that apartment.",
            "I want to go there on the 12th of this month.",
            "That would be great.",
            "I am ready to rent the sentra.",
            "That would be fine.",
            "Thanks. That would be all."
        ],
        "system_utterance": [
            "When would you like it?",
            "For what time?",
            "Where would you like to pick it up and what time would you need it till?",
            "There is a lovely standard camry card available for pick up at clayton valley on March 9th.",
            "That would be $116 in all.",
            "There is a lovely standard sentra card available for pick up at clayton valley on March 9th.",
            "I have found 10 suitable apartments. There is one called casa pino condos at 1580 clayton road # 1. It has 2 bedrooms and 2 baths and costs $3,200 a month.",
            "The number is 925-827-3700.",
            "Pets are allowed and the apartment is furnished.",
            "Would march 9th be convenient?",
            "You would like to visit casa pino condos on march 12th?",
            "I have scheduled the visit.",
            "You would like to pick up a standard car in clayton valley from march 9th at 10 am and return it on march 13th.",
            "I have reserved the car for you.",
            "Enjoy your day."
        ]
    },
    {
        "dialogue_id": "12_00015",
        "service": "RentalCars_1",
        "service_call": {
            "method": {
                "method": "ReserveCar",
                "parameters": {
                    "dropoff_date": "2019-03-09",
                    "pickup_date": "2019-03-08",
                    "pickup_location": "Fremont BART Station",
                    "pickup_time": "16:30",
                    "type": "Full-size"
                }
            }
        },
        "user_utterance": [
            "I want to find a car for rent and I need the same from Fremont. Can you search for the one which is a full-size car for me?",
            "Book it for pickup around 4:30 pm and up to 9th of March.",
            "Book it from 8th of this month.",
            "Yes, that is okay. Thanks.",
            "I want to book this car bot not now. I will decide it later.",
            "I want to find some nice apartments there and I need your help to get the one that suits my requirements.",
            "I need two bed rooms apartment.",
            "I want to know some other details of that apartment. Can you check whether this is fully furnished and they will allow pets there?",
            "It's Okay and I prefer this one. Can you book an appointment to visit that apartment on 9th of March?",
            "That is correct to proceed.",
            "Thanks, now I want to go with the booking of car that you have found for me before.",
            "That is confirmed to proceed.",
            "Thanks and that's all."
        ],
        "system_utterance": [
            "Yes, What is your convenient time to pickup the car and let me know to which date you need to book the car for?",
            "From which date you want the car for rent?",
            "Got 5 cars details. What about the one which is a Escape full-size car available for pickup at Fremont BART Station on March 8th? Is that okay to you?",
            "Shall I book this now.?",
            "How can I help you further?",
            "What bout your requirement of number of bedrooms in that apartment.",
            "Found 10 apartments. What about the one in Americana Apartments located at 4445 Stevenson Boulevard with 2 bed rooms and 2 bath rooms for the rent $2,800 per month.",
            "Yes, they welcome pets and sorry it is not furnished.",
            "Yes, please confirm to book an appointment to visit the property at Americana Apartments on March 9th.",
            "I have successfully confirmed the appointment to visit that property.",
            "Please confirm to book a full-size car for pickup at Fremont BART Station from March 8th to March 9th for the pickup time 4:30 pm.",
            "I have successfully booked the car as per your requirements.",
            "Have a good day."
        ]
    },
    {
        "dialogue_id": "12_00016",
        "service": "RentalCars_1",
        "service_call": {
            "method": {
                "method": "ReserveCar",
                "parameters": {
                    "dropoff_date": "2019-03-13",
                    "pickup_date": "2019-03-11",
                    "pickup_location": "SFO International Airport",
                    "pickup_time": "13:30",
                    "type": "Standard"
                }
            }
        },
        "user_utterance": [
            "on the 13th of march I'll a car to drive",
            "the city must be san francisco and the time is 13:30 circa. the first day I'll need it is the 11th of march",
            "you missed to include the price for it",
            "fantastic",
            "I can't answer now, first things first, so, look for an apartment",
            "you're always right, the apartment must have 2 bedrooms",
            "it can be suitable",
            "once again, you're right, scheduled it on 11th of march",
            "yes, I need that apartment",
            "now it's the turn of the car we talked about, I need that reservation",
            "it is my initial plan",
            "that's wonderful",
            "no, I'm done. so long."
        ],
        "system_utterance": [
            "answer to these 2 questions: when and where do you want it?",
            "I have verified that if you go to sfo international airport on march 11th you can drive a standard car, a altima.",
            "it's $68",
            "you want it or not?",
            "if you tell me how many bedrooms you need, my research will be more useful to you",
            "the number of apartments good for you I managed to find is 5. if you go to 1227 hampshire street you can visit the betel apartments property. there's this apartments that comes with 2 bedrooms and 1 bathroom. rent is $2,400 every month",
            "if you want to know it for sure, you must be willing to pay a visit",
            "confirm me the requested procedure. you are looking for an apartment and you wish to visit betel apartments on march 11th",
            "you will visit it on the given date and you'll decide what to do",
            "we must recap the booking again to be sure not to make any mistake. you need a standard car from march 11th at 1:30 pm until march 13th. you'll find the car waiting for you at the sfo international airport",
            "you can count for your car to be there.",
            "I can still assist you with something else, if you like.",
            "talk to you next time"
        ]
    },
    {
        "dialogue_id": "12_00017",
        "service": "RentalCars_1",
        "service_call": {
            "method": {
                "method": "ReserveCar",
                "parameters": {
                    "dropoff_date": "2019-03-04",
                    "pickup_date": "2019-03-03",
                    "pickup_location": "Clayton Valley",
                    "pickup_time": "12:30",
                    "type": "Standard"
                }
            }
        },
        "user_utterance": [
            "Find for me a rental car.I will pick it up around 12:30 in the afternoon from Concord.",
            "From 3rd of this month till Monday next week.",
            "Other option you can find?",
            "Tell me the total cost.",
            "Sounds very good.Find me an apartment in that area.",
            "I want to be with 4 bed rooms.",
            "Perfect.I want to schedule a visit to this apartment.",
            "On Monday next week I want to be the visit.",
            "No.Make it please on 3rd of this month.",
            "Yes is perfect.I also need to know if pets is allowed and if the apartment is furnished.",
            "Thanks.Buy the car that you fund earlier please.",
            "Yes is very good.",
            "Thanks for all.",
            "No.Thank you very much."
        ],
        "system_utterance": [
            "Tell me till what date do you want the car and when do you want it from.",
            "I have for you 8 options that you may like.One is a nice Standard card Accord available for pick up on March 3rd from Canterbury Village.",
            "A nice Standard car Camry available for pick up on March 3rd from Clayton Valley.",
            "The reservation in total is $32.",
            "You want the apartment to be with how many bedrooms?",
            "I have 10 option for you.A very good property is Casa Pino Condos located at 1580 Clayton Road # 1 with 4 bed rooms and 3 baths.Rent per month cost $4,800.",
            "Would be okay for you in March 3rd?",
            "Confirm me please.You want to schedule a visit to Casa Pino Condos on March 4th?",
            "A schedule to visit Casa Pino Condos on March 3rd.Is that correct?",
            "The visit to apartment is scheduled.Pets are welcome and apartment is furnished.",
            "The pick up for a Standard car will be from Clayton Valley on March 3rd at 12:30 pm and the drop-of date will be in March 4th.Is that okay for you?",
            "The car is reserved.",
            "With something else I can help you?",
            "Have a nice day!"
        ]
    },
    {
        "dialogue_id": "12_00018",
        "service": "RentalCars_1",
        "service_call": {
            "method": {
                "method": "ReserveCar",
                "parameters": {
                    "dropoff_date": "2019-03-07",
                    "pickup_date": "2019-03-02",
                    "pickup_location": "Fremont BART Station",
                    "pickup_time": "14:00",
                    "type": "Standard"
                }
            }
        },
        "user_utterance": [
            "I would like to pick up a rental car in fremont and use it till next thursday.",
            "I would need it for 2 pm on March 2nd.",
            "I do not like that car. Can you find me something else?",
            "How much would it cost in all?",
            "Great. I would need a three bedroom and 2 baths apartment to stay in when I get there.",
            "Is it furnished? What is the contact number to reach there?",
            "Great. I would like to visit the apartment on the 5th of march.",
            "Yes, I do. Are pets allowed there?",
            "Thanks. I want to rent the cruze.",
            "Yes, that's correct.",
            "Thanks. That would be all."
        ],
        "system_utterance": [
            "What time would you need it for and what date?",
            "There is a lovely standard accord available for pick up at fremont BART station on march 2nd.",
            "There is a lovely standard cruze available for pick up at fremont BART station on march 2nd.",
            "That would be $115 in all.",
            "I have found 10 lovely apartments. There is one on 1001 beethoven common called alborada apartments. It has 3 bedrooms and 2 baths and the rent is $3,900 monthly.",
            "The number is 510-797-1800 and it is not furnished.",
            "You would like to visit alborada apartments on march 5th?",
            "The visit has been scheduled and yes, pets are allowed.",
            "You would like to pick up at standard car at fremont BART station on march 2nd at 2 pm and return it on March 7th?",
            "The car has been reserved.",
            "Enjoy your day."
        ]
    },
    {
        "dialogue_id": "12_00019",
        "service": "RentalCars_1",
        "service_call": {
            "method": {
                "method": "ReserveCar",
                "parameters": {
                    "dropoff_date": "2019-03-02",
                    "pickup_date": "2019-03-01",
                    "pickup_location": "SFO International Airport",
                    "pickup_time": "10:30",
                    "type": "Full-size"
                }
            }
        },
        "user_utterance": [
            "Hello, Please can you find me a car to rent?",
            "I need the car till the 2nd.",
            "I will need the car from 1st of this month and I'll be able to pick up the car from San Fran at 11:15 am.",
            "Do you have any other car for I wish to have a Full-size car and I'll be able to pick it up at 10:30.",
            "Please may I know what would be the total for the rental?",
            "Sounds good.",
            "Not right now, but might be later on. Please can you help me to find a 4 bed room apartment?",
            "Okay. Is it pet-friendly?",
            "Please can you find me some other apartment?",
            "Thanks, sounds good.",
            "Yup, Please can you schedule an appointment to visit here?",
            "Nope, please can you make it for the 2nd.",
            "Nope, I wish to visit on the 1st of this month.",
            "Yup. Is the apartment a furnished one?",
            "Do they allow pets?",
            "Thanks much. Please can you get back and book the car?",
            "Yup, that sounds great.",
            "Thanks much for the help.",
            "Nope, thanks much for the help."
        ],
        "system_utterance": [
            "Sure, when do you need?",
            "Okay! When and at what time you need the car? Where do you wish to pick up the car?",
            "Okay! There is a Standard car, Altima is available for pick up from SFO International Airport on March 1st.",
            "Okay! I've 1 car for you, an Escape, a Full-size car which is available for pick up on March 1st at SFO International Airport. do you wish to have this car?",
            "Sure, it would be $44 in total.",
            "So, do you wish to book this car?",
            "Sure. Do you wish to visit the Baycrest property located at 201 Harrison Street for it has 4 bed rooms and 3 baths. The monthly rental will be $4,800 in total.",
            "Sorry, pets are not allowed.",
            "Sure, do you wish to look into Buchanan Park located at 1150 Webster Street for it has 4 bed rooms and 3 baths. The monthly rental will be $4,850.",
            "Do you want me to help you with anything else?",
            "Sure, can I schedule it on March 1st?",
            "Sure, Please can you confirm me that you wish to schedule the property visit on March 2nd to Buchanan Park, right?",
            "Okay, sounds good. Please can you confirm me that you wish to schedule an appointment to Buchanan Park on March 1st, right?",
            "Nope. it's not. Okay! your visit to the apartment is scheduled.",
            "Nope, they dont.",
            "Sure. Please can you confirm me that you wish to rent a Full-size car on March 1st at 10:30 am at SFO International Airport and you will drop the car at March 2nd, right?",
            "Okay! your car has been booked.",
            "Do you want me to assist you with anything else?",
            "Have a wonderful day."
        ]
    },
    {
        "dialogue_id": "12_00020",
        "service": "RentalCars_1",
        "service_call": {
            "method": {
                "method": "ReserveCar",
                "parameters": {
                    "dropoff_date": "2019-03-04",
                    "pickup_date": "2019-03-02",
                    "pickup_location": "SJC International Airport",
                    "pickup_time": "15:00",
                    "type": "Standard"
                }
            }
        },
        "user_utterance": [
            "Find for me please a rental car.",
            "Around three pm will be the pick up from San Jose and I will need it until 4th of March.",
            "From March 2nd .",
            "Sounds very good.I also need to find an apartment with 3 baths and four bed rooms in that area.",
            "This sounds very good.",
            "Yes I want to be on March 2nd.",
            "Sounds good.Tell me the phone number and if the apartment is furnished.",
            "Book for me the car that you have found.",
            "Sounds very good.",
            "Tell me the total cost please.",
            "Thank you very much.",
            "No.Thank you."
        ],
        "system_utterance": [
            "Tell me where you want to pick it up and at what time you need it.Till what date do you want the car?",
            "Tell me when do you want it from.",
            "A nice Standard Camry car is available for pick uo on March 2nd at SJC International Airport.",
            "I have 10 nice apartments for you.A very good property located at 947 Branham Lane # C is Almaden Garden Apartments.Have 4 bed rooms and 3 baths and rental per month is $5,150.",
            "You want to schedule a visit?",
            "You want to achedule a visit ti Almaden Garden Apartments on March 2nd.",
            "Visit is scheduled.408-265-4808 is the phone number apartment.The apartment is not furnished unfortunately",
            "You want a Standard car to pick it up from SJC International Airport.The pick up will be at 3 pm on March 2nd and the drop-off on March 4th.",
            "The car is reserved.",
            "Cost for car is $66.",
            "With something else I can help you?",
            "Have a good day!"
        ]
    },
    {
        "dialogue_id": "12_00021",
        "service": "RentalCars_1",
        "service_call": {
            "method": {
                "method": "ReserveCar",
                "parameters": {
                    "dropoff_date": "2019-03-08",
                    "pickup_date": "2019-03-01",
                    "pickup_location": "Canterbury Village",
                    "pickup_time": "12:30",
                    "type": "Compact"
                }
            }
        },
        "user_utterance": [
            "I want to find a car for rent and I need your help to get the suitable one.",
            "Book the car for pickup from Concord on 1st of this month and at 12:30 pm.",
            "Book it up to next Friday.",
            "Search for some other cars. A small size car is enough to me.",
            "No, please search for something else.",
            "I want to know the total cost for this ride to decide.",
            "Yes, that is okay. Thanks.",
            "Not now, may be later. Can you find a nice apartment in that area for me?",
            "I need an apartment with 4 bed rooms. Search for the suitable one.",
            "Can I get their phone number for my reference? Also I want to check whether they allow pets there or not?",
            "Yes, I select this apartment based on the details you have given to me. Thanks for the same.",
            "Yes, do it for me now.",
            "That is correct, you can proceed now.",
            "Yes, confirmed to proceed.",
            "Thanks. Now, we will book the car that you have found for me.",
            "Its correct. continue.",
            "Thanks and that's all for now."
        ],
        "system_utterance": [
            "What is your convenient time, date and place to pick up the car for rent?",
            "To which date you want me to book the car?",
            "What about your opinion on a standard Corolla car available for pickup at Canterbury Village on March 1st?",
            "Got 2 results. What about the one which is a Compact Cooper car available for pick up at Canterbury Village on March 1st? Is that the convenient one you think?",
            "One more car which is Compact Golf model and the same is available for pick up at Canterbury Village on March 1st. What is your opinion on this?",
            "It will cost around $168 in total, Is this amount is adjustable one?",
            "Shall I book this car now?",
            "Yes, what about your required number of bed rooms that you want to have in that apartment?",
            "What about the property name Casa Pino Condos at 1580 Clayton Road # 1 ? which has 4 bed rooms and 3 baths for the rent $4,800 per month.",
            "They welcome pets and their phone number is 925-827-3700. Hope all this details are useful to you to select your choice.",
            "That's nice to hear. Shall I book this apartment now?",
            "Can you confirm to book the same on March 1st?",
            "Please confirm to book an appointment to visit Casa Pino Condos apartment on March 1st.",
            "I have successfully booked the appointment.",
            "Need your confirmation to book the Compact car for pickup at Canterbury Village on March 1st for the pick up time at 12:30 pm up to the drop-off date March 8th.",
            "I have booked the car as per your requirements.",
            "Have a good day."
        ]
    },
    {
        "dialogue_id": "12_00022",
        "service": "RentalCars_1",
        "service_call": {
            "method": {
                "method": "ReserveCar",
                "parameters": {
                    "dropoff_date": "2019-03-08",
                    "pickup_date": "2019-03-04",
                    "pickup_location": "Canterbury Village",
                    "pickup_time": "15:00",
                    "type": "Standard"
                }
            }
        },
        "user_utterance": [
            "I need to purchase a rental car from the 4th of March until the 8th.",
            "How about Concord?",
            "I'd like it at three in the afternoon.",
            "What's the price?",
            "That will be fine.",
            "Not at the moment, thank you.",
            "I need to locate a furnished apartment for rent.",
            "I'll need a place with three bedrooms.",
            "Does the building allow pets?",
            "All right, I'd like to take a look at the place.",
            "No, on the 5th.",
            "Correct, thank you.",
            "Thanks again. I'd like to reserve that car that we talked about",
            "That all sounds correct.",
            "Thanks, you've been very helpful."
        ],
        "system_utterance": [
            "Where would you like to pick up the car?",
            "Certainly, at what time?",
            "I have 8 possible vehicles for you. A standard Accord will be available March 4th at Canterbury Village.",
            "The total amount would be $152.",
            "Would you like to book the car?",
            "What else may I do for you?",
            "How many bedrooms do you want?",
            "I have 1 suggestion for you, Pine Terrace Apartments at 1500 Pine Street # 78 has a 3 bedroom and 3 bath apartment that's very nice. The rent is $4,050 per month.",
            "Yes, it does.",
            "Do you want to set the appointment for March 4th?",
            "Confirming a visit to Pine Terrace Apartments on March 5th.",
            "That has been scheduled successfully.",
            "Certainly, confirming a standard vehicle rental at Canterbury Village on March 4th at 3 PM and a return on March 8th.",
            "The car has been successfully reserved.",
            "It's my pleasure."
        ]
    },
    {
        "dialogue_id": "12_00023",
        "service": "RentalCars_1",
        "service_call": {
            "method": {
                "method": "ReserveCar",
                "parameters": {
                    "dropoff_date": "2019-03-11",
                    "pickup_date": "2019-03-07",
                    "pickup_location": "SJC International Airport",
                    "pickup_time": "17:00",
                    "type": "Standard"
                }
            }
        },
        "user_utterance": [
            "My car is currently in the shop and I need to find a rental car.",
            "I don't have to be back to work for a few days so I need to have it Thursday next week.",
            "I can pick it up around 5 in the evening on March 11th in San Jose.",
            "Great, I am also in the market for a new apartment in that area.",
            "I need a room for myself and kids so three.",
            "That's a bit out of my price range. What else do you have.",
            "That one sounds better. Let's schedule a walk through on the 8th.",
            "Yes, that's great.",
            "I should have asked before, but do they allow pets of any kind?",
            "Can you also tell me if the apartments are furnished and I will also need a contact number for their office.",
            "That's fine. Can we get back to booking that rental car you previously found?",
            "Yes, and how much will that cost me?",
            "Great, you were extremely helpful.",
            "No, that will be all for now. Thanks again."
        ],
        "system_utterance": [
            "What day do you need the car?",
            "Just a few details and then I can help locate a car for you. Where would you like to pick up the car, at what time, and when will you be returning the car?",
            "I see that SJC International Airport has a standard Camry available for pickup on March 7th.",
            "I can help with that as well, first tell me the number of bedrooms you need.",
            "The first apartment out of the 10 I have found is located at 1546 Maurice Lane and is called 888 Golden Saratoga-Cupertino Apartment Homes, with 3 bedrooms, 3 bathrooms and costs $4,450 a month.",
            "The one called Aegena, located at 1290 San Tomas Aquino Road with 3 bedrooms and 2 bathrooms may fit your budget better at $3,500 a month.",
            "Okay, so you would like me to schedule a walk through at Aegena on March 8th, correct?",
            "I am happy to report that I was able to schedule that for you.",
            "Yes, they advertise that they do allow pets.",
            "The apartment's with the phone number 408-984-8888 are not furnished.",
            "Yes, the information I have for the rental car is a standard car being picked up from SJC International Airport, on March 7th at 5 pm, and dropping it back off on March 11th. Is that all still correct?",
            "The car reservation I have just confirmed for you will come to a grand total of $136.",
            "Is there anything else I can help you with.",
            "No problem, have a good day."
        ]
    },
    {
        "dialogue_id": "12_00024",
        "service": "RentalCars_1",
        "service_call": {
            "method": {
                "method": "ReserveCar",
                "parameters": {
                    "dropoff_date": "2019-03-05",
                    "pickup_date": "2019-03-03",
                    "pickup_location": "Fremont BART Station",
                    "pickup_time": "12:00",
                    "type": "Standard"
                }
            }
        },
        "user_utterance": [
            "I want to find a rental car that I can pick up on the 3rd at 12 pm",
            "I want to get it at Fremont and need it till Tuesday next week",
            "That sounds awesome",
            "Yes, but not now. Let's find an apartment with three baths first",
            "4 bed rooms",
            "What's their number? Is it furnished?",
            "That's good for me",
            "Yes please, on the 3rd",
            "Yes please. Are pets allowed there by the way?",
            "Great, let's book that car now.",
            "Yes please, what's that gonna cost me?",
            "Thanks so much",
            "No, we're all set!"
        ],
        "system_utterance": [
            "Sure, from where and how long do you need it from?",
            "There's a nice car at Fremont BART Station on March 3rd, it's a Standard Accord",
            "So should I book it?",
            "How many rooms?",
            "Alborada Apartments at 1001 Beethoven Common has a spacious 4 bed room 3 bath place for $4,700 a month",
            "It's not furnished, sorry. You can reach them at 510-797-1800",
            "Do you want to book a visit?",
            "So a March 3rd visit to Alborada Apartments?",
            "It's booked! And yes they are!",
            "Confirming your standard car pickup on March 3rd at 12 pm from Fremont BART Station with a March 5th drop off",
            "It's been booked for $52 in total",
            "Can I do something else?",
            "Awesome, take care!"
        ]
    },
    {
        "dialogue_id": "12_00025",
        "service": "RentalCars_1",
        "service_call": {
            "method": {
                "method": "ReserveCar",
                "parameters": {
                    "dropoff_date": "2019-03-08",
                    "pickup_date": "2019-03-04",
                    "pickup_location": "Salesforce Transit Center",
                    "pickup_time": "12:30",
                    "type": "Standard"
                }
            }
        },
        "user_utterance": [
            "My car is in the shop and I need to find a rental car.",
            "I'll need it from Sunday this week until the 8th.",
            "I'd like to pick it up at half past 12 in the afternoon.",
            "I need to pick it up in San Fran.",
            "On second thought, I think I'll get it on March 4th. Is there anything else available.",
            "What's the total price?",
            "Okay, that should work. I also need help looking for an three bathroom apartment in that area that allows pets.",
            "I need it to have four bedrooms.",
            "Is the apartment furnished?",
            "Yes, that apartment could work. I'd like to schedule a visit to tour it on March 4th.",
            "Yes, that's great. What's the phone number for the property?",
            "And can we reserve the car we found earlier?",
            "Yep, that's great.",
            "Thanks for your help.",
            "No, that's all, thanks."
        ],
        "system_utterance": [
            "When would you like to pick it up and drop it off?",
            "And what time would you like to pick it up?",
            "Where are you picking it up?",
            "I found a standard car, an Altima, available for pickup from SFO International Airport on March 3rd.",
            "I found 5 cars that might work for you. There is a standard car, a Civic, available for pickup on March 4th from Salesforce Transit Center.",
            "The rental is $116 total.",
            "How many bedrooms would you like?",
            "I found 7 apartments you might like. There is a 4 bedroom, 3 bathroom apartment for $4,850 per month at Chestnut Place which is located at 900 Chestnut Street # 102.",
            "No, this apartment is unfurnished.",
            "Let's confirm the details: You're touring Chestnut Place apartments on March 4th.",
            "I've scheduled your visit. The phone number is 415-441-5668.",
            "Let's confirm the details: You are renting a standard car from Salesforce Transit Center on March 4th at 12:30 pm and returning it on March 8th.",
            "Okay, your car is now reserved.",
            "Anything else I can help you with?",
            "Have a great day!"
        ]
    },
    {
        "dialogue_id": "12_00026",
        "service": "RentalCars_1",
        "service_call": {
            "method": {
                "method": "ReserveCar",
                "parameters": {
                    "dropoff_date": "2019-03-08",
                    "pickup_date": "2019-03-03",
                    "pickup_location": "Canterbury Village",
                    "pickup_time": "12:00",
                    "type": "Standard"
                }
            }
        },
        "user_utterance": [
            "Hello, I need to rent a car.",
            "I'd like to get it at 12:00 in Concord on the 3rd of March.",
            "I plan to return it Friday next week.",
            "For how much?",
            "Okay, that works.",
            "Yes but not now.",
            "Yes, I'd like to find an apartment.",
            "I'm going to need 3 bedrooms.",
            "Anything else? I need a building that allows pets.",
            "Any other options?",
            "That one sounds promising.",
            "Yes, I sure would.",
            "I think I'd like to go on the 5th of March.",
            "Okay. Is it a furnished apartment? And I'd like the phone number.",
            "Excellent. Hey, I'd like to book that car that we talked about earlier.",
            "Great, thank you.",
            "Thank you again for all your help."
        ],
        "system_utterance": [
            "When would you like it and at what time? And when would you like to pick it up?",
            "How long will you need the car?",
            "I have 6 possible cars for you. A standard Accord is available March 3rd at Canterbury Village.",
            "The total price is $130.",
            "Should I book the car for you?",
            "Is there anything else I can help you with?",
            "How many bedrooms?",
            "I have 10 possible options for you. There is a 3 bedroom 2 bath apartment at City Walk Apartment Homes, which is located at 1688 Clayton Road. That apartment lists for $3,550 a month.",
            "I recommend Greentree Terrace Apartments, which has a 3 bedroom and 3 bath unit located at 3620 Clayton Road # 101 that rents for $4,300 dollars per month.",
            "Yes, Hidden Creek Town Homes has a 3 bedroom, 3 bath apartment for $4,100 per month. They are located at 1032 Mohr Lane.",
            "Would you like to go see it?",
            "How about eight visit on March 3rd?",
            "Confirming a visit to Hidden Creek Town Homes on March 5th.",
            "No, the apartment is unfurnished. The telephone number is 925-687-8460. Your visit has been scheduled.",
            "Confirming a standard vehicle rental from Canterbury Village on March 3rd at 12 PM and a return of March 8th.",
            "The reservation was successful.",
            "I'm happy to be able to do so."
        ]
    },
    {
        "dialogue_id": "12_00027",
        "service": "Buses_1",
        "service_call": {
            "method": {
                "method": "ReserveHotel",
                "parameters": {
                    "check_in_date": "2019-03-04",
                    "location": "Sacramento",
                    "number_of_rooms": "1",
                    "place_name": "Best Western Plus Sutter House",
                    "stay_length": "7"
                }
            }
        },
        "user_utterance": [
            "I need to reserve a seat on the bus.",
            "I am leaving for Sacramento on 9:45 am.",
            "I need 4 tickets for later today. We are going to SF.",
            "That is perfect. What is the name of the station I am leaving from?",
            "Yes, that is perfect.",
            "Thanks! I also need one hotel room while I'm there.",
            "Ok. I want to reserve for seven days beginning next Monday.",
            "Yes, that is correct.",
            "What is the phone number?",
            "Thanks.",
            "No, that is all."
        ],
        "system_utterance": [
            "Where are you going? What time are you leaving?",
            "How many tickets? Where are you leaving from?",
            "Please confirm, leaving San Francisco for Sacramento on March 1st at 9:45 am for 4 people.",
            "The origin station is Salesforce Transit Center. That ticket is was unavailable. I found another option leaving at 9:40 am for $25.",
            "Your ticket is confirmed.",
            "I found a hotel called Best Western Plus Sutter House. It is a 1 star hotel.",
            "Please confirm, staying 7 days at Best Western Plus Sutter House beginning on March 4th in Sacramento. You needed 1 room.",
            "Your hotel has been reserved.",
            "The phone number is +1 916-441-1314.",
            "Anything else?",
            "Have a nice day."
        ]
    },
    {
        "dialogue_id": "12_00028",
        "service": "Buses_1",
        "service_call": {
            "method": {
                "method": "ReserveHotel",
                "parameters": {
                    "check_in_date": "2019-03-04",
                    "location": "San Francisco",
                    "number_of_rooms": "1",
                    "place_name": "Chancellor Hotel On Union Square",
                    "stay_length": "6"
                }
            }
        },
        "user_utterance": [
            "I'm looking for a bus leaving from Sacramento, CA.",
            "I want four.",
            "The day after tomorrow around one in the afternoon.",
            "I'm going to SF.",
            "On second thought make it the 1st of this month.",
            "Correct. What is the cost and which station will it arrive at?",
            "Perfect, thank you. Could you check some hotels there? I'd like 1 room in a 3 star hotel.",
            "What's another one?",
            "Any more?",
            "How much is that one?",
            "And their phone number?",
            "Sounds good. Can you make a reservation?",
            "For 7 days.",
            "Yes, that's right.",
            "No make it six days instead. I'd like to check in next Monday.",
            "Perfect. Do they allow smoking in the hotel? What's the address.",
            "You have been great, thanks. That's all I needed."
        ],
        "system_utterance": [
            "How many tickets?",
            "What day and time did you want to leave?",
            "And where would you like to go?",
            "To confirm: You would like 4 tickets on a bus from Sacramento to San Francisco leaving at 1 pm March 3rd.",
            "That would be the bus leaving Sacramento on March 1st.",
            "Tickets are $23. It will arrive at Salesforce Transit Center. Your tickets are confirmed.",
            "I found 10 3 star hotels. There's Bei Hotel San Francisco.",
            "Beresford Arms Hotel also has 3 stars.",
            "Another 3 star is Chancellor Hotel on Union Square.",
            "$102 a night.",
            "Its +1 415-362-2004.",
            "How long do you want to stay?",
            "Will you be checking in March 1st?",
            "Please confirm: You want 1 room for 7 days at the Chancellor Hotel on Union Square in San Francisco checking in March 1st.",
            "You would like to check in for 6 days on March 4th. Is that correct.",
            "433 Powell Street. No smoking is allowed. Your reservation has been confirmed.",
            "Have a great day. Goodbye."
        ]
    },
    {
        "dialogue_id": "12_00029",
        "service": "Buses_1",
        "service_call": {
            "method": {
                "method": "ReserveHotel",
                "parameters": {
                    "check_in_date": "2019-03-08",
                    "location": "Long Beach",
                    "number_of_rooms": "1",
                    "place_name": "Hyatt Centric The Pike Long Beach",
                    "stay_length": "6"
                }
            }
        },
        "user_utterance": [
            "I need a bus to go to Fresno",
            "The city of departure is Las Vegas",
            "I want two tickets. I'd like to leave on 4th of March at afternoon 2",
            "No, I need a bus to Long Beach on the 1st",
            "Yes, I confirm. What's the departure station? Does the journey include transfers?",
            "Thanks a lot! Now I need a 4 star hotel there. I need one room",
            "Yes, It works for me!",
            "Yes, please. I need a room from 8th of this month for six days",
            "Yes, I confirm. Is it possible to smoke in the hotel?",
            "Can I get the hotel street address?",
            "Thank you so much for helping! That's all"
        ],
        "system_utterance": [
            "What's the city of departure?",
            "How many tickets do you want? What day do you want to leave? What time would you prefer?",
            "A bus for 2 people form Las Vegas to Fresno, on March 4th at 2 pm. Is it correct?",
            "A bus to Long Beach on March 1st. Do you confirm?",
            "The departure station is Union Plaza. The journey has 0 transfers. Your ticket is booked!",
            "There are 3 hotels. For example there's the 4 star hotel Hyatt Centric The Pike Long Beach",
            "Do you want to book there?",
            "1 rooms at Hyatt Centric The Pike Long Beach in Long Beach, from March 8th for 6 days. Do you confirm?",
            "Your reservation is confirmed. No, it is a non-smoking hotel",
            "Sure! The address is 285 Bay Street",
            "Have a great day!"
        ]
    },
    {
        "dialogue_id": "12_00030",
        "service": "Buses_1",
        "service_call": {
            "method": {
                "method": "ReserveHotel",
                "parameters": {
                    "check_in_date": "2019-03-10",
                    "location": "San Diego",
                    "number_of_rooms": "1",
                    "place_name": "Bahia Resort Hotel",
                    "stay_length": "3"
                }
            }
        },
        "user_utterance": [
            "I need to reserve a bus?",
            "One ticket and I want to leave at 11:30 in the morning.",
            "I want to leave next Friday. I am leaving from Sacramento, CA and going to SD.",
            "Yes, that is correct.",
            "Yes, that is fine.",
            "What are the number of transfers?",
            "TYanks for the help. I need a hotel room in that area, one room.",
            "Sounds great, Can you reserve me a room?",
            "I want to check in on March 10th and stay for three days.",
            "Correct. What is the phone number and the price per night?",
            "You have been really helpful, thanks.",
            "No thanks."
        ],
        "system_utterance": [
            "How many tickets do you want and what time do you wish to leave?",
            "What day do you want to leave? What is your destination and where are departing from?",
            "Please confirm: 1 ticket for a bus leaving at 11:30 am on March 8th from Sacramento traveling to San Diego.",
            "I was unable to purchase the ticket. How does a bus departing at 11 am sound? It cost $75.",
            "Your ticket has been purchased.",
            "1 transfer.",
            "There is a 3 star hotel named Bahia Resort Hotel.",
            "How long do you want to stay? Will you be checking in on March 8th?",
            "Please confrim: You want 1 room at Bahia Resort Hotel in San Diego. Your check in date is March 10th with a 3 day stay.",
            "I booked the hotel. Th phone number is +1 858-539-8666 and the price is $117 per night.",
            "May I assist you with something else?",
            "Good bye and enjoy the rest of your day!"
        ]
    },
    {
        "dialogue_id": "12_00031",
        "service": "Buses_1",
        "service_call": {
            "method": {
                "method": "ReserveHotel",
                "parameters": {
                    "check_in_date": "2019-03-11",
                    "location": "Sacramento",
                    "number_of_rooms": "1",
                    "place_name": "Best Western Plus Sutter House",
                    "stay_length": "2"
                }
            }
        },
        "user_utterance": [
            "I'm looking for transportation to go to sacramento, ca. I was thinking about leaving from fresno, ca at morning 8:15",
            "you're right, the date is march 1st and the booking is for 4 people",
            "you're recap is spotless",
            "it's smart idea",
            "now it's about time that I start looking for an hotel room",
            "It's a good suggestion, I think I want to stay there",
            "only 2 days",
            "I need to check in on the 11th of this month and you have to book only 1 room",
            "Yes, do the procedure now and tell me the phone number and if I can smoke while there",
            "I really needed your services, thank you."
        ],
        "system_utterance": [
            "you told me the time but not the date and how many seats you want to reserve",
            "let's recap the request and see if it is correct. You want 4 tickets for a bus going to sacramento from fresno. You'll leave on march 1st at 8:15 am",
            "I'm afraid I can't do what you asked me but you could leave at 8:20 am and it would cost you $28",
            "I managed to buy your tickets",
            "if you want to stay there for few days, you can book a room at best western plus sutter house, it's a 1 star hotel",
            "how long to you need the room?",
            "do you think you'll check in on march 1st?",
            "confirm then your directions I am about to follow: you want 1 room at the best western plus sutter house in sacramento, your check in is on march 11th and you'll stay there for 2 days",
            "The room has been booked and no, you can't smoke while you're inside the hotel. For any question, the number to call is +1 916-441-1314",
            "I'm always there for you. Bye"
        ]
    },
    {
        "dialogue_id": "12_00032",
        "service": "Buses_1",
        "service_call": {
            "method": {
                "method": "ReserveHotel",
                "parameters": {
                    "check_in_date": "2019-03-11",
                    "location": "San Francisco",
                    "number_of_rooms": "1",
                    "place_name": "Bei Hotel San Francisco",
                    "stay_length": "3"
                }
            }
        },
        "user_utterance": [
            "I need a bus.",
            "A bus from Fresno on March 11th for four of us.",
            "To San Francisco.",
            "2 o\"clock in the afternoon.",
            "That is right.",
            "Try from SD.",
            "Yes, try that.",
            "Where do I go to catch the bus? And how much is this going to set me back.",
            "Nice. How about a nearby 3 star hotel?",
            "Great. Book it for 3 days.",
            "Yes, thats the check-in.",
            "That is correct.",
            "Where are they exactly? How can I get in touch with them.",
            "Very good. Thanks.",
            "Nothing. I'm good to go."
        ],
        "system_utterance": [
            "Can you be a little more specific?",
            "And where would you like to go?",
            "At what time?",
            "4 to San Francisco via Fresno on March 11th at 2 pm?",
            "Sorry. No can do. What else?",
            "4 to San Francisco via San Diego on March 11th at 2 pm?",
            "Worked! You have tickets.",
            "$56. Head to Santa Fe Depot to catch the bus.",
            "Bei Hotel San Francisco should do the job. It has 3 stars.",
            "Starting March 11th?",
            "1 room for 3 days at Bei Hotel San Francisco in San Francisco on MArch 11th?",
            "Ok. Reservation is done.",
            "Call them at +1 415-626-6103. They are at 50 8th Street.",
            "So what else?",
            "Glad I could help."
        ]
    },
    {
        "dialogue_id": "12_00033",
        "service": "Buses_1",
        "service_call": {
            "method": {
                "method": "ReserveHotel",
                "parameters": {
                    "check_in_date": "2019-03-07",
                    "location": "Las Vegas",
                    "number_of_rooms": "1",
                    "place_name": "Best Western Plus Las Vegas West",
                    "stay_length": "4"
                }
            }
        },
        "user_utterance": [
            "I would like to make a booking for a bus.",
            "I will be leaving for the trip on 5th of this month.",
            "I will leave for my trip from Fresno, CA.",
            "I need tickets just for one person. I want to leave for the trip at one in the afternoon, and my destination is Vegas.",
            "Yes that suits me well.",
            "Yes that works well for me too.",
            "Can you tell me from which station will I be leaving?",
            "Which is the station that I will arrive at?",
            "I thank you for the help. I also want to find a hotel in that area, so that I would have a place to stay in.",
            "Can you tell me how much does it cost per night at this hotel?",
            "Can you give me their phone number? Can I smoke at this hotel?",
            "Seems nice. I would like to making a booking at this hotel.",
            "I want to stay at the hotel for four days, and I will go there on the 7th.",
            "Yes, that is correct.",
            "Can you give me their address?",
            "I appreciate it, since you have helped me a lot. That would be all for now."
        ],
        "system_utterance": [
            "Can you tell me when are you planning to leave?",
            "Can you tell me from where will you be departing?",
            "Can you tell me which is your destination, and the time when you will be leaving? How many tickets do you want to buy?",
            "Can you please confirm that you want to buy tickets for 1 person for the bus which leaves from Fresno on March 5th at 1 pm to go to Las Vegas?",
            "I apologize but I could not buy the ticket. Would you like to have ticket for the bus which leaves at 12:40 pm, and has a price of $39?",
            "Your requested ticket has been booked.",
            "Your bus will be leaving from Fresno Station.",
            "Your bus will be arriving at Union Plaza.",
            "You might consider the Best Western Plus Las Vegas West, which is a 3 star hotel.",
            "Staying at this hotel, will be costing you $117 per night.",
            "If you want to call them you can at +1 702-256-3766. Unfortunately, smoking is not allowed at this hotel.",
            "Can you tell me how long will you stay at the hotel, and if you are going there on March 5th?",
            "Can you please confirm that you want to book 1 room for 4 days at the Best Western Plus Las Vegas West hotel in Las Vegas, and that you will go there on March 7th?",
            "Your requested room has been booked.",
            "The hotel can be found at the following address 8669 West Sahara Avenue.",
            "Good bye! Have a wonderful time!"
        ]
    },
    {
        "dialogue_id": "12_00034",
        "service": "Buses_1",
        "service_call": {
            "method": {
                "method": "ReserveHotel",
                "parameters": {
                    "check_in_date": "2019-03-05",
                    "location": "San Diego",
                    "number_of_rooms": "1",
                    "place_name": "Bahia Resort Hotel",
                    "stay_length": "7"
                }
            }
        },
        "user_utterance": [
            "Hello. I want to reserve a bus.",
            "I'm leaving Anaheim later today.",
            "My group of 4 heads to SD at morning 9:45.",
            "That is correct.",
            "That works for me.",
            "Thanks. Can you find a hotel around there?",
            "Sounds good to me.",
            "Yes, I'd like to book 1 room there starting Tuesday next week.",
            "For seven days.",
            "Sounds good. Can I smoke there?",
            "What are the nightly cost and phone number?",
            "Thanks. You were a great help.",
            "Not now. Thanks so much for the help!"
        ],
        "system_utterance": [
            "When are you going?",
            "Okay. How many tickets will you need? When do you want to go?",
            "Okay. You want 4 tickets for a bus going from Anaheim to San Diego on March 1st at 9:45 am?",
            "Sorry, I could not get that ticket. Do you instead want 4 $22 per person tickets for a bus that leaves at 9:40 am?",
            "I booked your tickets.",
            "There's the 3 star Bahia Resort Hotel.",
            "Want to book a room there?",
            "For how long will you stay?",
            "You want to book 1 room in Bahia Resort Hotel in San Diego, and stay there for 7 days on March 5th?",
            "I booked your room. Enjoy your stay! You cannot smoke there.",
            "You will have to pay $93 for each night, and can dial +1 858-539-8666.",
            "Can I help some more?",
            "See you later. Have a great day!"
        ]
    },
    {
        "dialogue_id": "12_00035",
        "service": "Buses_1",
        "service_call": {
            "method": {
                "method": "ReserveHotel",
                "parameters": {
                    "check_in_date": "2019-03-07",
                    "location": "Fresno",
                    "number_of_rooms": "1",
                    "place_name": "Doubletree By Hilton Hotel Fresno Convention Center",
                    "stay_length": "6"
                }
            }
        },
        "user_utterance": [
            "I need a bus going to Fresno.",
            "I need to leave on March 4th.",
            "I need three tickets from LAX.",
            "I need to leave at morning 10:15.",
            "Yes that will be great. Does it have more than 1 transfers? WHat station does it arrive at/",
            "That will be fine.",
            "Thanks for your help. I will also need a hotel there.",
            "That sounds great.",
            "I need 1 room for 6 days.",
            "I need to check in on next Thursday.",
            "Yes that is great. Do you have there number?",
            "Thanks for all your help."
        ],
        "system_utterance": [
            "When would you like to leave?",
            "How many tickets would like? Where will you be departing from?",
            "What time would you like to leave?",
            "Just to confirm you need 3 tickets on the bus that leaves March 4th at 10:15 am from Los Angeles going to Fresno.",
            "Sorry that bus is full. How about the 10:40 am bus with 0 transfers for $31. It arrives at Fresno Station.",
            "Your tickets are booked.",
            "What do you think about the 3 star Doubletree By Hilton Hotel Fresno Convention Center.If you would prefer another hotel I have 5 more options for you.",
            "How many nights do you need it for?",
            "Would you like to check in on March 4th.",
            "Just to confirm you need 1 room for 6 days at the Doubletree By Hilton Hotel Fresno Convention Center hotel in Fresno checking in on March 7th.",
            "Your room is booked. Thier number is +1 559-268-1000",
            "Have an awesome day!"
        ]
    },
    {
        "dialogue_id": "12_00036",
        "service": "Buses_1",
        "service_call": {
            "method": {
                "method": "ReserveHotel",
                "parameters": {
                    "check_in_date": "2019-03-09",
                    "location": "Anaheim",
                    "number_of_rooms": "2",
                    "place_name": "Anaheim Portofino Inn & Suites",
                    "stay_length": "3"
                }
            }
        },
        "user_utterance": [
            "Hi, could you get me a bus reservation please?",
            "I will me travelling from Los Angeles to Anaheim in a group of four.",
            "Likely at 7 o\"clock in the morning.",
            "On the 9th of this month.",
            "Sure, how much will this cost me?",
            "Sure, could you get me some hotels to stay at too?",
            "Are there any alternative three star hotels with two rooms?",
            "Are there any alternatives?",
            "Sure, this is fine with me.",
            "Sure, could you make one at 9th of this month for three days please?",
            "Sure, may I have their address too?",
            "Sure, can I smoke in the hotel?",
            "I see, that is all I need. Thank you."
        ],
        "system_utterance": [
            "Where will you be travelling from and to and how many tickets are you looking to get?",
            "When will you be departing?",
            "I see, when do you plan to depart then?",
            "Please confirm your reservation for 4 seats on the bus from Los Angeles to Anaheim on March 9th at 7 am.",
            "Your reservation has been made, and this will cost you $13.",
            "There are 10 hotels you may like, one of which is a 2 star hotel called Anaheim Desert Inn and Suites.",
            "Would you like a 3 star hotel called Anaheim Majestic Garden Hotel?",
            "How about a 3 star hotel called Anaheim Portofino Inn & Suites?",
            "Would you like to make a reservation there?",
            "Please confirm your reservation for 2 rooms at Anaheim Portofino Inn & Suites at Anaheim on March 9th for 3 days.",
            "Your reservation has been made, and you can locate them at 1831 South Harbor Boulevard!",
            "No, you are not allowed to.",
            "No worries, have a safe trip."
        ]
    },
    {
        "dialogue_id": "12_00037",
        "service": "Buses_1",
        "service_call": {
            "method": {
                "method": "ReserveHotel",
                "parameters": {
                    "check_in_date": "2019-03-12",
                    "location": "Fresno",
                    "number_of_rooms": "1",
                    "place_name": "Piccadilly Inn Airport",
                    "stay_length": "2"
                }
            }
        },
        "user_utterance": [
            "I need a bus for two people, on March 6th, to Fresno",
            "The city of origin is Sacramento, and I want to leave on March 12th.",
            "At 13:45 if it's possible",
            "Yes, It's correct. Thanks",
            "Yes, this bus is fine too",
            "Thanks a lot for helping!",
            "I'm looking for a 3 star hotel in that area",
            "Is it possible to smoke in this hotel? Can I get the contact number?",
            "Can you tell me another hotel?",
            "That's good for me!",
            "Yes, I want to reserve a room here",
            "I need the room for two days",
            "Yes, It's correct",
            "Yes, I confirm, thanks",
            "Thanks a lot for helping! It's all!"
        ],
        "system_utterance": [
            "What's the departure city?",
            "What time would you prefer?",
            "A bus for 2 people from Sacramento to Fresno on March 12th at 1:45 pm. Is it correct?",
            "Unfortunately this ticket is not available. There's a bus available at 1:30 pm, and it costs $31.",
            "Your ticket is booked!",
            "Do you need anything else?",
            "There are 4 hotels. Doubletree By Hilton Hotel Fresno Convention Center is a 3 star hotel",
            "No, isn't possible to smoke there. Contact number is +1 559-268-1000",
            "There's the 3 star hotel Piccadilly Inn Airport",
            "Do you need anything else?",
            "For how many days?",
            "Is the arrival day March 12th?",
            "1 room at Piccadilly Inn Airport in Fresno on March 12th for 2 days. Do you confirm?",
            "Your reservation is confirmed!",
            "Have a great day!"
        ]
    },
    {
        "dialogue_id": "12_00038",
        "service": "Buses_1",
        "service_call": {
            "method": {
                "method": "ReserveHotel",
                "parameters": {
                    "check_in_date": "2019-03-03",
                    "location": "Fresno",
                    "number_of_rooms": "1",
                    "place_name": "Doubletree By Hilton Hotel Fresno Convention Center",
                    "stay_length": "4"
                }
            }
        },
        "user_utterance": [
            "Can you get me bus ticket?",
            "I got a party of four.",
            "We're leaving for Fresno around 11 in the morning on Saturday this week.",
            "We're cutting out from Sacramento.",
            "You got it.",
            "Great. Now all we need is a place to stay.",
            "Could you find me their digits?",
            "Ok. thank you.",
            "Yes, go ahead.",
            "March 3rd. For four days.",
            "That is correct.",
            "Nice job Bro.",
            "Lie down and take a break."
        ],
        "system_utterance": [
            "How many do you need?",
            "Give me the details. Time, place.",
            "And from where?",
            "4 seats on a March 2nd 11 am Sacramento to Fresno bus?",
            "An you got four seats.",
            "I got 5 hotels. Try Doubletree by Hilton Hotel Fresno Convention Center. It has 3 stars.",
            "+1 559-268-1000.",
            "Should I secure the rooms?",
            "From March 2nd right? How long is your stay?",
            "1 room for 4 days at Doubletree by Hilton Hotel Fresno Convention Center in Fresno beginning on MArch 3rd. Correct?",
            "Done. Room booked.",
            "Thanks. I'm up for more.",
            "Will do, thanks."
        ]
    },
    {
        "dialogue_id": "12_00039",
        "service": "Buses_1",
        "service_call": {
            "method": {
                "method": "ReserveHotel",
                "parameters": {
                    "check_in_date": "2019-03-06",
                    "location": "Fresno",
                    "number_of_rooms": "2",
                    "place_name": "Doubletree By Hilton Hotel Fresno Convention Center",
                    "stay_length": "3"
                }
            }
        },
        "user_utterance": [
            "I'm looking for some bus tickets.",
            "I need 3 tickets and we want to leave for Fresno at 6:15 in the evening.",
            "I'm departing from Los Angeles on the 1st of this month and it is for 4 people.",
            "Yes, that is correct. What bus station am I departing from?",
            "Yes, that works for me.",
            "Thank you. I also need to find two room at a 3 star hotel.",
            "Yes, that sounds good.",
            "Yes, I do.",
            "No, I want to check in on the 6th.",
            "I'm staying for 3 days.",
            "Yep, that is right.",
            "Thank you, that is all I needed."
        ],
        "system_utterance": [
            "How many tickets do you need?",
            "What date are you departing on? Where are you departing from?",
            "Okay, confirm the details. You want 4 tickets for the bus traveling from Los Angeles to Fresno on March 1st at 6:15 pm.",
            "The bus departs from Union Station. However, I was unable to purchase the bus tickets. Does the bus departing at 6:10 pm for $34 work?",
            "I have purchased the tickets.",
            "I found 4 hotels for you. How about the 3 star Doubletree by Hilton Hotel Fresno Convention Center?",
            "Do you want to make a reservation?",
            "Are you checking in on March 1st?",
            "How long will you be staying?",
            "Okay, confirm the details. You want 2 rooms at the Doubletree by Hilton Hotel Fresno Convention Center in Fresno. You are checking in on March 6th and staying 3 days.",
            "I have confirmed the reservation.",
            "Have a great day."
        ]
    },
    {
        "dialogue_id": "12_00040",
        "service": "Buses_1",
        "service_call": {
            "method": {
                "method": "ReserveHotel",
                "parameters": {
                    "check_in_date": "2019-03-12",
                    "location": "Vancouver",
                    "number_of_rooms": "1",
                    "place_name": "Atrium Inn Vancouver",
                    "stay_length": "2"
                }
            }
        },
        "user_utterance": [
            "Please find me a bus",
            "On the 12th of this month and to Vancouver, BC",
            "two tickets for a 07:45 bus and I'm in seattle wa",
            "This is correct, oh please tell me how much they cost and what's the name of the station I'll be leaving from.",
            "Ok, I'll change it to that.",
            "What hotels are around there?",
            "How much and can I smoke?",
            "Ok, sweet.",
            "Please do",
            "two",
            "Yes.",
            "Perfect, can you tell me their number?",
            "Awesome, thanks.",
            "Nope, thanks for all your help"
        ],
        "system_utterance": [
            "Sure, when are you leaving and where would you like to go?",
            "Ok, where are you located, how many tickets will you need and what time would you like to leave?",
            "Please confirm: 2 bus tickets from seattle enroute to vancouver on march 12th at 7:45 am",
            "King Street station is the name. Unfortunately, I couldn't book these seats. Instead, I can book a 7:40 am bus for $31.",
            "Your tickets are now complete.",
            "There's a 3 star atrium inn vancouver hotel that you might like.",
            "No smoking and $228 per night",
            "Shall I book these tickets?",
            "How many days will you need the reservation for?",
            "Will this be on march 12th?",
            "Please confirm: 1 room at the atrium inn vancouver for 2 days on march 12th in vancouver, canada.",
            "This reservation is now complete. Their number is +1 604-254-1000",
            "May I help you with something else?",
            "Have a wonderful day"
        ]
    },
    {
        "dialogue_id": "12_00041",
        "service": "Buses_1",
        "service_call": {
            "method": {
                "method": "ReserveHotel",
                "parameters": {
                    "check_in_date": "2019-03-07",
                    "location": "Philadelphia",
                    "number_of_rooms": "1",
                    "place_name": "Aka University City",
                    "stay_length": "3"
                }
            }
        },
        "user_utterance": [
            "I need two Los Angeles bound bus tickets please.",
            "I'll be going from Fresno.",
            "5th of March at 4:30 in the evening.",
            "Great. What is the destination station?",
            "Let's try to buy those again, 3 people from NYC to Philly.",
            "Yes, thanks. Where does it leave from and how much is it?",
            "Thanks! I'd like to find hotel with a 3 star rating too please.",
            "Okay, thank you.",
            "Yes, starting Wednesday next week, two rooms please.",
            "Six days and make the check in next Thursday actually.",
            "Make that one room for 3 days instead please.",
            "Great, thanks. What is the room rate?",
            "Thank you for helping me.",
            "No, not today."
        ],
        "system_utterance": [
            "Where are you departing from please?",
            "On what date and time?",
            "Confirming 2 tickets from Fresno to Los Angeles, March 5th, for a 4:30 pm departure.",
            "I'm sorry, I couldn't book those tickets. May I help you with something else?",
            "Confirming 3 passengers March 5th at 4:30 pm from New York to Philadelphia.",
            "It departs from Port Authority Station and the ticket price is $21. The tickets have been purchased.",
            "There 10 hotels I can suggest to you in the 3 star category. How about the Aka University City?",
            "Shall I reserve that for you?",
            "For how long?",
            "Confirming a 6 day reservation in Philadelphia at Aka University City on March 7th for 2 rooms.",
            "Confirming a 3 day stay and a reservation for 1 room.",
            "It's $84 a night and the reservation is complete.",
            "Anything else today?",
            "Thank you very much."
        ]
    },
    {
        "dialogue_id": "12_00042",
        "service": "Buses_1",
        "service_call": {
            "method": {
                "method": "ReserveHotel",
                "parameters": {
                    "check_in_date": "2019-03-10",
                    "location": "San Francisco",
                    "number_of_rooms": "1",
                    "place_name": "Beck'S Motor Lodge",
                    "stay_length": "4"
                }
            }
        },
        "user_utterance": [
            "I have a short trip coming up. Can you help me book a bus ticket?",
            "I'm going to Philadelphia.",
            "I'll be leaving this Sunday from Washington.",
            "I'm trying to leave around a quarter to 3 in the afternoon on the 8th of this month.",
            "Just one for me.",
            "Yes, that's right. Which station does it go to?",
            "Yeah, can you try finding a ticket from San Fran to Las Vegas instead?",
            "Yes, that's right.",
            "Yes, that's fine.",
            "Great, thanks. I also want to book one room at a 2 star hotel around there. Can you find me one?",
            "What's their phone number and address?",
            "Ok, that should work.",
            "Yes, can you make it for 4 days?",
            "No, I wouldn't be checking in until the 10th of March.",
            "Yes, that's right. How much is it per night?",
            "Ok, great. Thanks for your help!",
            "No, that's all. Thanks."
        ],
        "system_utterance": [
            "Sure, where to?",
            "Ok. Where are you leaving from and when?",
            "Ok. What time are you planning to leave?",
            "Alright, and how many tickets do you need?",
            "Ok. To confirm, you want 1 bus ticket from Washington to Philadelphia on March 8th at 2:45 pm. Is that right?",
            "Sorry, there were no tickets available for that time. Is there something else you want?",
            "Sure. To confirm, you want 1 bus ticket from San Francisco to Las Vegas on March 8th at 2:45 pm. Is that right?",
            "Sorry, there weren't any tickets for that either, but there is one for $49 that leaves at 2:50 pm. Would that work?",
            "Ok, your ticket is has been bought.",
            "Sure, there's one 2 star hotel called Beck'S Motor Lodge. How about that?",
            "Their number is +1 415-621-8212 and their address is 2222 Market Street.",
            "Do you want to make a reservation?",
            "Sure. Are you checking in on March 8th?",
            "Ok. To confirm, you want to book 1 room at Beck'S Motor Lodge in San Francisco on March 10th for 4 nights. Is that right?",
            "I've made your reservation. It's $44 per night.",
            "Sure, anything else I can do?",
            "Sure, have a good day."
        ]
    },
    {
        "dialogue_id": "12_00043",
        "service": "Buses_1",
        "service_call": {
            "method": {
                "method": "ReserveHotel",
                "parameters": {
                    "check_in_date": "2019-03-02",
                    "location": "San Francisco",
                    "number_of_rooms": "1",
                    "place_name": "Amsterdam Hostel San Francisco",
                    "stay_length": "2"
                }
            }
        },
        "user_utterance": [
            "I'm taking a bus trip to visit some family and I need some tickets.",
            "I'll need 3 tickets departing on the 10th of March.",
            "I'm leaving from Vegas and I'd like to leave at 3:15 in the afternoon.",
            "I'm going to San Francisco and I'd like to leave today if possible.",
            "Yes, that's correct.",
            "Yes, that will work.",
            "Thanks for your help. Can you also help me find a hotel in that area?",
            "Sure that's fine.",
            "Yes, let's book it.",
            "I'd like to stay for 2 days and check out on the 2nd of March.",
            "Yes, that's great.",
            "Thanks for all your help. That's all I need for now."
        ],
        "system_utterance": [
            "What day are you leaving and how many tickets do you need?",
            "Where are you departing from and what time do you want to leave?",
            "Where are you heading?",
            "Okay, let's confirm: You're booking 3 bus tickets from Las Vegas to San Francisco leaving March 1st at 3:15 pm.",
            "Sorry, I wasn't able to get those tickets. What about the bus leaving at 2:50 pm instead? The cost will be $58.",
            "Okay, your ticket is booked.",
            "I found a 1 star hotel called the Amsterdam Hostel San Francisco that you might like.",
            "Should I reserve the hotel?",
            "Would you like to check in on March 1st? When will you check out?",
            "Okay, please confirm: You're booking 1 room for 2 days at the Amsterdam Hostel San Francisco located in San Francisco, checking in on March 2nd.",
            "Okay, the hotel has been booked.",
            "Okay, have a great day!"
        ]
    },
    {
        "dialogue_id": "12_00044",
        "service": "Buses_1",
        "service_call": {
            "method": {
                "method": "ReserveHotel",
                "parameters": {
                    "check_in_date": "2019-03-09",
                    "location": "Seattle",
                    "number_of_rooms": "3",
                    "place_name": "Crowne Plaza Seattle Downtown",
                    "stay_length": "1"
                }
            }
        },
        "user_utterance": [
            "I need a bus.",
            "I leave Portland to Seattle at quarter past 12 in the afternoon.",
            "It is for 4.",
            "I leave on the 2nd.",
            "That works for me.",
            "That works for me?",
            "What is departure station and 1 transfer?",
            "I need a 3 star hotel.",
            "What is the cost?",
            "I need somewhere with 3 rooms.",
            "I want a 4 star.",
            "Yes, I want it for 1 day on the 9th.",
            "What is the address?",
            "What is the price and is smoking ok?",
            "That is great help.",
            "That is all I need."
        ],
        "system_utterance": [
            "What is destination and arrival and when?",
            "How many tickets?",
            "When are you leaving?",
            "Confirm bus leaving from Portland to Seattle on March 2nd at 12:15 pm for 4.",
            "How about 12:40 pm for $28.",
            "You are now confirmed.",
            "It has 0 tranfsers and leaves Portland Bus Station.",
            "I have a 3 star called Best Western Plus Pioneer Square Hotel Downtown.",
            "It is $63.",
            "I have a 3 star at Courtyard By Marriott Seattle Downtown/Lake Union.",
            "I have a 4 star at Crowne Plaza Seattle Downtown.",
            "Confirm 3 rooms for 1 day on March 9th at Crowne Plaza Seattle Downtown in Seattle.",
            "Address is 1113 6th Avenue.",
            "No smoking and $264.",
            "Is there anything else?",
            "Have a nice day."
        ]
    },
    {
        "dialogue_id": "12_00045",
        "service": "Buses_1",
        "service_call": {
            "method": {
                "method": "ReserveHotel",
                "parameters": {
                    "check_in_date": "2019-03-02",
                    "location": "Los Angeles",
                    "number_of_rooms": "3",
                    "place_name": "Banana Bungalow - Hollywood Hostel",
                    "stay_length": "5"
                }
            }
        },
        "user_utterance": [
            "I'm looking for a bus.",
            "I'm going to travel from Sacramento. I want to leave Friday next week at 9:45 in the morning.",
            "I'll be traveling to San Diego, and I want ticket for 2 people.",
            "No, I actually want to leave from Anaheim, CA on the 1st of this month.",
            "Yes, that's it. Does the bus have zero transfers? And what's station is the destination?",
            "Try to purchase the tickets, but with tickets for four people.",
            "No, I want to go to LAX instead. And with a departure of 4 o\"clock in the evening.",
            "Yes, that's right.",
            "Yeah, try that.",
            "What hotels in that area? Can you do a search?",
            "Do they allow smoking at the hotel?",
            "What other hotels are there? I want one room.",
            "Do they allow smoking at the hotel?",
            "What else hotels are there? And I actually need three rooms.",
            "Okay, that works.",
            "Yes, please book a room. I want to check in on the 2nd of March.",
            "I'll be there for 5 days.",
            "Yeah, that's right. How much is a room per night? And do they all smoking there?",
            "Thanks, you've been really helpful. That's all the help I need."
        ],
        "system_utterance": [
            "Where will you be traveling from. And what date and time do you want to leave?",
            "Where are you traveling to? And how many tickets do you want?",
            "I'll get you 2 tickets for Sacramento to San Diego leaving on March 8th at 9:45 am. Are all the details correct?",
            "I'll get you tickets for a bus leaving from Anaheim on March 1st. Is that correct?",
            "I'm sorry but the ticket purchase did not go through. Do you need me for anything else?",
            "I'll get you 4 tickets for Anaheim to San Diego leaving on March 1st at 9:45 am. Is that correct?",
            "So you'll be going to Los Angeles with a departure of 4 pm?",
            "I'm sorry, but the ticket purchase did not go through. Do you want to try the bus leaving at 4:10 pm? It is $13.",
            "The tickets have been purchased.",
            "There are 10 hotels that match. Ac Hotel By Marriott Beverly Hills is a 2 star hotel.",
            "No, there is not smoking permitted at the hotel.",
            "There are 9 hotels that march. Airtel Plaza Hotel has 3 stars.",
            "Yes, there is smoking allowed.",
            "There are 8 hotels that match. Banana Bungalow - Hollywood Hostel has 1 star.",
            "Do you want to book a room?",
            "How many days will you be there?",
            "I'll book you 3 rooms at Banana Bungalow - Hollywood Hostel in Los Angeles. Check in is March 2nd and you'll be staying for 5 days. Are all the details correct?",
            "I've book the rooms. Smoking is allowed. And it is $96 for a room per night.",
            "Have a fine day and take care."
        ]
    },
    {
        "dialogue_id": "12_00046",
        "service": "Buses_1",
        "service_call": {
            "method": {
                "method": "ReserveHotel",
                "parameters": {
                    "check_in_date": "2019-03-06",
                    "location": "Long Beach",
                    "number_of_rooms": "3",
                    "place_name": "Courtyard By Marriott Long Beach Airport",
                    "stay_length": "4"
                }
            }
        },
        "user_utterance": [
            "I want to book bus tickets",
            "I leave this saturday",
            "I am traveling from SFO to Long beach, CA at 4:30 pm",
            "Just 1 ticket",
            "Cool, Does it have 1 transfer? what is the arrival station?",
            "Cool, Thanks. I also need three rooms in a three star hotel",
            "Cool, book this.",
            "It would be four days",
            "No, it is wednesday next week",
            "Cool, can you smoke here",
            "Thanks again. That would be all"
        ],
        "system_utterance": [
            "What date do you leave on?",
            "What time do you leave and what is the destination and departure station?",
            "How many tickets do you want?",
            "Booking 1 ticket on the bus from San Francisco to long beach on march 2nd at 4:30 pm",
            "It has 0 transfers and reaches downtown station",
            "How about the 3 star courtyard by marriott long beach airport?",
            "What is the stay duration?",
            "Is the check in March 2nd?",
            "Booking 3 rooms at courtyard by marriott long beach airport in Long beach on march 6th for 4 day",
            "Booking confirmed. The place does not allow smoking",
            "Have a great time there."
        ]
    },
    {
        "dialogue_id": "12_00047",
        "service": "Buses_1",
        "service_call": {
            "method": {
                "method": "ReserveHotel",
                "parameters": {
                    "check_in_date": "2019-03-09",
                    "location": "Sacramento",
                    "number_of_rooms": "1",
                    "place_name": "Best Western Plus Sutter House",
                    "stay_length": "2"
                }
            }
        },
        "user_utterance": [
            "I would like to reserve a bus from Long Beach.",
            "It is for one and I'm leaving monday next week.",
            "I am leaving 10:15 in the morning.",
            "I will be going to Sacramento.",
            "Yes, that is good. What bus station am I going to?",
            "Yes, that is good.",
            "Would you look for hotels in the area as well?",
            "That is good.",
            "Yes, I need to reserve the hotel.",
            "I need two days checking in on the 9th.",
            "Sure that is good. What is the phone number and is smoking allowed at the hotel?",
            "Thanks that has been helpful.",
            "No you have been helpful."
        ],
        "system_utterance": [
            "What number of tickets and when are you leaving?",
            "What time are you leaving?",
            "Where will you be going?",
            "Please confirm a ticket on the bus leaving Long Beach to Sacramento March 4th at 10:15 am for 1.",
            "The destination is Sacramento Valley Station. Sorry, I couldn't purchase the ticket. How about the bus leaving 10:20 am for $68?",
            "The ticket is confirmed.",
            "A 1 star hotel called Best Western Plus Sutter House is there.",
            "Do you wish to reserve the hotel?",
            "How long will you be staying and will check in be March 4th?",
            "Please confirm a hotel in Best Western Plus Sutter House for March 9th 2 days in Sacramento for 1 room.",
            "The hotel has been successfully booked and the number is +1 916-441-1314. There is no smoking allowed on the property.",
            "What else can I help with?",
            "Bye and have a nice day."
        ]
    },
    {
        "dialogue_id": "12_00048",
        "service": "Buses_1",
        "service_call": {
            "method": {
                "method": "ReserveHotel",
                "parameters": {
                    "check_in_date": "2019-03-07",
                    "location": "Los Angeles",
                    "number_of_rooms": "1",
                    "place_name": "Ac Hotel By Marriott Beverly Hills",
                    "stay_length": "5"
                }
            }
        },
        "user_utterance": [
            "I would like to reserve a bus.",
            "That's for one person leaving Long Beach 2:15 in the afternoon.",
            "I would like to go to LA.",
            "I am leaving March 6th.",
            "Yes, that works.",
            "Yes, that works.",
            "Can you look for hotels in that area as well?",
            "That sounds good.",
            "Yes, I would like to reserve a hotel.",
            "I am checking in March 7th for five days.",
            "Sure that is great.",
            "What is the phone?",
            "Thanks for the help.",
            "No, you've been helpful."
        ],
        "system_utterance": [
            "What number of tickets and what time are you leaving and where?",
            "Where is your destination?",
            "When are you leaving?",
            "Please confirm a bus ticket leaving from Long Beach to Los Angeles on March 6th at 2:15 pm for 1 person.",
            "Sorry I couldn't buy a ticket for a bus leaving 1:50 pm for $10.",
            "The ticket is confirmed.",
            "I have 10 hotels including one called Ac Hotel By Marriott Beverly Hills a 2 star hotel.",
            "Do you wish to reserve the hotel?",
            "How about check in March 6th? What is your length of stay?",
            "Please confirm a hotel on March 7th for 5 days in Los Angeles 1 room called Ac Hotel By Marriott Beverly Hills.",
            "The hotel is successfully booked.",
            "The phone is +1 323-852-7000.",
            "What else can I help with?",
            "Bye, have a nice day."
        ]
    },
    {
        "dialogue_id": "12_00049",
        "service": "Buses_1",
        "service_call": {
            "method": {
                "method": "ReserveHotel",
                "parameters": {
                    "check_in_date": "2019-03-11",
                    "location": "San Francisco",
                    "number_of_rooms": "3",
                    "place_name": "Argonaut Hotel",
                    "stay_length": "1"
                }
            }
        },
        "user_utterance": [
            "I would like to reserve a bus to go to San Francisco on the 11th of this month.",
            "I'd like to leave at half past 2 in the afternoon.",
            "I need 3 tickets out of LAX.",
            "Yes, that's right.",
            "Yes, that will work.",
            "Thanks for all your help. Could you help me find a hotel there too?",
            "What's their number?",
            "Can you smoke in the hotel?",
            "Are there any other options? I need 3 rooms.",
            "That would work. I'd like to reserve a room.",
            "I'd like to check in on the 12th of this month.",
            "I need to stay for one day. I'd like to check in on the 11th of this month.",
            "Yes, that would work.",
            "Thanks for all the help. That's all!"
        ],
        "system_utterance": [
            "What time would you like to leave?",
            "Where are you leaving from? And how many tickets do you require?",
            "Please confirm the following: You would like 3 bus tickets leaving from Los Angeles and heading to San Francisco on March 11th at 2:30 pm.",
            "I could not buy the ticket. Would a bus leaving at 2:20 pm work? It costs $48.",
            "The tickets have been bought.",
            "I have found 10 hotels that might work. There's a 1 star hotel called Amsterdam Hostel San Francisco that might work.",
            "Their number is +1 415-673-3277.",
            "No, you can't smoke on the property.",
            "There's a 4 star hotel called Argonaut Hotel.",
            "Are you wanting to check in on March 11th?",
            "How long do you want to stay?",
            "Please confirm the following: You want 3 rooms for 1 day on March 11th at the Argonaut Hotel in San Francisco.",
            "The rooms have been booked.",
            "Farewell, have a great day!"
        ]
    },
    {
        "dialogue_id": "12_00050",
        "service": "Buses_1",
        "service_call": {
            "method": {
                "method": "ReserveHotel",
                "parameters": {
                    "check_in_date": "2019-03-08",
                    "location": "Long Beach",
                    "number_of_rooms": "1",
                    "place_name": "Hyatt Centric The Pike Long Beach",
                    "stay_length": "6"
                }
            }
        },
        "user_utterance": [
            "I would like to make a bus reservation.",
            "I would like to leave on March 8th.",
            "The ticket is for 3 and I'm going to Long Beach from Fresno, CA.",
            "I would like to leave at 17:15.",
            "Yes, that is good.",
            "Sounds good to me.",
            "What bus station will I leave from and what bus station will I get to?",
            "Thank you for helping. Would you be able to find 4 star hotels in the area too? I would like 1 room.",
            "Could you tell me the street address and phone number?",
            "Sounds nice. I want to reserve the hotel.",
            "Sounds nice. I want to book for six days.",
            "That sounds good.",
            "Thanks, that was a great help.",
            "No, thanks. That was a good help"
        ],
        "system_utterance": [
            "When will you leave?",
            "How many tickets would you like? Where are you leaving from and where are you going?",
            "What time would you like to leave?",
            "Could you confirm that you want a bus ticket from Fresno to Long Beach on March 8th at 5:15 pm for 3?",
            "Sorry, I was unable to purchase the ticket. What about a bus leaving at 5:10 pm that costs $37?",
            "Your ticket was confirmed.",
            "YOu will go from Fresno Station to Downtown Station.",
            "I have 3 hotels that should match. There is a hotel called Hyatt Centric The Pike Long Beach? It's a 4 star.",
            "The phone number is +1 562-432-1234 and address is 285 Bay Street.",
            "How long will you stay? Would you like to check in on March 8th?",
            "Could you confirm that you want a hotel in Hyatt Centric The Pike Long Beach and that you will check in March 8th for 6 days? This hotel is in Long Beach and you want 1 room.",
            "I have booked the hotel successfully. It is $360 per night.",
            "Would I be able to assist with something else?",
            "Bye, have a great day."
        ]
    },
    {
        "dialogue_id": "12_00051",
        "service": "Buses_1",
        "service_call": {
            "method": {
                "method": "ReserveHotel",
                "parameters": {
                    "check_in_date": "2019-03-12",
                    "location": "San Francisco",
                    "number_of_rooms": "1",
                    "place_name": "Bei Hotel San Francisco",
                    "stay_length": "2"
                }
            }
        },
        "user_utterance": [
            "I need to reserve a seat on the bus to Vegas.",
            "2 people to SFO.",
            "I am leaving on 12th of March at 3 in the afternoon.",
            "Yes, that is correct.",
            "That will be fine.",
            "Can you find 1 room in a 3 star hotel?",
            "That is perfect, book that hotel.",
            "Yes, and staying for 2 days.",
            "Yes, what is the street address and price per night?",
            "Thanks, that is all I need."
        ],
        "system_utterance": [
            "How many tickets? Where are you going?",
            "When and what time are you leaving?",
            "Please confirm, bus tickets for 2 from Las Vegas to San Francisco on March 12th at 3 pm.",
            "Sorry, that ticket wasn't available. I found another seat at 2:50 pm for $55.",
            "Your ticket is confirmed.",
            "I found 8 hotels including Bei Hotel San Francisco, it is a 3 star hotel.",
            "Are you checking in on March 12th?",
            "Please confirm, 1 room at Bei Hotel San Francisco on March 12th for 2 day in San Francisco.",
            "The reservation is complete. The address is 50 8th Street and the cost per night is $156.",
            "Have a nice day."
        ]
    },
    {
        "dialogue_id": "12_00052",
        "service": "Buses_1",
        "service_call": {
            "method": {
                "method": "ReserveHotel",
                "parameters": {
                    "check_in_date": "2019-03-11",
                    "location": "Sacramento",
                    "number_of_rooms": "2",
                    "place_name": "Sheraton Grand Sacramento Hotel",
                    "stay_length": "3"
                }
            }
        },
        "user_utterance": [
            "one person sacramento, ca",
            "11:45 am and leaving 10th of this month",
            "san diego is where",
            "yes that works",
            "yes that works",
            "four star 3 rooms",
            "any smoking there?",
            "2 different rooms",
            "I wanna get it",
            "on the 11th 3 days",
            "that works for me",
            "tell me address",
            "thanks a lot"
        ],
        "system_utterance": [
            "what time then?",
            "where from are you leaving?",
            "san diego sacramento march 10th 11:45 am for 1",
            "the bus at 11:40 am $68",
            "it is good",
            "hyatt regency sacramento 4 star",
            "$240 a night",
            "3 hotels sheraton grand Sacramento hotel 4 stars",
            "how long then on march 10th?",
            "sheraton grand sacramento hotel march 11th sacramento 3 days 2 rooms",
            "this is good",
            "13th and j street",
            "bye bye now"
        ]
    },
    {
        "dialogue_id": "12_00053",
        "service": "Buses_1",
        "service_call": {
            "method": {
                "method": "ReserveHotel",
                "parameters": {
                    "check_in_date": "2019-03-08",
                    "location": "San Diego",
                    "number_of_rooms": "2",
                    "place_name": "Best Western San Diego/Miramar Hotel",
                    "stay_length": "5"
                }
            }
        },
        "user_utterance": [
            "I would like to reserve the bus to San Diego from Long Beach.",
            "I need for one person leaving quarter past 7 in the morning the 4th of March.",
            "Yes, that will be good for me.",
            "Yes, that is good for me.",
            "Would you look for hotels in that area too for 2 rooms at a 2 star hotel?",
            "What other hotels match the criteria?",
            "Will smoking be allowed at the hotel and what is the price a night?",
            "That is good. I would like to make the reservation to the hotel for five days.",
            "I would like to check in the 8th.",
            "Sure that is good.",
            "Thanks for your help and that is all."
        ],
        "system_utterance": [
            "When are you leaving and how many tickets are needed?",
            "Please confirm a ticket for a bus leaving from Long Beach to San Diego March 4th at 7:15 am for 1 person.",
            "Sorry I couldn't purchase the ticket. What about a bus leaving 7 am that costs $23?",
            "The ticket is confirmed.",
            "Best Western Mission Bay is a great 2 star hotel.",
            "The Best Western San Diego/Miramar Hotel is a 2 star hotel.",
            "No, smoking isn't allowed at the property and it is $126 a night.",
            "Would you like to check in on March 4th?",
            "Please confirm a hotel in Best Western San Diego/Miramar Hotel March 8th check in for 5 days in San Diego for 2 rooms.",
            "You've successfully booked the hotel.",
            "Bye and have a great day!"
        ]
    },
    {
        "dialogue_id": "12_00054",
        "service": "Buses_1",
        "service_call": {
            "method": {
                "method": "ReserveHotel",
                "parameters": {
                    "check_in_date": "2019-03-09",
                    "location": "San Francisco",
                    "number_of_rooms": "1",
                    "place_name": "Bei Hotel San Francisco",
                    "stay_length": "5"
                }
            }
        },
        "user_utterance": [
            "Please reserve for me a bus.",
            "For 2 people from Sacramento at 13:15.",
            "On 9th of this month I plan to go.",
            "In Long Beach I want to go.",
            "No.Please change it on later today.",
            "No.I would like to go to San Fran.",
            "Yes perfect.I also need to know the bus station from where I will leave and if the bus have 0 transfers.",
            "Yes is good.",
            "You can find me in that area a hotel?",
            "Other option you have?I want 1 room at a three star hotel.",
            "Sounds very good.Reserve for 5 days for me at this hotel",
            "In 9th of this month will be okay for me.",
            "That's sounds perfect.",
            "Thank you for helping me.That's all."
        ],
        "system_utterance": [
            "Tell me at what time you want to leave and from where.You need how many tickets?",
            "You plan to leave when?",
            "Where you [plan to go?",
            "You need 2 tickets for the bus that leave from Sacramento to Long Beach on March 9th at 1:15 pm.",
            "Destination is Long Beach on March 1st.I'm right?",
            "Destination is San Francisco for 2 people.Is that correct?",
            "Sorry but buying tickets was not made.Sacramento Valley Station is the origin station and has 0 transfers.What do you think about the bus that depart at 1:20 pm and cost $22?",
            "The tickets was bought successfully.",
            "I have 10 option for you.A 1 star hotel named Amsterdam Hostel San Francisco.",
            "I have 10 option for you.First is a 3 star hotel named Bei Hotel San Francisco.",
            "Check in date will be on March 1st?",
            "You want 1 room for 5 days at Bei Hotel San Francisco in San Francisco.Check in date will be on March 9th.",
            "Buying was made successfully.",
            "Have a great day!Bye."
        ]
    },
    {
        "dialogue_id": "12_00055",
        "service": "Buses_1",
        "service_call": {
            "method": {
                "method": "ReserveHotel",
                "parameters": {
                    "check_in_date": "2019-03-12",
                    "location": "Anaheim",
                    "number_of_rooms": "1",
                    "place_name": "Anaheim Desert Inn And Suites",
                    "stay_length": "2"
                }
            }
        },
        "user_utterance": [
            "i am looking for a bus for two people from sacramento",
            "i am going to anaheim at 6:30 in the evening",
            "i am leaving on the 10th",
            "yes please",
            "that works",
            "thank you, can you also find me a hotel in the area",
            "perfect, please book 1 room on march 12th",
            "i am staying for two days",
            "yes please. is smoking allowed",
            "what is their address",
            "thank you",
            "no that's it"
        ],
        "system_utterance": [
            "what time are you leaving and where are you going to",
            "when are you leaving",
            "please confirm your bus ticket for 2 from sacramento to anaheim on march 10th at 6:30 pm",
            "sorry they are booked. what about 6:50 pm ticket for $70",
            "your ticket is booked",
            "what about a 2 star hotel called anaheim desert inn and suites",
            "how long are you staying",
            "please confirm your booking for 1 room at anaheim desert inn and suites in anaheim for 2 days on march 12th",
            "no they do not allow smoking",
            "they are located in 1600 south harbor boulevard",
            "what else can i do for you",
            "have a nice day"
        ]
    },
    {
        "dialogue_id": "12_00056",
        "service": "Buses_1",
        "service_call": {
            "method": {
                "method": "ReserveHotel",
                "parameters": {
                    "check_in_date": "2019-03-08",
                    "location": "Las Vegas",
                    "number_of_rooms": "1",
                    "place_name": "Budget Suites Of America",
                    "stay_length": "3"
                }
            }
        },
        "user_utterance": [
            "I would like to use the bus.",
            "It is for three. I would like to leave at 1:15 in the afternoon from Sacramento.",
            "I would like to go to Las Vegas.",
            "I will leave on March 1st.",
            "Yes, that is fine.",
            "Sounds great.",
            "Thank you for helping. Would find hotels in that area as well?",
            "Could you tell me the price per night?",
            "Do you have something else that could match my criteria? I need 1 room and want a smoking room.",
            "Sounds nice. I want to reserve it.",
            "I will stay for three days on 8th of march.",
            "Sure, sounds good. What is the street address?",
            "Thank you, you have been helpful.",
            "No, thank you. You have been helpful."
        ],
        "system_utterance": [
            "How many tickets are you needing? What time will you leave and from where?",
            "Where do you want to go?",
            "When will you leave?",
            "Could you confirm that you want to have a bus leaving from Sacramento to Las Vegas on March 1st at 1:15 pm for 3?",
            "Sorry, I couldnot buy the ticket. Do you want to leave at 1:20 pm? The bus ticket costs $69.",
            "Your ticket has been confirmed.",
            "There is a hotel by the name of Best Western Plus Las Vegas West which is a 3 star.",
            "It is $117 per night.",
            "I have 3 hotels that should work. What about budget suites of America? It's a 1 star.",
            "Would you like to check in on March 1st? How long will you stay?",
            "Could you confirm that you want to find a hotel in Budget Suites of America? You will check in on March 8th and stay for 3 days in Las Vegas. You need 1 room.",
            "I have booked it. The address is 2219 North Rancho Drive.",
            "Do you need help with anything else?",
            "Thanks, good bye."
        ]
    },
    {
        "dialogue_id": "12_00057",
        "service": "Buses_1",
        "service_call": {
            "method": {
                "method": "ReserveHotel",
                "parameters": {
                    "check_in_date": "2019-03-06",
                    "location": "San Francisco",
                    "number_of_rooms": "3",
                    "place_name": "Amsterdam Hostel San Francisco",
                    "stay_length": "4"
                }
            }
        },
        "user_utterance": [
            "Can you help me book bus tickets?",
            "Three people going to SF.",
            "I will be leaving from Sacramento, CA the 14th of this month in the morning 11:30.",
            "No. Make that on March 1st.",
            "Yes. That's correct. Can you tell me the number of transfers and the arrival bus station?",
            "Okay. Thank you.",
            "I will also need to find a hotel?",
            "Okay. that one sounds good.",
            "Yes. I will need three rooms please.",
            "Arriving on Wednesday next week and staying for 4 days.",
            "Okay. This one sounds good.",
            "Thanks for your help. That's all."
        ],
        "system_utterance": [
            "Sure. How many tickets and where is your destination?",
            "What is your departure location and date?",
            "Please confirm you want me to book 3 tickets on the bus departing from Sacramento on March 14th at 11:30 am and arriving in San Francisco.",
            "Please confirm you want to book tickets on the bus from Sacramento on March 1st.",
            "The bus arriving at Salesforce Transit Center has 0 transfers. The booking was not successful. Should I try the bus departing at 11 am for $24?",
            "Your bus ticket reservation was a success.",
            "The Amsterdam Hostel San Francisco is a 1 star area hotel.",
            "Would you like me to book any rooms?",
            "Will you be checking in on March 1st? How long will you be there?",
            "Please confirm you want to book 3 rooms at the Amsterdam Hostel San Francisco checking in on March 6th for 4 days in San Francisco.",
            "The hotel rooms have been successfully booked.",
            "You're welcome. Enjoy your day."
        ]
    },
    {
        "dialogue_id": "12_00058",
        "service": "Buses_1",
        "service_call": {
            "method": {
                "method": "ReserveHotel",
                "parameters": {
                    "check_in_date": "2019-03-10",
                    "location": "Sacramento",
                    "number_of_rooms": "1",
                    "place_name": "Best Western Plus Sutter House",
                    "stay_length": "3"
                }
            }
        },
        "user_utterance": [
            "I need to reserve a bus leaving at 12:15 in the afternoon.",
            "It is for three people leaving today and going to Sacramento, CA.",
            "I'll be leaving from Anaheim.",
            "Yes. Also what's the total and what is bus station I'll arive at?",
            "Okay. Sounds great.",
            "Can you also find me hotel rooms in that area. Thanks.",
            "Where are they located?",
            "Is it a non smoking hotel?",
            "Can you reserve one room at the hotel for me?",
            "Staying for three days.",
            "No. Checking in on the 10th of this month.",
            "Yes. Can I get their phone number and nightly rate?",
            "Thanks for everything.",
            "No. That will be all."
        ],
        "system_utterance": [
            "What is your departure date and your arrival city? How many in your party?",
            "Leaving from where?",
            "Please confirm you want to book bus tickets for 3 leaving from Anaheim on March 1st at 12:15 pm and going to Sacramento.",
            "The bus will depart at 12:10 pm arrive at Sacramento Valley Station for a total of $62.",
            "Your ticket has been booked.",
            "The Best Western Plus Sutter House is a 1 star hotel.",
            "Their address is 1100 H Street.",
            "It is a non smoking hotel.",
            "How many days will you be there?",
            "Are you checking in on March 1st?",
            "Please confirm you want to book 1 room at the Best Western Plus Sutter House on March 10th for 3 days in Sacramento.",
            "They can be reached at +1 916-441-1314. Their nightly rate is $50. Your room reservation was a success.",
            "Can I help you with anything else?",
            "Okay. Enjoy your day. Goodbye."
        ]
    },
    {
        "dialogue_id": "12_00059",
        "service": "Buses_1",
        "service_call": {
            "method": {
                "method": "ReserveHotel",
                "parameters": {
                    "check_in_date": "2019-03-10",
                    "location": "Fresno",
                    "number_of_rooms": "1",
                    "place_name": "Doubletree By Hilton Hotel Fresno Convention Center",
                    "stay_length": "2"
                }
            }
        },
        "user_utterance": [
            "I would like to reserve a bus for 2 people to Fresno, CA.",
            "I would like to leave at quarter to 4 in the afternoon from LA the 10th of this month.",
            "Yes, that is good and what is the bus station am I leaving from?",
            "Yes, that is good for me.",
            "Thanks for your help. Can you look for hotels in the area that are three star.",
            "That is good. I'd like to reserve the hotel.",
            "Sure that is good and I'll be staying 2 days.",
            "Sure that is great.",
            "What is the phone number and is smoking allowed at the hotel?",
            "Thanks for the help. That is all."
        ],
        "system_utterance": [
            "When and where are you leaving from?",
            "Please confirm you'd like a ticket from Los Angeles to Fresno leaving March 10th at 3:45 pm for 2 people.",
            "The origin is Union Station. I couldn't buy the ticket. What about 3:30 pm for $34.",
            "The ticket is confirmed.",
            "I have 4 hotels matching called Doubletree By Hilton Hotel Fresno Convention Center that is 3 stars.",
            "Would you like to check in March 10th and how long will you be staying?",
            "Please confirm a hotel in Doubletree By Hilton Hotel Fresno Convention Center checking in March 10th for 2 days in Fresno for 1 room.",
            "The hotel has been successfully booked.",
            "The phone number is +1 559-268-1000 and smoking isn't allowed on the property.",
            "Bye and have a nice day."
        ]
    },
    {
        "dialogue_id": "12_00060",
        "service": "Buses_1",
        "service_call": {
            "method": {
                "method": "ReserveHotel",
                "parameters": {
                    "check_in_date": "2019-03-12",
                    "location": "Sacramento",
                    "number_of_rooms": "2",
                    "place_name": "Courtyard By Marriott Sacramento Midtown",
                    "stay_length": "1"
                }
            }
        },
        "user_utterance": [
            "Can you find me a bus?",
            "I'd like a bus from Long Beach to Sacramento, CA for March 4th.",
            "I'll need three.",
            "In the morning 10:30.",
            "That is correct.",
            "Can you check some hotels there? I need two rooms and I'd like a three star hotel.",
            "That sounds good.",
            "Yes please. I'm planning to stay one day.",
            "No, I'd like to check in the 12th of March.",
            "Yes, that's perfect.",
            "Thank you for all your help. That's all I needed."
        ],
        "system_utterance": [
            "When did you want to leave and where are you going?",
            "How many tickets shall I order?",
            "Is there a preferred time you'd like to leave?",
            "To verify: You would like 3 tickets on a bus from Long Beach to Sacramento leaving at 10:30 am March 4th.",
            "Your tickets are confirmed.",
            "I found 10 that match your request. The Courtyard By Marriott Sacramento Midtown is a 3 star.",
            "Shall I make a reservation?",
            "Did you want to check in March 4th?",
            "To confirm: You would like 2 rooms at the Courtyard by Marriott Sacramento Midtown for 1 night, March 12th in Sacramento.",
            "Your rooms are confirmed.",
            "Bye, have a great day!"
        ]
    },
    {
        "dialogue_id": "12_00061",
        "service": "Buses_1",
        "service_call": {
            "method": {
                "method": "ReserveHotel",
                "parameters": {
                    "check_in_date": "2019-03-09",
                    "location": "Portland",
                    "number_of_rooms": "1",
                    "place_name": "Aloft Portland Airport At Cascade Station",
                    "stay_length": "4"
                }
            }
        },
        "user_utterance": [
            "I need to find a bus for three people going to Portland.",
            "I want to leave from Vancouver on the 8th of this month at the evening 7.",
            "Yes, that's correct. Which station am I leaving from and does it have one transfer?",
            "Yes, that's fine.",
            "Can you find me a hotel in that area?",
            "That sounds good.",
            "Yes, please.",
            "I wanted to check in on the 9th of March.",
            "I want to stay for 4 days.",
            "Yes, that's correct.",
            "Thank you for all your help.",
            "No, thank you. That's all."
        ],
        "system_utterance": [
            "What day and time would you like to leave, and where are you traveling from?",
            "Okay, I am booking 3 tickets for a bus traveling from Vancouver to Portland on March 8th at 7 pm. Is this correct?",
            "This bus leaves from Pacific Central Station and has 0 transfers. Unfortunately,I was unable to book those tickets. There is another bus leaving at 7:20 pm for $42. Does that work for you?",
            "Your tickets have been booked successfully.",
            "The Aloft Portland Airport At Cascade Station has a 3 star rating. How does that sound?",
            "would you like to book a room?",
            "Did you want to check in on March 8th?",
            "How long will you be staying?",
            "Okay, I am booking 1 room at Aloft Portland Airport At Cascade Station in Portland, checking in on March 9th and staying for 4 days. Is this correct?",
            "Your room has been booked successfully.",
            "Is there anything else I can help you with?",
            "Have a great day!"
        ]
    },
    {
        "dialogue_id": "12_00062",
        "service": "Buses_1",
        "service_call": {
            "method": {
                "method": "ReserveHotel",
                "parameters": {
                    "check_in_date": "2019-03-10",
                    "location": "Long Beach",
                    "number_of_rooms": "1",
                    "place_name": "Best Western Of Long Beach",
                    "stay_length": "3"
                }
            }
        },
        "user_utterance": [
            "I want to reserve a bus so I can go to Long Beach, CA. It's for 3 people and I want to leave at 5:15 pm.",
            "I am departing from SD and plan to leave on the 7th of March.",
            "Yes, that's correct.",
            "Great, do it again!",
            "Can you find a hotel too?",
            "Sounds great and cheap.",
            "Yes, I want 1 room for 3 days. I plan to check in on the 10th of this month.",
            "Great, do it!",
            "Thanks, that's all I want."
        ],
        "system_utterance": [
            "What day are you leaving? And what city are you leaving from?",
            "Please confirm the following: You want 3 tickets for the bus leaving San Diego on March 7th, 5:15 pm, and arriving in Long Beach.",
            "Sorry I couldn't make a reservation. How about the bus departing at 5:10 pm and costs $26.",
            "Your ticket has been confirmed!",
            "Yes, I found 10 hotels in Long Beach. One is the Best Western of Long Beach. It's a 2 star hotel.",
            "Do you want a reservation?",
            "Please confirm the following details: You want to check in on March 10th at the Best Western of Long Beach in Long Beach. You want 1 room and will be staying for 3 days.",
            "The hotel reservation was successful!",
            "Have a great day!"
        ]
    },
    {
        "dialogue_id": "12_00063",
        "service": "Buses_1",
        "service_call": {
            "method": {
                "method": "ReserveHotel",
                "parameters": {
                    "check_in_date": "2019-03-02",
                    "location": "Fresno",
                    "number_of_rooms": "1",
                    "place_name": "Doubletree By Hilton Hotel Fresno Convention Center",
                    "stay_length": "3"
                }
            }
        },
        "user_utterance": [
            "I'd like to get a bus ticket. I'm wanting to go to San Diego next Friday.",
            "I need 4 tickets leaving from Long Beach.",
            "I'd like to leave at 8:15 in the night.",
            "Yes, that would work.",
            "Could you try again? I'd like to go to Fresno.",
            "Yes, that would work.",
            "Could you try again? I'd like to leave from Sacramento on March 1st.",
            "Yes, that would work.",
            "Yes, that would work.",
            "Thanks for your help. Could you help me find a hotel there?",
            "That works. I want to reserve a room.",
            "I'm staying for 3 days, starting on Saturday this week.",
            "Yes, that would work.",
            "Thanks for all your help. That's all!"
        ],
        "system_utterance": [
            "How many tickets would you like? And where are you leaving from?",
            "What time would you like to leave?",
            "Please confirm the following: You want 4 tickets for a bus that's leaving Long Beach and heading to San Diego on March 8th at 8:15 pm.",
            "I was unable to buy the ticket. Is there anything else I can help with?",
            "Please confirm the following: You want 4 tickets for a bus leaving Long Beach and heading to Fresno on March 8th at 8:15 pm.",
            "Sorry, the tickets couldn't be bought. Is there anything else?",
            "Please confirm the following: You'd like 4 bus tickets for a bus leaving from Sacramento and heading to Fresno on March 1st at 8:15 pm.",
            "Sorry, the tickets couldn't be bought. Would a bus leaving at 7:50 pm work? It costs $33.",
            "The tickets have been bought.",
            "There's a 3 star hotel called Doubletree By Hilton Hotel Fresno Convention Center.",
            "How long do you need it for? And are you wanting to check in on March 1st?",
            "Please confirm the following: You want 1 room for 3 days starting on March 2nd at Doubletree By Hilton Hotel Fresno Convention Center in Fresno.",
            "The room has been booked.",
            "Have a great day!"
        ]
    },
    {
        "dialogue_id": "12_00064",
        "service": "Flights_3",
        "service_call": {
            "method": {
                "method": "TransferMoney",
                "parameters": {
                    "account_type": "savings",
                    "recipient_account_type": "checking",
                    "recipient_name": "Li",
                    "transfer_amount": "1760"
                }
            }
        },
        "user_utterance": [
            "Find a one way flight for me.",
            "I'm going to Portland from Los Angeles on March 7th.",
            "Ok. Check my savings balance.",
            "Transfer one thousand seven hundred and sixty bucks from checking to Li.",
            "Yes.",
            "Thanks.",
            "No, thanks."
        ],
        "system_utterance": [
            "Departure date and city? Destination?",
            "I found 5. There's an Alaska Airlines flight with 0 layovers leaving 11:45 am for $145.",
            "You have $14,774.69 in savings.",
            "Please confirm: send $1,760 from savings to Li in their checking.",
            "Transfer started.",
            "Anything else for today?",
            "Have a nice day."
        ]
    },
    {
        "dialogue_id": "12_00065",
        "service": "Flights_3",
        "service_call": {
            "method": {
                "method": "TransferMoney",
                "parameters": {
                    "account_type": "savings",
                    "recipient_account_type": "savings",
                    "recipient_name": "Jasbir",
                    "transfer_amount": "900"
                }
            }
        },
        "user_utterance": [
            "Get me a one way flight to Las Vegas.",
            "I want to depart San Francisco on the 11th and I have 0 bags to check.",
            "How many passengers does the cost cover and does when does the flight land?",
            "Find me an American Airlines flight.",
            "That works. Check the balance of my savings account.",
            "That is good.",
            "Yes, transfer 900 dollars to someone's savings account.",
            "Jasbir will receive the money.",
            "That is right.",
            "Thanks a lot.",
            "No, that is all. Thanks."
        ],
        "system_utterance": [
            "What is your departing city and when are you going?",
            "Alaska Airlines has a flight with 0 layovers, a departure time of 10:25 am and a total cost of $93 per ticket.",
            "The ticket price is for 1 person and the flight lands that same day.",
            "American Airlines has a flight with 0 layovers, a departure time of 5:25 am and a cost of $106 per ticket.",
            "Your have $8,844.18 in your savings account.",
            "Do you want to transfer money?",
            "Who will be receiving the money?",
            "You want to transfer $900 from your savings account to the savings account of Jasbir, correct?",
            "Your money has been sent.",
            "Do you need more help?",
            "Have a good day."
        ]
    },
    {
        "dialogue_id": "12_00066",
        "service": "Flights_3",
        "service_call": {
            "method": {
                "method": "TransferMoney",
                "parameters": {
                    "account_type": "checking",
                    "recipient_account_type": "checking",
                    "recipient_name": "Philip",
                    "transfer_amount": "690"
                }
            }
        },
        "user_utterance": [
            "I'd like to find a one way flight.",
            "I would like to fly Tuesday next week to Portland.",
            "I am looking for flights from Los Angeles.",
            "I need to check savings balances.",
            "Let me know the balance of the checking account.",
            "I would like to make a transfer.",
            "Transfer for me six hundred and ninety bucks.",
            "I'd like to send it to Philip.",
            "Yes, that is great.",
            "Thanks for the help.",
            "Nothing else to help."
        ],
        "system_utterance": [
            "What is the date you'd like to travel, and where are you hoping to go?",
            "What city do you want to depart from?",
            "I have 5 flights for you with Alaska Airlines at 11:45 am with 0 layovers for $125.",
            "The balance from savings is $20,252.51.",
            "The balance is $13,950.55 from the checking account.",
            "What amount of money do you want to transfer.",
            "Who do you wish to send money to?",
            "Please confirm checking account transfer $690 to Philip to his checking.",
            "The transfer is a success.",
            "What else can I do for you?",
            "Have a great day."
        ]
    },
    {
        "dialogue_id": "12_00067",
        "service": "Flights_3",
        "service_call": {
            "method": {
                "method": "TransferMoney",
                "parameters": {
                    "account_type": "savings",
                    "recipient_account_type": "checking",
                    "recipient_name": "Yumi",
                    "transfer_amount": "1170"
                }
            }
        },
        "user_utterance": [
            "Would you help me find a one way flight please?",
            "On the 5th from Los Angeles please.",
            "That would be Phoenix.",
            "How about something from San Francisco?",
            "Where does it fly out of?",
            "Does that flight get in on the dar after? When does it get to my destination city?",
            "How about something else? And it's just for 1 passenger.",
            "Okay, thanks. Oh, I'd like to verify my bank balance please.",
            "My savings balance please.",
            "Okay, thank you.",
            "Yes, I think I do.",
            "I'd like to transfer 1,170 dollars to Yumi please.",
            "Yes, thank you.",
            "How long should that take to complete?",
            "Thank you very much."
        ],
        "system_utterance": [
            "Certainly. On what date and where would you like to leave from?",
            "And your destination?",
            "There is an Alaska Airlines flight leaving at 10:20 pm with 0 layovers and that's a $90 ticket.",
            "There are 4 flights. American Airlines has a 12:25 pm flight for $101 with 0 layovers.",
            "That leaves from SFO International Airport.",
            "It has an arrival time of 2:32 pm and it's on the same day.",
            "There is a flight on Delta Airlines at 7:10 pm, 1 layover, for a $235 fare.",
            "Checking or savings please?",
            "Your savings account has a balance of $4,134.40.",
            "Do you need to do a transfer now?",
            "For how much and to whom?",
            "Confirming a transfer of funds from savings in the amount of $1,170 to the checking account of Yumi.",
            "The transfer is processing.",
            "The transfer will complete in 3 business days.",
            "You're very welcome."
        ]
    },
    {
        "dialogue_id": "12_00068",
        "service": "Flights_3",
        "service_call": {
            "method": {
                "method": "TransferMoney",
                "parameters": {
                    "account_type": "savings",
                    "recipient_account_type": "checking",
                    "recipient_name": "Jasbir",
                    "transfer_amount": "1400"
                }
            }
        },
        "user_utterance": [
            "12th of march philadelphia two seats",
            "chicago I am flying",
            "go to savings",
            "I want a transfer",
            "give to jasbir",
            "send 1,400 bucks",
            "how many days?",
            "thanks a lot",
            "no thank you"
        ],
        "system_utterance": [
            "where are you going?",
            "american airlines 4 flights 0 layovers $114 8:50 pm",
            "the savings is $22,666.15",
            "who to send money to?",
            "how much money?",
            "savings $1,400 jasbir checking",
            "3 business days",
            "anything else to help with?",
            "have a good one"
        ]
    },
    {
        "dialogue_id": "12_00069",
        "service": "Flights_3",
        "service_call": {
            "method": {
                "method": "TransferMoney",
                "parameters": {
                    "account_type": "savings",
                    "recipient_account_type": "checking",
                    "recipient_name": "uncle Richard",
                    "transfer_amount": "310"
                }
            }
        },
        "user_utterance": [
            "I am taking a trip, can you help me reserve my ticket please.",
            "Yes, I'm flying New York to Las Vegas on Monday next week. What can you find?",
            "Would I arrive the same day or the day after?",
            "If I go with this flight, where would I be flying out of and where will I arrive?",
            "I see. I would like to hear more options. What does Delta Airlines have for economy seating prices?",
            "Hold that thought, Let's go and check my savings account balance please.",
            "Thanks, I'm going to need to make a transfer now.",
            "Uncle Richard please.",
            "Let's send 310 bucks.",
            "Yes, How long does the transfer take?",
            "Great, thanks! Good bye."
        ],
        "system_utterance": [
            "Sure, I would love to. Which city will you be visiting? Do you know what city and date you will be departing from?",
            "If you like American Airlines, they have a 6:50 pm with 1 layover for $287 per ticket.",
            "Your flight will depart and arrive on the same date.",
            "Your departure airport is JFK International Airport and arrival would be at McCarran International Airport.",
            "Delta Airlines has 1 flight departing at 3 pm with 1 layover for $328 per person.",
            "Alright no problem. Your savings as a current balance of $16,313.89. Did you need to make any banking changes?",
            "I can assist you with this. Who would you like to send money to?",
            "ok, and how much are we sending Uncle Richard?",
            "Sure, please confirm we are sending Uncle Richard $310 form your savings to his checking account. Is this correct?",
            "Your transfer will take 3 business days and has been successfully been requested.",
            "your welcome. Good bye."
        ]
    },
    {
        "dialogue_id": "12_00070",
        "service": "Flights_3",
        "service_call": {
            "method": {
                "method": "TransferMoney",
                "parameters": {
                    "account_type": "savings",
                    "recipient_account_type": "savings",
                    "recipient_name": "Yumi",
                    "transfer_amount": "1290"
                }
            }
        },
        "user_utterance": [
            "I would like to find a one way flight. The number of bags I have to check in is zero. I would like three seats on a flight out of Seattle.",
            "I would like to fly out on the 3rd going to Toronto.",
            "Find something else for me.",
            "Where will the flight land? At what time will the flight get to my destination?",
            "Okay. I would like to check the balance in my savings account.",
            "Okay, thank you for that.",
            "Yes, I would like to make one transfer.",
            "Send the money to Yumi.",
            "I would like to transfer one thousand two hundred and ninety dollars into their savings account.",
            "Yes, that is right.",
            "Thanks very much for your help.",
            "No, thanks a lot for your help."
        ],
        "system_utterance": [
            "Where do you want to go? What is the date you want to travel?",
            "I have located 5 flights for you. Do you want to fly on Alaska Airlines? The flight will leave at 11:10 am local time. It has 1 layover and the price of the ticket is $333 per passenger.",
            "Do you want to fly with American Airlines? The flight will leave at 1:40 pm local time. There is 1 layover and this flight costs $328 per passenger.",
            "The flight will arrive at 3:29 am at Toronto Pearson International Airport.",
            "The balance of your savings account is $7,807.23.",
            "Do you want to transfer some money?",
            "Who do you want to send your money to?",
            "What is the amount of money that you would like to transfer?",
            "Confirm these details for me: Transfer $1,290 from your savings account to the savings account of Yumi.",
            "The transfer is successfully begun.",
            "Is there anything else you need?",
            "Have a wonderful day."
        ]
    },
    {
        "dialogue_id": "12_00071",
        "service": "Flights_3",
        "service_call": {
            "method": {
                "method": "TransferMoney",
                "parameters": {
                    "account_type": "checking",
                    "recipient_account_type": "checking",
                    "recipient_name": "Mahmoud",
                    "transfer_amount": "470"
                }
            }
        },
        "user_utterance": [
            "I need a one way flight in economy on March 8th from San Diego.",
            "Chicago.",
            "Find me another options.",
            "Find something else. I need two tickets.",
            "Ok.",
            "I need to check my bank balance.",
            "Checking account.",
            "Ok.",
            "I want to send Mahmoud money from my checking account.",
            "470 bucks.",
            "Cool, How many days will it take?",
            "Thanks for you help.",
            "No, not today."
        ],
        "system_utterance": [
            "Where are you going?",
            "Do you like Alaska Airlines? The flight leaves at 9:55 am and 1 layover. The cost is $237.",
            "What about Southwest Airlines? I found a flight leaving at 11:35 am with 1 layover. The ticket is $303.",
            "What about United Airlines? The flight leaves at 2:55 pm with 1 layover. The cost is $239.",
            "Anything else?",
            "Which account?",
            "Your checking account balance is $5,137.56.",
            "Do you want to make a transfer?",
            "How much?",
            "Please confirm, sending Mahmoud $470 to their checking account from your checking account.",
            "The transfer was successful and will take 1 business day.",
            "Anything else?",
            "Bye!"
        ]
    },
    {
        "dialogue_id": "12_00072",
        "service": "Flights_3",
        "service_call": {
            "method": {
                "method": "TransferMoney",
                "parameters": {
                    "account_type": "savings",
                    "recipient_account_type": "savings",
                    "recipient_name": "Dad",
                    "transfer_amount": "20"
                }
            }
        },
        "user_utterance": [
            "I want 12th of this month premium economy",
            "I am going to atlanta",
            "in new york",
            "check the balance",
            "go to savings",
            "$20 savings account",
            "send to dad please",
            "how many days?",
            "thanks a lot",
            "no thank you"
        ],
        "system_utterance": [
            "where are you headed?",
            "what city then?",
            "american airlines 1:20 pm $191 a passenger 0 layovers",
            "checking or savings",
            "savings balance is $497.32",
            "who are you sending it to?",
            "savings $20 to dad from savings",
            "3 business hours",
            "anything else then?",
            "have a good one"
        ]
    },
    {
        "dialogue_id": "12_00073",
        "service": "Flights_3",
        "service_call": {
            "method": {
                "method": "TransferMoney",
                "parameters": {
                    "account_type": "checking",
                    "recipient_account_type": "checking",
                    "recipient_name": "Kagiso",
                    "transfer_amount": "1380"
                }
            }
        },
        "user_utterance": [
            "I need a flight, a premium economy ticket with Alaska Airlines and I have zero luggage.",
            "To Los Angeles on 10th of March.",
            "From San Diego.",
            "Which airport will it depart from and land at?",
            "okay fine, now could you check the balance of my bank account?",
            "my savings account please.",
            "What about my checking account.",
            "okay that is fine.",
            "yes, I need to make a bank transfer.",
            "to Kagiso please.",
            "one thousand three hundred and eighty dollars.",
            "yes that is correct.",
            "thanks for that.",
            "No thank you."
        ],
        "system_utterance": [
            "What date are you travelling and where is your destination?",
            "Which city will you be leaving from?",
            "There is 1 flight with 0 layovers flying with Alaska Airlines. It departs at 9:55 am and costs $106.",
            "From SAN International Airport to LAX International Airport.",
            "checking or savings account?",
            "There is $18,149.68 in your savings account.",
            "There is $6,335.80 in my checking account.",
            "Do you need assistance with anything else?",
            "Who will the money be going to?",
            "How much money?",
            "To confirm then that is a transfer from your checking account to Kagiso checking account of $1,380.",
            "Your transfer is complete.",
            "Can I assist you more?",
            "have a lovely day."
        ]
    },
    {
        "dialogue_id": "12_00074",
        "service": "Flights_3",
        "service_call": {
            "method": {
                "method": "TransferMoney",
                "parameters": {
                    "account_type": "checking",
                    "recipient_account_type": "checking",
                    "recipient_name": "Li",
                    "transfer_amount": "50"
                }
            }
        },
        "user_utterance": [
            "Hi, I need help booking a one way flight.",
            "I want a flight to Paris.",
            "I want to leave from Seattle on March 1st.",
            "Yeah, that's fine for me.",
            "I want to check my banking balance.",
            "I'd like to see the balance of my savings account, please.",
            "Alright, can I also see the balance of my checking account?",
            "Okay, thank you.",
            "Yes please, I'd like to make a transfer now.",
            "I want to send 50 bucks to Li.",
            "Yes, that's what I want.",
            "Thanks so much, that's all, goodbye!"
        ],
        "system_utterance": [
            "Okay, where do you want to go on your trip?",
            "Sure, where are you departing from and on what day?",
            "Okay, there are 4 flights you could take. Alaska Airlines has a flight that takes off at 11:35 am and has 1 layover, costing $418 a ticket.",
            "Cool, can I help with anything more?",
            "What account do you want me to check?",
            "Okay, your savings account has a balance of $6,628.55.",
            "No problem, your checking account has $20,583.82 in it right now.",
            "Would you like to make a money transfer?",
            "How much money are you transferring and to whom?",
            "Okay, confirming that you're sending $50 from your checking account into the checking account of Li.",
            "The transfer has been initiated and the money will be sent soon.",
            "Bye, have a lovely day."
        ]
    },
    {
        "dialogue_id": "12_00075",
        "service": "Flights_3",
        "service_call": {
            "method": {
                "method": "TransferMoney",
                "parameters": {
                    "account_type": "checking",
                    "recipient_account_type": "savings",
                    "recipient_name": "Grace",
                    "transfer_amount": "1760"
                }
            }
        },
        "user_utterance": [
            "zero bags to check in",
            "atlanta works for me 2 seats",
            "delhi economy march 8th",
            "when does it get there?",
            "alright thank you",
            "go to checking",
            "one thousand seven hundred and sixty bucks savings to grace",
            "yes that works",
            "thanks a lot"
        ],
        "system_utterance": [
            "what city then?",
            "what date and when?",
            "american airlines 6:30 am 1 layover $463",
            "it gets there 2:19 pm",
            "what account then?",
            "checking is $20,155.29",
            "checking $1,760 grace savings",
            "it was sentq",
            "have a good one"
        ]
    },
    {
        "dialogue_id": "12_00076",
        "service": "Flights_3",
        "service_call": {
            "method": {
                "method": "TransferMoney",
                "parameters": {
                    "account_type": "checking",
                    "recipient_account_type": "checking",
                    "recipient_name": "Diego",
                    "transfer_amount": "850"
                }
            }
        },
        "user_utterance": [
            "Find for me a one way flight.",
            "I want to fly from London to Atlanta.I need four seats.",
            "In 10th of this month .",
            "This is a Economy ticket?",
            "okay.Check my balance from my savings account.",
            "From checking account check please.",
            "I understand.Thanks.",
            "Yes.Send from my checking account to Diego $850.",
            "Yes is very good.",
            "Thank you very much.",
            "No.Thank you for all."
        ],
        "system_utterance": [
            "Where you plan to go and in which city do you want to depart?",
            "In what date you want to travel?",
            "I have for you 4 options.With American airlines is a flight that take off at 6:30 pm local time.Itinerary has 0 layovers and cost per ticket is $264.",
            "Yes is a Economy seat.",
            "In your savings account you have the balance $3,136.70.",
            "In your checking account you have the balance $4,418.53.",
            "You want to make a transfer?",
            "From checking account to checking account transfer $850 to Diego.Is that correct?",
            "The transfer was initiated.",
            "Anything else I can do for you?",
            "Have a great day!"
        ]
    },
    {
        "dialogue_id": "12_00077",
        "service": "Flights_3",
        "service_call": {
            "method": {
                "method": "TransferMoney",
                "parameters": {
                    "account_type": "savings",
                    "recipient_account_type": "checking",
                    "recipient_name": "Yumi",
                    "transfer_amount": "350"
                }
            }
        },
        "user_utterance": [
            "I need to find a one way flight.",
            "I want to go to Seattle later today.",
            "I will fly from Mexico City.",
            "No, find me something else. I have 0 bags to check in.",
            "Is this for one passenger? What is the destination arrival time?",
            "Ok. I need to check my savings account balance.",
            "Ok, I want to make a transfer.",
            "Transfer $350 to Yumi.",
            "Yes.",
            "How long will the transfer take?",
            "Thanks for the help.",
            "No thank you."
        ],
        "system_utterance": [
            "Wheen do you want to travel and where too?",
            "What city will you depart from?",
            "Do you want to fly with American Airlines? They have a flight that takes off at 11:40 am local time with 1 layover. The ticket price is $298",
            "Do you want to fly with Delta Airlines. They have a flight that takes off at 6:35 pm local time with 1 layover. The ticket price is $315.",
            "This is for 1 passenger. The flight will arrive at 1:17 am local time.",
            "Your savings account balance is $10,041.51.",
            "How much do you want to transfer and who do you want to transfer the money to?",
            "Please confirm: Transfer $350 from my savings account to Yumi checking account.",
            "The transfer was completed successfully.",
            "It will take 3 business days.",
            "May I assist you with something else?",
            "Enjoy your day."
        ]
    },
    {
        "dialogue_id": "12_00078",
        "service": "Flights_3",
        "service_call": {
            "method": {
                "method": "TransferMoney",
                "parameters": {
                    "account_type": "savings",
                    "recipient_account_type": "checking",
                    "recipient_name": "Philip",
                    "transfer_amount": "1310"
                }
            }
        },
        "user_utterance": [
            "I'm looking for a one way flight.",
            "I'm departing from Los Angeles on the 6th of this month and I just need one ticket.",
            "I'm flying to Sydney and I have zero bags to check.",
            "I want to fly on American Airlines.",
            "What airport does the flight depart from? When does the flight arrive in Sydney?",
            "Okay, thanks. I'd like to check my account balance now.",
            "Tell me my savings account balance.",
            "Okay, thank you.",
            "Yes, I'd like to transfer money to Jasbir.",
            "Transfer one thousand three hundred and ten dollars to Philip.",
            "Yes, that is correct. How long will the transfer take?",
            "Thank you, that is all I needed."
        ],
        "system_utterance": [
            "What date are you departing on?",
            "Where are you traveling to?",
            "There is an Alaska Airlines flight departing at 11:30 am with 0 layovers for $159.",
            "There is an American Airlines flight departing at 12:10 pm with 0 layovers for $186.",
            "The flight departs from LAX International Airport and arrives at 11:37 am.",
            "What account do you want to check?",
            "You have a balance of $8,771.23 in your savings account.",
            "Do you want to make a transfer?",
            "How much money do you want to transfer?",
            "Okay, confirm the details. You want to transfer $1,310 from your savings account to the checking account of Philip.",
            "I have initiated the transfer. It will take 3 business days to process.",
            "Have a great day."
        ]
    },
    {
        "dialogue_id": "12_00079",
        "service": "Flights_3",
        "service_call": {
            "method": {
                "method": "TransferMoney",
                "parameters": {
                    "account_type": "savings",
                    "recipient_account_type": "savings",
                    "recipient_name": "Li",
                    "transfer_amount": "370"
                }
            }
        },
        "user_utterance": [
            "Hi, could you get me two seats on a Delta Airlines plane please?",
            "I will be travelling from Portland to New York.",
            "On thee March 14th, please.",
            "Sure, could you check my savings account balance please?",
            "I see, thanks!",
            "Could you sent 370 dollars to the savings account of Li?",
            "Sure!",
            "Thank you so much!",
            "No, that is all, thanks!"
        ],
        "system_utterance": [
            "Sure, where do you plan to depart from and travel to?",
            "And when will you be departing?",
            "Sure, there is 1 Delta Airlines flight with 1 layovers which will depart ay 7:30 pm and costs $339.",
            "There is currently $23,377.57 in your savings account.",
            "Would you like to make a transfer?",
            "Sure, please confirm your transfer of $370 from your savings account to the savings account of Li.",
            "Your transfer has been made.",
            "Could I further assist you?",
            "No worries, enjoy!"
        ]
    },
    {
        "dialogue_id": "12_00080",
        "service": "Flights_3",
        "service_call": {
            "method": {
                "method": "TransferMoney",
                "parameters": {
                    "account_type": "checking",
                    "recipient_account_type": "checking",
                    "recipient_name": "Philip",
                    "transfer_amount": "140"
                }
            }
        },
        "user_utterance": [
            "I need to find a one way flight.",
            "I'm going to San Francisco and have zero bags to check.",
            "I'm leaving Las Vegas on March 7th.",
            "Okay. I need to get my checking account balance.",
            "I want to transfer one hundred and forty dollars to Philip.",
            "Yes. How long will the transfer take?",
            "Thank you.",
            "No. Thanks for your help."
        ],
        "system_utterance": [
            "What is your destination?",
            "What is your departure city and date?",
            "How about American Airlines? There is a flight leaving at 6:50 am that has 0 layovers. The ticket costs $104 per passenger.",
            "Your checking account balance is $15,559.71.",
            "Can you confirm the following? I am transferring $140 from your checking account into the checking account of Philip. Is this correct?",
            "Your transfer has been successfully initiated and will take 1 business day.",
            "Do you need anything else?",
            "You're welcome. Have a nice day."
        ]
    },
    {
        "dialogue_id": "12_00081",
        "service": "Flights_3",
        "service_call": {
            "method": {
                "method": "TransferMoney",
                "parameters": {
                    "account_type": "savings",
                    "recipient_account_type": "checking",
                    "recipient_name": "Dad",
                    "transfer_amount": "160"
                }
            }
        },
        "user_utterance": [
            "I need a one way flight.",
            "I would like to go with Air Canada from Vancouver to Los Angeles next Thursday.",
            "What number of passengers did you get this for?",
            "Okay, I need to check the balance of my savings account.",
            "Okay that is good.",
            "I would like to make a transfer.",
            "Send Dad 160 dollars.",
            "Yes, that is correct.",
            "What number of days does the transfer take?",
            "Thanks for the help and see you later."
        ],
        "system_utterance": [
            "What date and city are you leaving from?",
            "Do you want to fly Air Canada taking off 4:20 am with 0 layovers at $151 per passenger?",
            "I have for 1 passenger.",
            "The balance of your savings account is $21,133.64.",
            "Do you wish to make a transfer?",
            "Who are you sending money to and how much do you wish to transfer?",
            "Please confirm $160 sent to Dad from savings to checking accounts.",
            "The transfer has been a success.",
            "The transfer takes 3 business days.",
            "Have a great day."
        ]
    },
    {
        "dialogue_id": "12_00082",
        "service": "Flights_3",
        "service_call": {
            "method": {
                "method": "TransferMoney",
                "parameters": {
                    "account_type": "checking",
                    "recipient_account_type": "checking",
                    "recipient_name": "Justin",
                    "transfer_amount": "570"
                }
            }
        },
        "user_utterance": [
            "Can you find me a one way flight?",
            "I want to leave on the 4th of March and I'm going to Philadelphia.",
            "I need to find flights out of Toronto.",
            "Okay that sounds good.",
            "I need to check my account balance.",
            "My savings account pelase.",
            "How much is in my checking?",
            "Okay I need to transfer some money.",
            "Please send $570 to Justin.",
            "Yes that is correct. How long will it take?",
            "Thank you for your help with everything."
        ],
        "system_utterance": [
            "Where are you visiting? On which date would you like to leave?",
            "Which city will you be departing from?",
            "Would you like to fly Air Canada? They have a flight with 1 layover that leaves at 4:30 am and is $139 per passenger.",
            "Can I do anything else for you?",
            "Would you like to check your savings or checking?",
            "You have $2,238.63 in your savings.",
            "You have $22,602.19 in your checking.",
            "Where is it going and how much do you need to transfer?",
            "You need to send $570 to Justin from your checking account to their checking, correct?",
            "Your transfer has been made and will take 1 business day.",
            "You're welcome, have a great day."
        ]
    },
    {
        "dialogue_id": "12_00083",
        "service": "Flights_3",
        "service_call": {
            "method": {
                "method": "TransferMoney",
                "parameters": {
                    "account_type": "savings",
                    "recipient_account_type": "savings",
                    "recipient_name": "Mom",
                    "transfer_amount": "120"
                }
            }
        },
        "user_utterance": [
            "I need a flight leaving Chicago, any class ticket, on 8th of this month.",
            "To Sydney, Australia.",
            "Any other options?",
            "okay, now could you tell me how much I have in my bank account?",
            "My savings account please.",
            "That is okay.",
            "Yes actually could you transfer from my savings account to Mom, one hundred and twenty bucks.",
            "Yes that info is correct.",
            "Thanks for that, goodbye."
        ],
        "system_utterance": [
            "Where is your destination?",
            "There is an American Airlines flight with 1 layover which departs at 7:20 pm. The price is $368 per ticket.",
            "There is a Delta Airlines flight with 1 layover leaving a 7:05 am and costing $613.",
            "Which account will I check?",
            "There is $21,117.84 in your savings.",
            "Do you want a transfer?",
            "To confirm the that is a transfer of $120 from your savings account to Mom and their savings account.",
            "You bank transfer is complete.",
            "Have a lovely day."
        ]
    },
    {
        "dialogue_id": "12_00084",
        "service": "Flights_3",
        "service_call": {
            "method": {
                "method": "TransferMoney",
                "parameters": {
                    "account_type": "checking",
                    "recipient_account_type": "checking",
                    "recipient_name": "Jasbir",
                    "transfer_amount": "710"
                }
            }
        },
        "user_utterance": [
            "I'm looking for one way flights.",
            "I want to depart on the 12th of March.",
            "I want to depart from Phoenix.",
            "I want to go to Las Vegas?",
            "Where is it leaving form? And are 0 checked bags permitted?",
            "Okay, I need to look at my balance.",
            "I need to look at my checking account.",
            "Okay.",
            "Yes, I have a transfer I'd like to make.",
            "It's for 710 dollars.",
            "It's going to Jasbir.",
            "Yes, that's correct.",
            "Thanks for helping out.",
            "No, thanks again."
        ],
        "system_utterance": [
            "What date do you want to depart on?",
            "And what city will you be departing from?",
            "Where are you going?",
            "There's an American Airlines flight that departs at 10:10 am with 0 layovers and costs $80 per ticket, what do you think?",
            "It departs from Sky Harbor International Airport. And 0 checked bags are allowed.",
            "What account would you like to look at?",
            "You have $2,832.14 in your checking account.",
            "Do you want to make any transfers?",
            "How much is the transfer for?",
            "Where will you be sending the money?",
            "I'll send $710 from your checking account to the checking account of Jasbir, is everything correct?",
            "I've transferred the money.",
            "Do you need me for anything else?",
            "Have a fine day."
        ]
    },
    {
        "dialogue_id": "12_00085",
        "service": "Flights_3",
        "service_call": {
            "method": {
                "method": "TransferMoney",
                "parameters": {
                    "account_type": "checking",
                    "recipient_account_type": "checking",
                    "recipient_name": "Jasbir",
                    "transfer_amount": "1440"
                }
            }
        },
        "user_utterance": [
            "Hi there, could you help me search for a one way flight please.",
            "I would be travelling to Las Vegas on the 13th of March.",
            "Flights departing from Toronto will do.",
            "Are there any alternatives?",
            "Does this flight arrive the day after and how many tickets will you help me to purchase?",
            "Sure, could you check the balance of my savings account please?",
            "And how about my checking account?",
            "I see, thanks!",
            "Sure, thank you!",
            "Can you send one thousand four hundred and forty bucks the checking account of Jasbir?",
            "Yes please, how long will the transfer t ake?",
            "Sure, that is all I need. Thank you!"
        ],
        "system_utterance": [
            "Where do you intend to travel to and on which date?",
            "Sure, and where will you be departing from?",
            "There are 2 available flights, how about a flight with Air Canada departing at 5:35 pm with 1 layovers costing $260?",
            "How about a delta airlines flight with 1 layovers departing at 6:45 pm costing $283 per ticket?",
            "This is for 1 passenger and the flight will arrive at the destination on the same day.",
            "You currently have $18,657.31 in your savings account.",
            "You have $13,506.79 in your checking account.",
            "Would you like mt to make a transfer?",
            "Who would you like to send to and for how much?",
            "Sure, please confirm your transfer of $1,440 from your checking account to the checking account of Jasbir.",
            "Your transfer has been initiated, which will take 1 business day.",
            "No worries, have a great day ahead!"
        ]
    },
    {
        "dialogue_id": "12_00086",
        "service": "Flights_3",
        "service_call": {
            "method": {
                "method": "TransferMoney",
                "parameters": {
                    "account_type": "checking",
                    "recipient_account_type": "savings",
                    "recipient_name": "Kagiso",
                    "transfer_amount": "850"
                }
            }
        },
        "user_utterance": [
            "I need a flight to Seattle, just 1 seat with zero luggage.",
            "From San Francisco on 8th of this month.",
            "fine, now could you check the balance of my savings account?",
            "What about the balance of my checking account?",
            "right that is fine.",
            "Yes please from my checking account to Kagiso.",
            "850 dollars to their savings account.",
            "yes that is correct.",
            "How long will it take?",
            "That is all thanks."
        ],
        "system_utterance": [
            "On what date and from where?",
            "There are 5 options for you. One is with Alaska Airlines with 0 layovers leaving at 9:55 am. The ticket costs $130.",
            "There is $16,950.67 in your savings account.",
            "There is $20,612.43 in your checking account.",
            "Are you looking to make a bank transfer?",
            "How much money?",
            "To confirm then that is $850 transferred from your checking account to Kagiso savings account.",
            "Your transfer is complete.",
            "around 3 business days.",
            "Have a lovely day."
        ]
    },
    {
        "dialogue_id": "12_00087",
        "service": "Flights_3",
        "service_call": {
            "method": {
                "method": "TransferMoney",
                "parameters": {
                    "account_type": "checking",
                    "recipient_account_type": "savings",
                    "recipient_name": "Mahmoud",
                    "transfer_amount": "1670"
                }
            }
        },
        "user_utterance": [
            "I would like a one way flight. I have 0 bags for check in. Find me Economy class tickets.",
            "I would like to fly out on March 12th from Delhi.",
            "I am flying to Los Angeles.",
            "Sounds good. I would like to check my balance.",
            "Go with my checking account.",
            "Alright sounds good.",
            "Yes, I would like to make a transfer of 1670 dollars to Mahmoud savings account.",
            "Yes. How many days will the transfer take?",
            "Thank you for the help. Bye."
        ],
        "system_utterance": [
            "What date would you like to travel? From which city would you like to depart from?",
            "Where would you like to go?",
            "There are 2 flights available for you. Would you like to fly with American Airlines? This flight takes off at 7 am local time.There are 0 layovers and the ticket will cost $266 per passenger.",
            "Which account should I check?",
            "Your checking account balance is $21,836.31.",
            "Would you like to make a transfer?",
            "Please confirm these details: Transfer $1,670 from my checking account to Mahmoud savings account.",
            "Your transfer was successfully initiated. The transfer will take 3 business days.",
            "Have a great day!"
        ]
    },
    {
        "dialogue_id": "12_00088",
        "service": "Flights_3",
        "service_call": {
            "method": {
                "method": "TransferMoney",
                "parameters": {
                    "account_type": "checking",
                    "recipient_account_type": "checking",
                    "recipient_name": "Grace",
                    "transfer_amount": "1150"
                }
            }
        },
        "user_utterance": [
            "I want you to find me a one way flight.",
            "I want to fly from Chicago on March 14th.",
            "I want to arrive in Philadelphia.",
            "Okay. Now I want to check my balance.",
            "I want to know the balance on my checking account.",
            "That is fine.",
            "Yes, I want to make a transfer.",
            "I want the money to be sent to Grace.",
            "I would like to transfer one thousand one hundred and fifty bucks.",
            "Yes. Can you tell me the number of days it will take for the transfer to be completed?",
            "I appreciate your help. Good bye!"
        ],
        "system_utterance": [
            "Can you tell me from which city you want to leave, and the date you want to travel?",
            "Can you tell me your destination?",
            "Would you like flying with a flight of American Airlines, which has 1 layover, and takes off at 2:40 pm? The ticket for this flight costs $204 per passenger.",
            "Do you want to check the balance in your checking account, or in your savings account?",
            "The balance in your checking account is $13,216.83.",
            "Do you want to make a transfer?",
            "To whom do you want to send the money to?",
            "Can you tell me the amount of money you want to transfer?",
            "Can you please confirm that you want to transfer $1,150 from your checking account to the checking account of Grace?",
            "Your requested transfer has been initiated without errors. This transfer will take 1 business day to be completed",
            "Have a wonderful time!"
        ]
    },
    {
        "dialogue_id": "12_00089",
        "service": "Flights_3",
        "service_call": {
            "method": {
                "method": "TransferMoney",
                "parameters": {
                    "account_type": "checking",
                    "recipient_account_type": "checking",
                    "recipient_name": "Mom",
                    "transfer_amount": "70"
                }
            }
        },
        "user_utterance": [
            "I have to look for one way flight",
            "I am moving to Phoenix from Los Angeles",
            "I have to depart on 2nd of March",
            "That is perfect",
            "I have to check my balance",
            "I need you to select checking account",
            "That is fine and i like to make a transfer of seventy dollars to their checking account and please send it to mom",
            "How much time will it take to transfer?",
            "Thank you very much"
        ],
        "system_utterance": [
            "Which is the place you are departing from and which city are you visiting?",
            "Which is your preferred day of travel?",
            "What is your opinion on flying with Alaska Airlines leaving at 10:20 pm with 0 itinerary layovers and costing $88 per passanger",
            "Is there any other help you need?",
            "Which account you want me to use checking or savings ?",
            "There is a balance of $8,553.56 on your checking account",
            "Please give confirmation details: Transfer $70 from my checking account to Mom. send it to their checking account",
            "transfer is done and it will take 1 business day for transfer",
            "Have a wonderful day"
        ]
    },
    {
        "dialogue_id": "12_00090",
        "service": "Flights_3",
        "service_call": {
            "method": {
                "method": "TransferMoney",
                "parameters": {
                    "account_type": "savings",
                    "recipient_account_type": "checking",
                    "recipient_name": "Mahmoud",
                    "transfer_amount": "1100"
                }
            }
        },
        "user_utterance": [
            "Hello, I need help booking a one way flight from Washington on the 11th of March.",
            "I want to end up in San Francisco.",
            "Okay, that works.",
            "Yeah, I'd like to check my bank account balance.",
            "I want to see my checking out.",
            "Thanks, now can you tell me the balance of my savings account?",
            "Okay, thank you.",
            "Yes please, I want to make a money transfer.",
            "I want to send $270.",
            "Actually, transfer one thousand one hundred dollars to Mahmoud 's checking account.",
            "Great, how long will it take to reach his account?",
            "Thanks so much, goodbye for now!"
        ],
        "system_utterance": [
            "Where would you like to fly to?",
            "Okay great, there are 4 flights you could take. There's an American Airlines flight taking off at 4:10 am, and it has 1 layover. The flight will be $330 per ticket.",
            "Can I do something else for you?",
            "Sure, do you want to know the balance of your checking or savings account?",
            "Okay, your checking account currently has a balance of $18,615.73.",
            "Of course, your savings account has $24,763.56 in it.",
            "Can I help with anything else?",
            "How much would you like to transfer today?",
            "Sure, who will you be sending it to?",
            "Okay, please confirm: sending $1,100 from your savings account to the checking account of Mahmoud.",
            "The transfer has been initiated. It should get there in 3 business days.",
            "No worries, have a good day."
        ]
    },
    {
        "dialogue_id": "12_00091",
        "service": "Flights_3",
        "service_call": {
            "method": {
                "method": "TransferMoney",
                "parameters": {
                    "account_type": "savings",
                    "recipient_name": "Li",
                    "transfer_amount": "1790"
                }
            }
        },
        "user_utterance": [
            "Hello! I'd like an economy one-way flight via Delta Airlines that leaves on Thursday next week.",
            "I want to leave Chicago.",
            "To Las Vegas.",
            "Okay. Can you see how much is in my checking account? I want to be sure I could pay for that.",
            "Okay, great. Can I find out what's in my savings, as well?",
            "Okay, great. I want to send some money to my friend Li, who is a bit strapped for cash. The specific accounts do not matter.",
            "Send 1790 bucks their way.",
            "I approve of that.",
            "Thanks for the help. Goodbye!"
        ],
        "system_utterance": [
            "From what city do you want to leave?",
            "And where are you headed to?",
            "Okay. I found 1 Delta Airlines flight for you. It leaves at 5:45 am, has 1 layover, and costs $266 a passenger.",
            "Your checking account has $15,914.54.",
            "Sure. You have $17,894.32 in your savings account.",
            "How much money?",
            "Okay. I will transfer $1,790 from your savings account to the checking account of Li, if you approve.",
            "The money has been transferred.",
            "Have a great day."
        ]
    },
    {
        "dialogue_id": "12_00092",
        "service": "Flights_3",
        "service_call": {
            "method": {
                "method": "TransferMoney",
                "parameters": {
                    "account_type": "savings",
                    "recipient_account_type": "checking",
                    "recipient_name": "Diego",
                    "transfer_amount": "260"
                }
            }
        },
        "user_utterance": [
            "Hi, could you get me a one way flight from Seattle on the 6th?",
            "I will be visiting Sydney for a short trip.",
            "Sure, could you check my savings account balance please?",
            "I see, thanks!",
            "Could you do so please?",
            "Can you send 260 bucks to Diego?",
            "Sure, that is fine.",
            "How long will this take me?",
            "Sure, that is all. Thanks!"
        ],
        "system_utterance": [
            "Where do you plan to visit?",
            "Would you like to fly with Alaska Airlines with 1 layovers which departs at 7:30 am and costs $315?",
            "There is currently $13,536.44 in your savings account.",
            "Would you like to make a transfer?",
            "Who would you like to transfer to, and how much?",
            "Sure, please confirm your transfer of $260 to Diego from your savings account to their checking account",
            "Your transfer has been initiated.",
            "About 3 business days.",
            "No problem, have a great day ahead!"
        ]
    },
    {
        "dialogue_id": "12_00093",
        "service": "Flights_3",
        "service_call": {
            "method": {
                "method": "TransferMoney",
                "parameters": {
                    "account_type": "checking",
                    "recipient_account_type": "checking",
                    "recipient_name": "Mahmoud",
                    "transfer_amount": "1680"
                }
            }
        },
        "user_utterance": [
            "I would like to book a one way flight.",
            "I would like to fly out on the 11th.",
            "I want to go to Toronto from Philadelphia.",
            "Okay. I want to check my balance.",
            "Go to my checking account.",
            "Cool.",
            "Yes, I do.",
            "Send money to Mahmoud.",
            "Send one thousand six hundred and eighty dollars.",
            "That's right.",
            "Thank you for helping.",
            "No, that is it."
        ],
        "system_utterance": [
            "On which date would you like to travel?",
            "Where ewill you go and what city are you leaving from?",
            "I have 3 flights that should be good. What about American Airlines? This flight takes off at 8:45 am local time and has 1 layover. It costs $145 per passenger.",
            "Which account do you want me to check?",
            "Your checking account has a balance of $24,198.26.",
            "Do you need to make a transfer?",
            "Who are you sending money to?",
            "How much money do I need to send?",
            "Could you confirm that you want to transfer $1,680 to Mahmoud 's checking account from your checking account?",
            "Your transfers has been started successfully.",
            "Could I assist you any further?",
            "Have a good one."
        ]
    },
    {
        "dialogue_id": "12_00094",
        "service": "Flights_3",
        "service_call": {
            "method": {
                "method": "TransferMoney",
                "parameters": {
                    "account_type": "checking",
                    "recipient_account_type": "savings",
                    "recipient_name": "uncle Richard",
                    "transfer_amount": "180"
                }
            }
        },
        "user_utterance": [
            "I would like to find a premium economy flight on Friday next week.",
            "I'm traveling to Vancouver from Atlanta, I have zero bags and would like an economy ticket.",
            "Find something else and I would like 1 seat.",
            "Which airport does it leave from and reaches?",
            "I would like to check he balance in my checking account.",
            "Ok thank you for your help.",
            "I would like to send money from my savings account to uncle Richard.",
            "I would like to transfer 180 dollars.",
            "Yes, how many days does the transfer take?",
            "Thank you that is all for now."
        ],
        "system_utterance": [
            "Where are you traveling and where are you departing from?",
            "There are 2 flights, there is American Airlines leaving at 8:05 pm and has 0 layovers for $186.",
            "There is 1 flight, Southwest Airlines leaving at 4:10 pm and has 0 layovers for $159.",
            "It leaves from Hartsfield-Jackson International Airport and the destination is YVR International Airport.",
            "The balance of your checking account is $12,439.68.",
            "Can I help with something else?",
            "How much would you like to transfer?",
            "Transfer $180 from checking account to uncle Richard savings account.",
            "The transfer will take 3 business days.",
            "Have a good day."
        ]
    },
    {
        "dialogue_id": "12_00095",
        "service": "Flights_3",
        "service_call": {
            "method": {
                "method": "TransferMoney",
                "parameters": {
                    "account_type": "savings",
                    "recipient_account_type": "checking",
                    "recipient_name": "aunt Jenny",
                    "transfer_amount": "700"
                }
            }
        },
        "user_utterance": [
            "I'm looking for a one way flight please.",
            "Going to Los Angeles from London next Tuesday. I'll have 0 bags.",
            "Where does it fly into?",
            "Thank you. Would you mind checking my bank balance now?",
            "My savings balance please.",
            "Thanks. I need to transfer some funds now.",
            "700 dollars to Aunt Jenny please.",
            "Thanks. How long does that take to go through?",
            "Thank you very much.",
            "No, I'm all set."
        ],
        "system_utterance": [
            "Where are you going and on what date? And where would you like to leave from?",
            "American Airlines has a flight at 6:55 am with 0 layovers and that ticket costs $260.",
            "LAX International Airport.",
            "For which account?",
            "The balance in your savings is $6,062.88.",
            "To whom and for how much?",
            "Confirming a funds transfer of $700 from your savings account to the checking account of Aunt Jenny.",
            "It takes 3 business days and the transfer is underway.",
            "My pleasure. Anything else today?",
            "Thank you very much."
        ]
    },
    {
        "dialogue_id": "12_00096",
        "service": "Flights_3",
        "service_call": {
            "method": {
                "method": "TransferMoney",
                "parameters": {
                    "account_type": "checking",
                    "recipient_account_type": "checking",
                    "recipient_name": "Philip",
                    "transfer_amount": "180"
                }
            }
        },
        "user_utterance": [
            "Find me two seats on a one way flight.",
            "I'm traveling from Paris to San Francisco.",
            "Monday next week.",
            "All right. Can you check my checking account balance?",
            "Alright.",
            "Yes, please.",
            "Transfer 180 dollars to the checking account of Philip.",
            "Yes. How many days will the transfer take?",
            "Thanks for your help. Goodbye!"
        ],
        "system_utterance": [
            "What is your departure city and destination?",
            "When is your departure date?",
            "How about Air France? There is a flight leaving at 5:15 pm. It has 1 layover and costs $417 per passenger.",
            "Your checking account balance is $12,949.69.",
            "Do you want to make a transfer?",
            "How much do you want to transfer?",
            "Please confirm the following: I will transfer $180 from your checking account to the checking account of Philip. Is this correct?",
            "It will take 1 business day. Your transfer is successfully initiated.",
            "Have a good day."
        ]
    },
    {
        "dialogue_id": "12_00097",
        "service": "Flights_3",
        "service_call": {
            "method": {
                "method": "TransferMoney",
                "parameters": {
                    "account_type": "checking",
                    "recipient_account_type": "checking",
                    "recipient_name": "uncle Richard",
                    "transfer_amount": "1200"
                }
            }
        },
        "user_utterance": [
            "I need a one way flight.",
            "I would like to leave the 2nd of this month to Philadelphia from Nairobi.",
            "Have you gotten this for one passenger?",
            "Okay, I need to check my checking balance.",
            "Okay, I'd like to make a transfer.",
            "I would like to send to Uncle Richard.",
            "I want to transfer one thousand two hundred dollars.",
            "Yes how long will the transfer take?",
            "Thanks a lot.",
            "No, thanks so much."
        ],
        "system_utterance": [
            "Where and when are you leaving?",
            "I have 2 flights with American Airlines taking off 7:40 am with 1 layover at $406.",
            "I have for 1 passenger.",
            "The checking balance is $17,789.89.",
            "Who do you wish to send money to?",
            "How much do you wish to transfer?",
            "Please confirm a transfer from my checking to uncle Richard checking account $1200.",
            "The transfer is a success and will take 1 business day.",
            "Can I assist with anything else?",
            "Have a great day."
        ]
    },
    {
        "dialogue_id": "12_00098",
        "service": "Flights_3",
        "service_call": {
            "method": {
                "method": "TransferMoney",
                "parameters": {
                    "account_type": "checking",
                    "recipient_account_type": "checking",
                    "recipient_name": "Mahmoud",
                    "transfer_amount": "320"
                }
            }
        },
        "user_utterance": [
            "delta airlines works",
            "on the 12th san francisco to portland",
            "checking account works",
            "that works for me",
            "yes I do",
            "three hundred and twenty dollars to mahmoud",
            "how many days?",
            "thanks a lot"
        ],
        "system_utterance": [
            "what date do you wanna travel?",
            "delta airlines at 5:15 pm 0 layovers $110 a person",
            "checking is $1,679.63",
            "wanna make a transfer?",
            "who will you send to?",
            "checking $320 to mahmoud checking",
            "it was sent 1 business day",
            "bye bye then"
        ]
    },
    {
        "dialogue_id": "12_00099",
        "service": "Flights_3",
        "service_call": {
            "method": {
                "method": "TransferMoney",
                "parameters": {
                    "account_type": "checking",
                    "recipient_account_type": "checking",
                    "recipient_name": "Grace",
                    "transfer_amount": "1570"
                }
            }
        },
        "user_utterance": [
            "I'd like to book a one way flight.",
            "I want to fly out of Toronto on March 1st.",
            "I'd like to find a premium economy ticket to San Francisco.",
            "Okay, can you check my balance for my checking account?",
            "Thanks. I want to make a transfer to their checking account.",
            "I want to send 1570 dollars to Grace.",
            "Yeah, that's good.",
            "Okay, thanks for the help.",
            "No, that's everything, thanks."
        ],
        "system_utterance": [
            "When would you like to leave? Where are you leaving from?",
            "Where do you want to go?",
            "I found a flight with Air Canada that costs $472. It departs at 5:35 pm and has 1 layover.",
            "Your checking account has a balance of $1,623.37.",
            "How much would you like to transfer, and who are you sending it to?",
            "Okay, so you would like to transfer $1,570 from your checking account to the checking account for Grace, correct?",
            "The money transfer has been initiated.",
            "Do you need anything else?",
            "Okay, have a nice day!"
        ]
    },
    {
        "dialogue_id": "12_00100",
        "service": "Flights_3",
        "service_call": {
            "method": {
                "method": "TransferMoney",
                "parameters": {
                    "account_type": "checking",
                    "recipient_account_type": "checking",
                    "recipient_name": "Grace",
                    "transfer_amount": "1340"
                }
            }
        },
        "user_utterance": [
            "one way flight",
            "10th of this month paris",
            "delta airlines new york",
            "checking account please",
            "okay thank you",
            "one thousand three hundred and forty bucks checking to grace",
            "how many days?",
            "thanks a lot"
        ],
        "system_utterance": [
            "what city then?",
            "where are you going?",
            "delta airlines 1 flight 9:15 am $207 0 layovers",
            "checking has $10,960.26",
            "wanna transfer anything?",
            "checking $1,340 to grace checking",
            "it has been initiated 1 business day",
            "have a good one"
        ]
    },
    {
        "dialogue_id": "12_00101",
        "service": "Flights_3",
        "service_call": {
            "method": {
                "method": "TransferMoney",
                "parameters": {
                    "account_type": "savings",
                    "recipient_account_type": "checking",
                    "recipient_name": "Grace",
                    "transfer_amount": "1420"
                }
            }
        },
        "user_utterance": [
            "Can you find me some one way flights?",
            "I want to fly from New York to Phoenix.",
            "I want to depart next Tuesday.",
            "How many passengers is that for? Where does it arrive?",
            "Okay, I'd need to check my balance first.",
            "Look at my checking account.",
            "What about my savings account?",
            "Okay, thank you.",
            "Yeah I'd like to transfer some money.",
            "I'd like to transfer 1,420 dollars to Grace.",
            "Yep, sounds good.",
            "Okay, thanks for the help.",
            "No, that's all thank you."
        ],
        "system_utterance": [
            "Where do you want to go? Where are you leaving from?",
            "When do you want to leave?",
            "I found an American Airlines flight for $344 that departs at 9:15 am and has 1 layover.",
            "It is for 1 passenger. It arrives at Sky Harbor International Airport.",
            "What account do you want to see?",
            "Your checking account has a balance of $15,034.68.",
            "Your savings account has a balance of $8,675.83.",
            "Can I help with anything else?",
            "Where are you transferring to, and how much do you want to transfer?",
            "Alright, so you would like to transfer $1,420 from your savings account to the checking account for Grace. Is that right?",
            "The transfer was initiated.",
            "Do you need anything else?",
            "Alright, enjoy your day!"
        ]
    },
    {
        "dialogue_id": "12_00102",
        "service": "Flights_3",
        "service_call": {
            "method": {
                "method": "TransferMoney",
                "parameters": {
                    "account_type": "savings",
                    "recipient_account_type": "checking",
                    "recipient_name": "Svetlana",
                    "transfer_amount": "460"
                }
            }
        },
        "user_utterance": [
            "I'm looking for one way flights.",
            "I want to go from San Francisco to Los Angeles with zero bags.",
            "I want to fly out the 12th of March.",
            "How about something else. What about 4 seats to Atlanta?",
            "What airport is it leaving from?",
            "Cool, thank you.",
            "Can you look at the balance of my savings account?",
            "Thanks for checking that.",
            "Yes, please.",
            "Send money to Svetlana.",
            "Transfer 460 dollars.",
            "Yup, that's it. How long will the transfer take?",
            "Thanks for the help.",
            "No, that was it, thanks."
        ],
        "system_utterance": [
            "Where would you like to go to, and where are you planning on leaving from?",
            "And when would you like this trip to be?",
            "I found 5 possible flights. There is a $92 Alaska Airlines ticket with 0 layovers leaving at 4:55 am.",
            "I found 4 possible flights. There is a $185 American Airlines ticket with 0 layovers leaving at 7:30 pm.",
            "Leaving from Hartsfield-Jackson International Airport.",
            "Can I be of any other assistance?",
            "The balance of your savings account is $3884.66.",
            "Would you like to make a transfer?",
            "Where would you like to transfer to?",
            "How much would you like to transfer?",
            "Please confirm: Transfer $460 from savings account to Svetlana 's checking account.",
            "Your transfer is successful. It will take 3 business days.",
            "Is there anything else I can assist with?",
            "Enjoy!"
        ]
    },
    {
        "dialogue_id": "12_00103",
        "service": "Flights_3",
        "service_call": {
            "method": {
                "method": "TransferMoney",
                "parameters": {
                    "account_type": "checking",
                    "recipient_account_type": "checking",
                    "recipient_name": "Grace",
                    "transfer_amount": "1300"
                }
            }
        },
        "user_utterance": [
            "one way flight please",
            "london san diego",
            "6th of march",
            "zero bags economy",
            "where does it land?",
            "11th of this month washington",
            "alright then thanks",
            "savings works for me",
            "go with checking",
            "that works for me",
            "yes I would",
            "one thousand three hundred dollars to grace",
            "thow many days then?",
            "thanks a lot"
        ],
        "system_utterance": [
            "what city and when?",
            "what date then?",
            "alaska airlines 6:10 am 1 layover $333",
            "american airlines 7:10 pm 2 flights 1 layover $357",
            "san international airport heathrow international airport",
            "southwest airlines 11:45 am 1 payover $249",
            "checking or savings",
            "savings $2,958.74",
            "checking has $16,859.66",
            "wanna make a transfer?",
            "how much money then?",
            "$1,300 to grace checking account and checking",
            "it was initiated 1",
            "bye bye then"
        ]
    },
    {
        "dialogue_id": "12_00104",
        "service": "Flights_3",
        "service_call": {
            "method": {
                "method": "TransferMoney",
                "parameters": {
                    "account_type": "checking",
                    "recipient_account_type": "checking",
                    "recipient_name": "Philip",
                    "transfer_amount": "1120"
                }
            }
        },
        "user_utterance": [
            "Get one way premium economy tickets.",
            "Vancouver, get economy.",
            "14th of this month. Los Angeles.",
            "For how many? Where's it get in?",
            "Ok. Check balance.",
            "Checking.",
            "Ok. Transfer money.",
            "Philip.",
            "$1,120.",
            "Yep. How long is that gonna take?",
            "Thanks, bye."
        ],
        "system_utterance": [
            "Departure city?",
            "Departure date and destination?",
            "There's an Air Canada with 0 layovers leaving 4:20 am for $125.",
            "For 1 person. It arrives in LAX International Airport.",
            "Which account?",
            "You have $3,242.52 in checking.",
            "Where to?",
            "Amount to transfer?",
            "Please confirm: send $1,120 from checking to Philip in their checking.",
            "Transfer started. It will be 1 business day.",
            "Goodbye."
        ]
    },
    {
        "dialogue_id": "12_00105",
        "service": "Flights_3",
        "service_call": {
            "method": {
                "method": "TransferMoney",
                "parameters": {
                    "account_type": "savings",
                    "recipient_account_type": "savings",
                    "recipient_name": "Mahmoud",
                    "transfer_amount": "610"
                }
            }
        },
        "user_utterance": [
            "I need you to reserve my flight please.",
            "Sure, I will need to go San Francisco to Las Vegas on the 9th of this month.",
            "All right, that works.",
            "Please pull up my banking information and check my balance.",
            "Pull up savings please.",
            "Alright, thanks.",
            "Yes, I would like to make a transfer.",
            "Let's transfer 610 dollars to their savings account please.",
            "Let's send Mahmoud the money.",
            "Yeah, that's right.",
            "Great, how many days will this take to complete?",
            "Thank you. Good bye!"
        ],
        "system_utterance": [
            "Sure, Where are you planning on flying to and on what date would you like to depart? Also, I will need to know your departure city.",
            "Ok, I've pulled up 4 flights for you. May I suggest Alaska Airlines fligt departing at 10:25 am with 0 layovers for a total of $92",
            "Great, can I located any other information for you at this time?",
            "Ok, which account would you like to check?",
            "Ok, I show the current balance is $14,723.59 for your savings account.",
            "your welcome, did you want to make any banking transactions at this time?",
            "Ok, how much money would you like to transfer?",
            "Sure, Who would you like to transfer to?",
            "Please confirm we are sending Mahmoud $610 from your savings account to their savings account, is this correct?",
            "Great, your transfer request is complete.",
            "Transfers typically take 3 business days.",
            "your welcome, good bye."
        ]
    },
    {
        "dialogue_id": "12_00106",
        "service": "Flights_3",
        "service_call": {
            "method": {
                "method": "TransferMoney",
                "parameters": {
                    "account_type": "savings",
                    "recipient_account_type": "checking",
                    "recipient_name": "aunt Jenny",
                    "transfer_amount": "990"
                }
            }
        },
        "user_utterance": [
            "Will you find a one way flight?",
            "Departing 3rd of March.",
            "I'll leave from Los Angeles to Portland.",
            "Cool. Will you check the balance of my savings?",
            "Perfect.",
            "Sure.",
            "990 bucks.",
            "Aunt Jenny.",
            "Perfect. How many days does it take?",
            "Thanks."
        ],
        "system_utterance": [
            "Departure date?",
            "Which city?",
            "I found 5 flights. Alaska Airlines offers a $128 flight that departs at 11:45 am with 0 layovers.",
            "The balance in your savings is $7,060.62.",
            "Make a transfer?",
            "How much?",
            "Who's the recipient?",
            "Please confirm a transfer of $990 from my savings to the checking of aunt Jenny.",
            "3 business days. I've completed your transfer.",
            "Have a great day."
        ]
    },
    {
        "dialogue_id": "12_00107",
        "service": "Flights_3",
        "service_call": {
            "method": {
                "method": "TransferMoney",
                "parameters": {
                    "account_type": "savings",
                    "recipient_account_type": "checking",
                    "recipient_name": "Khadija",
                    "transfer_amount": "370"
                }
            }
        },
        "user_utterance": [
            "I would like to find a one way flight to San Francisco.",
            "I would like to fly from London March 10th.",
            "What is the number of bags allowed and when will the flight arrive?",
            "Okay, I need to find out my balance.",
            "I'd like to use my checking account.",
            "Let me know the savings account balance.",
            "Okay, I'd like to make a transfer of 370 dollars from checking to Khadija.",
            "Okay I'll confirm.",
            "Thanks for all the help.",
            "No thanks for the help."
        ],
        "system_utterance": [
            "What city and date are you leaving?",
            "Do you wish to fly with American Airlines taking off 2 am local time with 1 layover at $434 a person?",
            "The flight comes at 12:41 pm local time with 0 checked bags allowed.",
            "What account do you want to use?",
            "The checking account balance is $3,261.87.",
            "The savings account balance is $13,277.30.",
            "Please confirm from my savings account a transfer of $370 to Khadija to checking.",
            "The transfer has been a success.",
            "What else can I assist you with?",
            "Have a great day."
        ]
    },
    {
        "dialogue_id": "12_00108",
        "service": "Flights_3",
        "service_call": {
            "method": {
                "method": "SearchHotel",
                "parameters": {
                    "destination": "Phoenix"
                }
            }
        },
        "user_utterance": [
            "I need an economy seat on a plane.",
            "I am leaving London for Phoenix on the 11th.",
            "Where does the flight land? What airport does it leave from?",
            "Ok, I also need a hotel.",
            "Yes, that is good.",
            "No, that is all I need for now."
        ],
        "system_utterance": [
            "Where are you going? When are you leaving? What city are you leaving from?",
            "I found 3 options with American Airlines starting with a flight that leaves at 6:55 am with 1 layover. The ticket is $357.",
            "The flight is going to Sky Harbor International Airport from Heathrow International Airport.",
            "Aloft Phoenix-Airport is a nice 3 star hotel.",
            "Are you ready to make a reservation?",
            "Have a nice day."
        ]
    },
    {
        "dialogue_id": "12_00109",
        "service": "Flights_3",
        "service_call": {
            "method": {
                "method": "SearchHotel",
                "parameters": {
                    "destination": "Los Angeles",
                    "has_wifi": "True",
                    "star_rating": "1"
                }
            }
        },
        "user_utterance": [
            "I need to get a one way flight.",
            "I'll be heading to Los Angeles.",
            "I'd like to leave next Monday.",
            "I want to see flights out of New York.",
            "Okay. I also need to find a hotel out there with wifi. A 1 star hotel would be fine.",
            "Okay, that sounds good. Thanks. That will be all."
        ],
        "system_utterance": [
            "Where do you plan on going?",
            "When do you plan on leaving?",
            "And from where will you be departing?",
            "Do you like American Airlines? There's a flight that takes off at 6:50 pm and has 0 layovers. It only costs $193 per passenger.",
            "AC Hotel By Marriott Beverly Hills is a decent hotel out there with 1 star.",
            "Have a great day!"
        ]
    },
    {
        "dialogue_id": "12_00110",
        "service": "Flights_3",
        "service_call": {
            "method": {
                "method": "SearchHotel",
                "parameters": {
                    "destination": "Atlanta",
                    "has_wifi": "True",
                    "number_of_rooms": "2"
                }
            }
        },
        "user_utterance": [
            "I would like to find a one way flight please.",
            "I will be departing from Phoenix.",
            "I would like to fly to Atlanta on the 6th.",
            "Is there a United Airlines flight that takes off on the 5th of this month?",
            "Yes, sounds good! I also need to find a hotel there with 2 rooms and wifi.",
            "Yes, that sounds great!",
            "Not at this time, that is all I need for now thanks!"
        ],
        "system_utterance": [
            "From what city are you departing from?",
            "What date would you like to travel and where is your destination?",
            "There is an American Airlines flight with 0 layovers that takes off at 9:20 pm and costs $141 per passenger. Would that one interest you?",
            "There is a United Airlines flight with 0 layovers that takes off at 2 pm and costs $158.",
            "There is a 4 star hotel called Ac Hotel By Marriott Atlanta Buckhead At Phipps Plaza. Would that one interest you?",
            "Do you want me to reserve the room for you now?",
            "Have a great day then!"
        ]
    },
    {
        "dialogue_id": "12_00111",
        "service": "Flights_3",
        "service_call": {
            "method": {
                "method": "SearchHotel",
                "parameters": {
                    "destination": "Phoenix",
                    "has_wifi": "True",
                    "number_of_rooms": "1",
                    "star_rating": "2"
                }
            }
        },
        "user_utterance": [
            "Hi there, could you get me a one way flight please?",
            "I would like a Delta Airlines Economy flight to Phoenix please.",
            "I will be travelling from Mexico City on the 9th of this month.",
            "Is this for one passenger and where will I land at?",
            "I see, could you get me one room at a two star hotel with Wifi services?",
            "May I have their address please?",
            "I see, that is all I need. Thank you!"
        ],
        "system_utterance": [
            "Where will you be visiting?",
            "Where and when will you be departing?",
            "I see, there is 1 Delta Airlines flight available which departs at 6:35 pm with 1 layovers, which will cost you $256.",
            "Yes, this is for 1 and you will land at Sky Harbor International Airport.",
            "Sure, how about a 2 star hotel called Aloft Phoenix-Airport?",
            "They are located at 4450 East Washington Street.",
            "No problem, have a great day ahead!"
        ]
    },
    {
        "dialogue_id": "12_00112",
        "service": "Flights_3",
        "service_call": {
            "method": {
                "method": "SearchHotel",
                "parameters": {
                    "destination": "Toronto"
                }
            }
        },
        "user_utterance": [
            "Can you find me a one way flight?",
            "I want to leave next Thursday.",
            "I need to leave from Seattle.",
            "I am traveling to Toronto.",
            "Okay that sounds good.",
            "I need a room there also.",
            "What is the address?",
            "How much is it per night and do they have wifi?",
            "Yes that sounds good thanks. That is all for now."
        ],
        "system_utterance": [
            "Which day will you be leaving?",
            "Which city will you leave from?",
            "Where are you going?",
            "I found 5 flight. How about Alaska Airlines? They have a flight departing at 11:10 am with 1 layover. The tickets at $333.",
            "Can I help with anything else?",
            "I found 10 rooms. How about the Best Western Plus Toronto North York Hotel & Suites which is a nice 3 star.",
            "They are located at 50 NOrfinch Drive.",
            "It does not have wifi and costs $216 a nigh.",
            "Have a great day!"
        ]
    },
    {
        "dialogue_id": "12_00113",
        "service": "Flights_3",
        "service_call": {
            "method": {
                "method": "SearchHotel",
                "parameters": {
                    "destination": "Las Vegas",
                    "star_rating": "2"
                }
            }
        },
        "user_utterance": [
            "I want to go visit a friend soon. Please find a one way flight.",
            "Look for flights on the 10th of this month leaving from Chicago.",
            "I am going to Las Vegas and I will be checking 0 bags.",
            "Sure, for now I just want to find a 2 star hotel in there.",
            "What other hotels are there?",
            "Sure, that one sounds great.",
            "Not right now. Thanks a lot that, would be all for now"
        ],
        "system_utterance": [
            "From where do you want to depart and when do you want to fly?",
            "Where do you want to go?",
            "There are 3 flights you might like. There is a flight from American Airlines. The flight takes off at 8:25 am and it has 1 layover. It has a cost of $287.",
            "There is the Best Western Plus Las Vegas West it has a 2 star rating.",
            "There is also Hampton Inn Las Vegas/Summerlin it also has a 2 star rating.",
            "Do you want to book a room?",
            "Have a great day."
        ]
    },
    {
        "dialogue_id": "12_00114",
        "service": "Flights_3",
        "service_call": {
            "method": {
                "method": "SearchHotel",
                "parameters": {
                    "destination": "Vancouver"
                }
            }
        },
        "user_utterance": [
            "Hi, could you help me search for a one way flight please?",
            "I will be travelling from San Francisco to Vancouver.",
            "Possibly on the 5th of March.",
            "Could you find some economy class tickets instead?",
            "Are there any alternatives?",
            "Does this flight land the day after?",
            "Sure, could you also get me a hotel room there?",
            "Sure, that is fine with me!",
            "No, that is not needed.",
            "No, that is all I need. Thank you!"
        ],
        "system_utterance": [
            "Where will you be travelling from and to?",
            "And when would you like to travel?",
            "I see, would you like to fly with American Airlines with 1 layovers departing at 12:45 pm which will cost you $222?",
            "Sure, how about a flight with Delta Airlines with 0 layovers at 1:20 pm which will cost you $121? There are only 3 available flights.",
            "Sure, how about the Southwest Airlines flight departing at 4 am with 1 layover costing $243.",
            "No, it arrives on the same day at 8:54 am.",
            "There are 10 hotels in that area, how about a 3 star hotel in Atrium Inn Vancouver?",
            "Would you like to make a reservation there then?",
            "Could I further assist you then?",
            "Sure, have a great day ahead!"
        ]
    },
    {
        "dialogue_id": "12_00115",
        "service": "Flights_3",
        "service_call": {
            "method": {
                "method": "SearchHotel",
                "parameters": {
                    "destination": "Los Angeles"
                }
            }
        },
        "user_utterance": [
            "I'd like to look for a one way flight.",
            "I am traveling to Los Angeles.",
            "Search for flights departing from San Diego; I'd like to leave out on next Friday.",
            "Is the ticket business? How many checked bags does it permit?",
            "Okay, I understand.",
            "I'd like to look for a hotel room nearby.",
            "Yeah, that's perfect. Thank you; that's all."
        ],
        "system_utterance": [
            "What location do you intend to visit?",
            "What day do you wish to travel, and what metropolis do you intend to leave from?",
            "I discovered 4 flights for you. What about a ticket costing $51 for an Alaska Airlines flight that departs at 9:55 am local time with 0 layovers?",
            "It is an economy ticket, and 0 checked bags are allowed.",
            "Could I assist you with something else?",
            "I discovered 10 hotels suitable to your preferences. There is a lovely 2 star hotel called Ac Hotel By Marriott Beverly Hills.",
            "Have a pleasant afternoon."
        ]
    },
    {
        "dialogue_id": "12_00116",
        "service": "Flights_3",
        "service_call": {
            "method": {
                "method": "SearchHotel",
                "parameters": {
                    "destination": "Philadelphia"
                }
            }
        },
        "user_utterance": [
            "Hi there, could you help me search for a one way flight please?",
            "I will be flying from New York to Philadelphia on the 5th of this month.",
            "Is this a reservation for four with two checked bags?",
            "I see, could you get me a hotel in that area too?",
            "Sure, that is all I need for now, thanks!"
        ],
        "system_utterance": [
            "Sure, where will you be travelling from and to and when would you like to travel?",
            "Sure, how about an American Airlines flight with 0 layovers and departs at 7:55 am local time costing $62?",
            "Sorry, this is only for 1 passenger with 0 checked bags.",
            "There are 10 hotels which you may like, how about a 3 star hotel called Aka University City?",
            "No worries, enjoy your day!"
        ]
    },
    {
        "dialogue_id": "12_00117",
        "service": "Flights_3",
        "service_call": {
            "method": {
                "method": "SearchHotel",
                "parameters": {
                    "destination": "Los Angeles",
                    "has_wifi": "True"
                }
            }
        },
        "user_utterance": [
            "Hello! Please can you help me to get a one way flight?",
            "I'll be travelling on 5th of this month?",
            "I'm flying to Los Angeles.",
            "I'll be departing from Paris. So, please can you look for flights departing from here?",
            "Looks to be a good deal.",
            "Yup, Please can you help me to book a hotel room here which provides wifi connection?",
            "Might be, for it sounds good.",
            "Not right now. Thanks. I'm done with."
        ],
        "system_utterance": [
            "When do you wish to travel?",
            "So, where are you heading to?",
            "Which is your departing city?",
            "Sure, I can find 4 flights for you. There is an Air France flight that takes off at 5:15 pm local time and it has 1 layovers. Cost of the travel will be $403 per head.",
            "Do you want me to assist you with anything else?",
            "Sure, there is a 2 start hotel, Ac Hotel By Marriott Beverly Hills. Do you wish to stay here?",
            "So, do you wish to book a room at this hotel?",
            "Have a fantastic day."
        ]
    },
    {
        "dialogue_id": "12_00118",
        "service": "Flights_3",
        "service_call": {
            "method": {
                "method": "SearchHotel",
                "parameters": {
                    "destination": "San Diego",
                    "number_of_rooms": "3"
                }
            }
        },
        "user_utterance": [
            "Hi, could you help me search for a one way flight from Phoenix to San Diego? I have zero bags needed to check in.",
            "I will be flying off on the 12th of this month.",
            "Could you find some alternatives instead for three?",
            "May I know which airport will I arrive at?",
            "I see, and what time does the flight land?",
            "I see, could you get me three rooms at a hotel there too?",
            "I see, that is all I need for now. Thank you!"
        ],
        "system_utterance": [
            "Sure, when would you like to travel?",
            "Sure, there are 3 available flights, would you like an American Airlines flight at 10:10 am with 0 layovers costing $81?",
            "Sure, how about a Delta Airlines flight with 0 layovers departing at 9:35 pm and costing $97 per ticket? There are 2 flights available.",
            "You will arrive at SAN International Airport.",
            "About 10:55 pm local time.",
            "There are 10 hotels in that area, how about a 3 star hotel called Bahia Resort Hotel?",
            "No worries, enjoy your day!"
        ]
    },
    {
        "dialogue_id": "12_00119",
        "service": "Flights_3",
        "service_call": {
            "method": {
                "method": "SearchHotel",
                "parameters": {
                    "destination": "New York",
                    "star_rating": "4"
                }
            }
        },
        "user_utterance": [
            "Hey, can you find me a one-way flight?",
            "I'd like to go to New York.",
            "From Chicago on March 9th.",
            "Is there anything else?",
            "When does it arrive in New York?",
            "On the same day? Where does it depart from?",
            "Okay thanks. Can you find me a 4 star hotel there?",
            "Sounds great. That's all, thanks."
        ],
        "system_utterance": [
            "Sure, where are you going?",
            "Okay then, where from? And on what day?",
            "I found an American Airlines flight with 0 layovers. It departs at 9:40 am and costs $136 per person.",
            "How about a Delta Airlines flight with 0 layovers? It departs at 4:05 pm and costs $135 per person.",
            "It arrives at 7:24 pm local time.",
            "Yes, it arrives on the same day. It departs from O'Hare International Airport.",
            "Sure, how about the 4 star 1 Hotel Brooklyn Bridge?",
            "Okay, see you."
        ]
    },
    {
        "dialogue_id": "12_00120",
        "service": "Flights_3",
        "service_call": {
            "method": {
                "method": "SearchHotel",
                "parameters": {
                    "destination": "Los Angeles"
                }
            }
        },
        "user_utterance": [
            "Can you help me find a one way flight please?",
            "I want to find flights from London to Los Angeles leaving on the 12th of March",
            "Is it premium economy?",
            "When does the flight arrive at the destination?",
            "Find me something else please",
            "Alright, now find me a hotel room",
            "That's good, thanks for now, that's it!"
        ],
        "system_utterance": [
            "When do you want to travel? And from what city are you coming and going to?",
            "I found 3 flights. What about this 1 layover flight via American Airlines at 2:25 am for $418",
            "Not, it's just an economy seat",
            "The flight arrives at 12:22 pm",
            "How about British Airways? They have a 11:05 am flight with 1 layover for $469",
            "I found 10 places including a 2 star place like the Ac Hotel By Marriott Beverly Hills",
            "Have a great one!"
        ]
    },
    {
        "dialogue_id": "12_00121",
        "service": "Flights_3",
        "service_call": {
            "method": {
                "method": "SearchHotel",
                "parameters": {
                    "destination": "Phoenix"
                }
            }
        },
        "user_utterance": [
            "Hey, can you get me a one-way flight on Monday next week? Any airline is okay.",
            "I'd like to go to Phoenix.",
            "From New York, please.",
            "Is there anything else?",
            "Sounds good. Can you get me a room there too?",
            "Sounds great, thanks.",
            "No that's all thanks."
        ],
        "system_utterance": [
            "Sure, where are you going?",
            "And where from?",
            "Okay, there's an American Airlines flight with 1 layover. It departs at 6:50 pm and costs $297 per person.",
            "How about a Delta Airlines flight with 1 layover? It departs at 3 pm and costs $318 per person.",
            "Sure, Aloft Phoenix-Airport is a nice 3 star hotel.",
            "Is there anything else?",
            "Okay, see you."
        ]
    },
    {
        "dialogue_id": "12_00122",
        "service": "Flights_3",
        "service_call": {
            "method": {
                "method": "SearchHotel",
                "parameters": {
                    "destination": "Sydney"
                }
            }
        },
        "user_utterance": [
            "Can you find me one way flight to from Seattle on the 12th?",
            "I will be going to Sydney.",
            "Okay, That sounds good to me. Can you find a room in a hotel?",
            "Okay, that sounds good me. That will be all. Thank you!"
        ],
        "system_utterance": [
            "What is your destination?",
            "There are 3 flights suitable to you. How about Alaska Airlines whose itinerary has 1 layover and departing at 11:10 am. The ticket costs $341.",
            "There are 10 hotels that you may like. How about a 4 star hotel called 28 Hotel Sydney?",
            "I am glad I could help. Have a nice day!"
        ]
    },
    {
        "dialogue_id": "12_00123",
        "service": "Flights_3",
        "service_call": {
            "method": {
                "method": "SearchHotel",
                "parameters": {
                    "destination": "Chicago",
                    "star_rating": "1"
                }
            }
        },
        "user_utterance": [
            "I want to search for a one way flight.",
            "I would like to go on the 1st and fly to Chicago.",
            "I would like you to find flights out of San Francisco.",
            "Find something else for me.",
            "Okay. I would like to find a hotel room there. I am interested in a 1 star hotel.",
            "Yes that sounds fine.",
            "No I don't want to reserve one right now. That's all I need at the moment."
        ],
        "system_utterance": [
            "What is the date that you want to travel and where do you want to go?",
            "What is the city you will be leaving from?",
            "I have located 5 flights for you. Do you want to fly with Alaska Airlines? The flight will leave at 9:20 am local time and there are 0 layovers. The ticket price is $173 per passenger.",
            "How about flying with American Airlines? The flight will leave at 9:30 am local time with 1 layover. The price of the ticket is $315 per passenger.",
            "I have located 10 hotels that fit your requirements. A nice 1 star hotel is Ac Hotel By Marriott Chicago Downtown.",
            "Do you want to reserve a room in this hotel?",
            "Have a wonderful day."
        ]
    },
    {
        "dialogue_id": "12_00124",
        "service": "Flights_3",
        "service_call": {
            "method": {
                "method": "SearchHotel",
                "parameters": {
                    "destination": "Portland"
                }
            }
        },
        "user_utterance": [
            "I need a premium economy seats.",
            "I am leaving from Paris to Portland on the 9th of this month. I need 3 seats.",
            "When does the flight arrive?",
            "Ok, I also need a hotel room.",
            "What is the cost per night? The address?",
            "Yes, that is cool.",
            "No, not yet. That is all I need."
        ],
        "system_utterance": [
            "Where are you leaving from? When are you leaving? Where are you going?",
            "I found 3 flight including American Airlines flight leaving at 5:05 am with 1 layover. The ticket is $648.",
            "5:50 pm.",
            "I found Aloft Portland Airport at Cascade Station is a 3 star hotel.",
            "It is $114 per night and the address s 9920 Northeast Cascades Parkway.",
            "Are you ready to reserve a room?",
            "Have a nice day."
        ]
    },
    {
        "dialogue_id": "12_00125",
        "service": "Flights_3",
        "service_call": {
            "method": {
                "method": "SearchHotel",
                "parameters": {
                    "destination": "Atlanta"
                }
            }
        },
        "user_utterance": [
            "I need a one way flight.",
            "I am leaving London for Atlanta on the 10th.",
            "Ok, I also need a hotel room there too.",
            "That sounds good. That is all."
        ],
        "system_utterance": [
            "Where are you leaving from? When are you leaving? Where are you going?",
            "I found 4 flights including American Airlines. They have a flight leaving at 2 am with 1 layover. The ticket is $361.",
            "Ac Hotel By Marriott Atlanta Buckhead at Phipps Plaza is a 4 star hotel.",
            "Have a nice day."
        ]
    },
    {
        "dialogue_id": "12_00126",
        "service": "Flights_3",
        "service_call": {
            "method": {
                "method": "SearchHotel",
                "parameters": {
                    "destination": "Portland",
                    "has_wifi": "True",
                    "number_of_rooms": "1"
                }
            }
        },
        "user_utterance": [
            "zero bags in economy",
            "atlanta march 1st portland",
            "one room there",
            "yes that works"
        ],
        "system_utterance": [
            "where are you going?",
            "american airlines 2:20 pm 3 flights $273 1 layover",
            "aloft portland airport at cascade station 10 hotels 3 stars",
            "have a good one"
        ]
    },
    {
        "dialogue_id": "12_00127",
        "service": "Flights_3",
        "service_call": {
            "method": {
                "method": "SearchHotel",
                "parameters": {
                    "destination": "New York",
                    "has_wifi": "True",
                    "number_of_rooms": "3",
                    "star_rating": "2"
                }
            }
        },
        "user_utterance": [
            "I am in a plan to go for a trip and for which I need to search for one-way flights. Can you search for the one which is suitable to me?",
            "Please search for the flight on 12th of this month from Portland. What else details you need to search?",
            "I want to go to New York. Search for the one-way flight with Alaska Airlines and I need to book tickets under Economy class.",
            "I want to know some more details. Can you check about the time of arrival of this flight at the destination and what is the destination port name?",
            "That is okay and thanks. Now I need your help to find a hotel there to stay for a while. Please search for the one with 2 stars and also they should have wifi. I want to book three rooms there.",
            "That is okay for me. Thanks for your help.",
            "No, not now. Will decide later.",
            "No. Thank you."
        ],
        "system_utterance": [
            "From what date do you want me to book the flight and from which place you are planning to leave? I want to know this to short-list my searching process",
            "To which place you are planning to visit?",
            "Got 1 result based on your requirements. What about a flight from Alaska Airlines with 1 layovers which leaves at 7:15 pm local time. The price of ticket for the same is $329 per passenger? Is that okay to you?",
            "This flight will reach its destination at 8:20 am local time to JFK International Airport.",
            "What about the hotel 1 Hotel Brooklyn Bridge with 2 stars?",
            "Do you want to book the room now?",
            "Anything else you want me to do now?",
            "Have a great day."
        ]
    }
]