[
    {
        "dialogue_id": "14_00000",
        "service": "Services_4",
        "service_call": {
            "method": {
                "method": "GetRide",
                "parameters": {
                    "destination": "8339 Church Street",
                    "number_of_riders": "2",
                    "shared_ride": "True"
                }
            }
        },
        "user_utterance": [
            "Find me a therapist",
            "In Gilroy please",
            "A Psychologist please",
            "whats her address",
            "whats her contact number?",
            "Please book me an appointment for 3rd of March",
            "Make it Quarter past 4 in the evening",
            "yes, thats ok",
            "Sure, its fine",
            "Get me a cab for there, its for three people",
            "yes, make it for 2 people",
            "yes right. how long is it?",
            "thanks, thats all"
        ],
        "system_utterance": [
            "which city to look in",
            "Is a Psychologist or Psychiatrist or something else?",
            "There are 3 Psychologist s in Gilroy of them is Rachelle Coate",
            "its 8339 Church street",
            "its 831-665-5053",
            "Any preferred time?",
            "Please confirm: Booking an appointment with Rachelle Coate at 4:15 pm on March 3rd",
            "Sorry, there was an error. Should i try Booking an appointment with Rachelle Coate at 4:30 pm on March 3rd",
            "Your appointment is booked and you will get a confirmation message soon",
            "Is a shared cab ok?",
            "Please confirm: Booking a shared cab to 8339 Church street for 2 people",
            "Its on the way and it will be a 12 minutes ride",
            "have a good day!"
        ]
    },
    {
        "dialogue_id": "14_00001",
        "service": "Services_4",
        "service_call": {
            "method": {
                "method": "GetRide",
                "parameters": {
                    "destination": "8339 Church Street",
                    "number_of_riders": "2",
                    "shared_ride": "True"
                }
            }
        },
        "user_utterance": [
            "Can you find me a therapist please",
            "I'm looking for a Psychologist",
            "Find me someone in Gilroy",
            "Sounds great, can you book me an appointment at quarter past 11 in the morning",
            "Can you see if I can get one for later today?",
            "Yes, that's perfect",
            "Yes, that's it",
            "Thanks so much, I appreciate it. Now get me a cab please",
            "Yes that works, and shared is fine",
            "Just 2 of us",
            "Yes that's fine. How much is it gonna cost?",
            "Thanks so much, that's it for now"
        ],
        "system_utterance": [
            "What kind of therapist?",
            "What city do you want to look in?",
            "How about trying Rachelle Coate, a Psychologist in Gilroy",
            "What date would you like to book?",
            "Want me to try to book Rachelle Coate at 11:15 am on March 1st?",
            "Sorry I couldn't book it. Want me to try Rachelle Coate at 11:30 am on March 1st instead?",
            "Your appointment is booked and you'll get an e-mail soon",
            "Are you going to 8339 Church Street? Is a shared ride good?",
            "How many people are riding with you?",
            "Confirming a shared ride for 2 to 8339 Church Street",
            "It's booked and on the way and it'll run you $9.14",
            "OK, sure thing"
        ]
    },
    {
        "dialogue_id": "14_00002",
        "service": "Services_4",
        "service_call": {
            "method": {
                "method": "GetRide",
                "parameters": {
                    "destination": "327 North San Mateo Drive Suite 7",
                    "number_of_riders": "3",
                    "shared_ride": "True"
                }
            }
        },
        "user_utterance": [
            "I wanna find a therapist.",
            "I want a psychiatrist.",
            "In San Mateo.",
            "Okay. I'd like an appointment.",
            "On the 13th.",
            "At morning 10:30.",
            "That's it. What's her address?",
            "I'd like a cab to get there.",
            "A shared ride is fine.",
            "Three people.",
            "Yes it is. How much will it be?",
            "How long will the ride take?",
            "Thanks. That's all."
        ],
        "system_utterance": [
            "What type of therapist would you like?",
            "What city would you like one in?",
            "Lola Vildavskaia is a psychiatrist in San Mateo.",
            "What day would you like it on?",
            "What time would you like it on?",
            "An appointment with Lola Vildavskaia on March 13th at 10:30 am.",
            "Your appointment has been made. An email confirmation will be sent to you. Her address is 327 North San Mateo Drive Suite 7.",
            "Would you like a shared ride.",
            "How many people will take the cab?",
            "A cab for 3 to go to 327 North San Mateo Drive Suite 7. You want a shared ride. Is this right?",
            "Your cab is on its way. It will cost $15.80.",
            "The ride will be about 28 minutes.",
            "Have a nice day."
        ]
    },
    {
        "dialogue_id": "14_00003",
        "service": "Hotels_4",
        "service_call": {
            "method": {
                "method": "ReserveHotel",
                "parameters": {
                    "check_in_date": "2019-03-07",
                    "location": "London",
                    "number_of_rooms": "1",
                    "place_name": "45 Park Lane",
                    "stay_length": "7"
                }
            }
        },
        "user_utterance": [
            "Hi, I need a hotel please.",
            "In London, England please.",
            "What's the telephone number and address?",
            "Okay, that's good.",
            "Not yet, thanks. I'd like to know what the weather conditions look like for the 13th of this month.",
            "And the wind conditions please?",
            "Thanks a lot.",
            "I'd like one room at that hotel you mentioned, a 7 day stay.",
            "No, on Thursday next week.",
            "Great. Can I smoke in the room?",
            "How much is that room?",
            "Thank you for your help."
        ],
        "system_utterance": [
            "In what city please?",
            "How about 45 Park Lane? It's rated 5 stars.",
            "The address is 45 Park Lane and the number is +44 20 7493 4545.",
            "Do you want to book a room?",
            "It will be 94 degrees Fahrenheit on average with a chance of rain of 25 percent.",
            "The wind will be 5 miles an hour that day.",
            "How else may I help you?",
            "Starting on March 13th?",
            "Confirming 1 room for 7 days at 45 Park Lane in London on March 7th.",
            "No, I'm sorry, it's a non smoking hotel. The reservation has completed.",
            "It's $350 a night.",
            "My pleasure, thank you."
        ]
    },
    {
        "dialogue_id": "14_00004",
        "service": "Hotels_4",
        "service_call": {
            "method": {
                "method": "ReserveHotel",
                "parameters": {
                    "check_in_date": "2019-03-04",
                    "location": "New York",
                    "number_of_rooms": "1",
                    "place_name": "1 Hotel Brooklyn Bridge",
                    "stay_length": "4"
                }
            }
        },
        "user_utterance": [
            "Would you help me locate a hotel please?",
            "In NYC please.",
            "Is it a non smoking hotel?",
            "Okay, that's good.",
            "Not quite yet.",
            "Yes, what is the weather like on the 4th?",
            "How about the humidity and what the wind conditions?",
            "Thank you. Now I'd like to make a hotel reservation for a stay of 4 days please.",
            "Yes, it is.",
            "Yes, that's correct.",
            "Thank you for your help.",
            "No, I'm all set."
        ],
        "system_utterance": [
            "In which city would you like to me to look?",
            "How about 1 Hotel Brooklyn Bridge, which has a 4 star rating?",
            "No, smoking is allowed.",
            "Shall I make a reservation for you?",
            "How else may I help you today?",
            "It will be 59 degrees Fahrenheit and the possibility of precipitation will be 22 percent.",
            "The humidity average is approximately 29 percent and the wind will average 8 miles an hour.",
            "Is that for a March 4th check in?",
            "Confirming a 4 day stay at 1 Hotel Brooklyn Bridge in New York on March 4th and you'd like 1 room.",
            "The reservation is complete.",
            "Anything else today?",
            "Thank you very much."
        ]
    },
    {
        "dialogue_id": "14_00005",
        "service": "Hotels_4",
        "service_call": {
            "method": {
                "method": "ReserveHotel",
                "parameters": {
                    "check_in_date": "2019-03-02",
                    "location": "New York",
                    "number_of_rooms": "1",
                    "place_name": "11 Howard",
                    "stay_length": "7"
                }
            }
        },
        "user_utterance": [
            "I'd like to find a hotel.",
            "I would like to search New York City.",
            "Tell me their street address and price per night.",
            "Do any other hotels match the criteria?",
            "Do any other hotels match a 3 star criteria?",
            "That sounds good and I'd like to check the weather there on the 3rd.",
            "What will the humidity and wind be?",
            "What about Saturday this week.",
            "Sure, I'd like to reserve the hotel you found.",
            "This is nice. I\"ll be staying 7 days.",
            "That is great.",
            "What is the address and price per night.",
            "Thanks for your help. That is all."
        ],
        "system_utterance": [
            "What city should I search hotels in?",
            "I see a 4 star hotel called 1 Hotel Brooklyn Bridge.",
            "The address is 60 Furman Street, Brooklyn costing $176 a night.",
            "A 5 star hotel is called 1 Hotel Central Park.",
            "I have 10 hotels matching criteria including 11 Howard a 3 star hotel.",
            "The average temperature is 74 F with a 23 % chance of rain.",
            "The average wind is 13 mph and humidity 26 %.",
            "The average temperature is 57 F and a 29 % chance of rain.",
            "What about March 2nd how long will you be staying?",
            "Please confirm a hotel in 11 Howard with a check-in March 2nd for 7 days in New York with 1 room.",
            "I have successfully booked the hotel.",
            "The address is 11 Howard Street at $315 a night.",
            "Bye and have a nice day."
        ]
    },
    {
        "dialogue_id": "14_00006",
        "service": "Hotels_4",
        "service_call": {
            "method": {
                "method": "ReserveHotel",
                "parameters": {
                    "check_in_date": "2019-03-07",
                    "location": "Paris",
                    "number_of_rooms": "2",
                    "place_name": "Aparthotel Adagio Access Paris La Villette",
                    "stay_length": "5"
                }
            }
        },
        "user_utterance": [
            "I am looking for a three star hotel. I need 2 rooms.",
            "I am looking for hotels in Paris, France.",
            "What is the price per night? What is their street address?",
            "Sounds pretty good.",
            "Maybe later. I want to check the weather there on March 12th.",
            "How humid will it be?",
            "Alright. I would like to reserve the hotel you found.",
            "I want to say for five days. I want to check in Thursday next week.",
            "Sure, that sounds good.",
            "Thank you, you have helped a lot. That is all."
        ],
        "system_utterance": [
            "In which city should I look for hotels in?",
            "There are 10 hotels that you may like. One is a 3 star hotel called Aparthotel Adagio Access Paris La Villette.",
            "Their address is 28bis Avenue Corentin Cariou, 75019 and it will cost $198 per night.",
            "Would you like to reserve this hotel?",
            "The average temperature for that day should be 72 degrees Fahrenheit and there is a 16 percent chance of rain.",
            "The humidity will be around 34 percent.",
            "Would you like to check in on March 12th? Also, how long will you be staying?",
            "Please confirm these details: Reserve 2 rooms at Aparthotel Adagio Access Paris La Villette located in Paris. You will stay for 5 days and check in on March 7th.",
            "Your booking was successful.",
            "Goodbye, have a great day!"
        ]
    },
    {
        "dialogue_id": "14_00007",
        "service": "Hotels_4",
        "service_call": {
            "method": {
                "method": "ReserveHotel",
                "parameters": {
                    "check_in_date": "2019-03-04",
                    "location": "London",
                    "number_of_rooms": "1",
                    "place_name": "Abc Hyde Park Hotel",
                    "stay_length": "6"
                }
            }
        },
        "user_utterance": [
            "Could you assist me to find a hotel?",
            "In London please.",
            "What is their location?",
            "Do you have a contact number for them?",
            "Any other options available that would suit me?",
            "that is fine.",
            "not right now.",
            "Could you find out what the weather will be like in London on the 8th?",
            "that is fine, now could you make a booking for me at that hotel?",
            "For 6 night altogether.",
            "no next Monday.",
            "yes that sounds good.",
            "How much will it cost each night?",
            "That is everything i need. Thanks for your help, much appreciated."
        ],
        "system_utterance": [
            "In which city?",
            "There is a 5 star called 45 Park Lane.",
            "45 Park Lane.",
            "Yes it is +44 20 7493 4545.",
            "There is a 3 star called Abc Hyde Park Hotel.",
            "Would you like me to book you a room?",
            "Anything else I can assist you with?",
            "There is a 24 % chance of rain and the ave temp is 93 degrees Fahrenheit.",
            "How many nights do you want the room for?",
            "Will you check in date be March 8th?",
            "To confirm then that is 1 room for 6 days at Abc Hyde Park Hotel, London from March 4th.",
            "The room is now booked",
            "$120 per night.",
            "Have a lovely day."
        ]
    },
    {
        "dialogue_id": "14_00008",
        "service": "Hotels_4",
        "service_call": {
            "method": {
                "method": "ReserveHotel",
                "parameters": {
                    "check_in_date": "2019-03-02",
                    "location": "London",
                    "number_of_rooms": "1",
                    "place_name": "Ace Hotel London",
                    "stay_length": "2"
                }
            }
        },
        "user_utterance": [
            "I want to find a 4 star hotel.",
            "I want to find hotels in London.",
            "That sounds great.",
            "Maybe in a bit. I would like to find the weather forecast there for day after tomorrow.",
            "How windy will it be and how humid?",
            "Okay. I'd like to make the hotel reservation.",
            "I want to stay for 2 days this Saturday.",
            "Okay, sounds good.",
            "Thank you. You've been helpful. That is all I needed."
        ],
        "system_utterance": [
            "What city do I need to check in?",
            "There is a 4 star hotel Ace Hotel London.",
            "Would you like to make the hotel reservation?",
            "That day the temperature should be 88 degrees Fahrenheit with a 29 percent chance of rain.",
            "The wind speed should be 2 miles per hour and the humidity around 66 percent.",
            "Would you like to check in on March 3rd? How long will you stay?",
            "Could you confirm that you want tostay in Ace Hotel London, which is located in London, on March 2nd for 2 days and that you want 1 room?",
            "I have booked the hotel successfully.",
            "Bye and enjoy your day."
        ]
    },
    {
        "dialogue_id": "14_00009",
        "service": "Hotels_4",
        "service_call": {
            "method": {
                "method": "ReserveHotel",
                "parameters": {
                    "check_in_date": "2019-03-01",
                    "location": "Anaheim",
                    "number_of_rooms": "1",
                    "place_name": "Anaheim Portofino Inn & Suites",
                    "stay_length": "2"
                }
            }
        },
        "user_utterance": [
            "I want to find 1 room at a three star hotel.",
            "I want to look in Anaheim.",
            "Do you have anything else available?",
            "Sounds great. I want to find out what the weather will be like.",
            "How humid will it be?",
            "Okay then. Reserve the hotel that you told me about for two days.",
            "That's fine.",
            "Sure, sounds good. Is smoking allowed there?",
            "You hae been such a help. That's all for now."
        ],
        "system_utterance": [
            "What city are you looking in?",
            "There is a 3 star hotel called Anaheim Majestic Garden Hotel.",
            "What about this 3 star, Anaheim Portofino Inn & Suites?",
            "That day the temperature will be 78 degrees Fahrenheit with a 29 percent chance of rain.",
            "It should be around 45 percent in humidity.",
            "Would you like to check in March 1st?",
            "Could you confirm that you want to check in to Anaheim Portofino Inn & Suites on March 1st and stay for 2 days? This hotel is in Anaheim and you need 1 room.",
            "No, smoking isn't allowed on the property. The booking has been made successfully.",
            "Good bye. Enjoy the day!"
        ]
    },
    {
        "dialogue_id": "14_00010",
        "service": "Hotels_4",
        "service_call": {
            "method": {
                "method": "ReserveHotel",
                "parameters": {
                    "check_in_date": "2019-03-03",
                    "location": "Sydney",
                    "number_of_rooms": "1",
                    "place_name": "28 Hotel Sydney",
                    "stay_length": "2"
                }
            }
        },
        "user_utterance": [
            "I am interested in finding a hotel.",
            "I am interested in hotels in Sydney, Australia.",
            "Seems nice. I also want to know how the weather will be there on 10th of this month.",
            "Alright, nice. I want to make a reservation for two days at the hotel you mentioned.",
            "I will be going there on this Sunday.",
            "Alright, that is good.",
            "I appreciate your help very much. That would be all."
        ],
        "system_utterance": [
            "Can you tell me in which city do you want me to look for the hotels?",
            "There is a good 4 star hotel called 28 Hotel Sydney.",
            "For your requested location the average temperature should be 92 degrees, and the chance of rain is 5 percent.",
            "Will you be going at the hotel on March 10th?",
            "Can you please confirm that you want to book 1 room for 2 days at the 28 Hotel Sydney in Sydney for March 3rd.",
            "Your requested hotel booking has been made.",
            "Good bye, and have a wonderful day!"
        ]
    },
    {
        "dialogue_id": "14_00011",
        "service": "Hotels_4",
        "service_call": {
            "method": {
                "method": "ReserveHotel",
                "parameters": {
                    "check_in_date": "2019-03-07",
                    "location": "New York",
                    "number_of_rooms": "2",
                    "place_name": "1 Hotel Central Park",
                    "stay_length": "6"
                }
            }
        },
        "user_utterance": [
            "I looking for a hotel with two rooms. Smoking should be allowed.",
            "I prefer hotels in NY.",
            "How much is it per night?",
            "Is there any other hotel that fit my criteria?",
            "How much is it per night? What's their contact number?",
            "Great. I want to know the weather there on Thursday next week.",
            "Okay. Please reserve the hotel you found for six day on Thursday next week.",
            "Okay, great. May I have their street address?",
            "Thanks for your help.",
            "No.Thanks for your help."
        ],
        "system_utterance": [
            "Which city do you prefer?",
            "There are 10 hotels that match your criteria. One is a 4 star hotel named 1 Hotel Brooklyn Bridge.",
            "$176 per night.",
            "There is a 5 star hotel named 1 Hotel Central Park.",
            "Their contact number is +1 212-703-2001. It is $390 per night",
            "65 degrees Fahrenheit is the average temperature. The chance of rain is 15 percent.",
            "Pleas verify the details: Reservation of 2 rooms in 1 Hotel Central Park in New York. on March 7th, for 6 days.",
            "The hotel is booked successfully. Thy are located at 1414 6th Avenue.",
            "Will there be anything else?",
            "Bye. Have a great day."
        ]
    },
    {
        "dialogue_id": "14_00012",
        "service": "Hotels_4",
        "service_call": {
            "method": {
                "method": "ReserveHotel",
                "parameters": {
                    "check_in_date": "2019-03-07",
                    "location": "Fresno",
                    "number_of_rooms": "1",
                    "place_name": "Doubletree By Hilton Hotel Fresno Convention Center",
                    "stay_length": "6"
                }
            }
        },
        "user_utterance": [
            "I need a hotel.",
            "I need hotels in Fresno.",
            "That sounds great.",
            "Maybe at a later time. What will the weather be on the 12th of this month.",
            "What will the wind and humidity be?",
            "Sure, I'd like to reserve the hotel for six days with check in March 7th.",
            "Sure that is great. What is the address?",
            "Would smoking be allowed and what is the price per night?",
            "Thanks you have been a good help.",
            "No, thanks you have been helpful."
        ],
        "system_utterance": [
            "What city should I look for hotels in?",
            "I see a 3 star hotel called Doubletree By Hilton Hotel Fresno Convention Center.",
            "Do you want to reserve the hotel?",
            "The average temperature is 73 F and 13 % chance of rain.",
            "The average wind will be 6 mph and humidity 25 %.",
            "Please confirm a hotel Doubletree By Hilton Hotel Fresno Convention Center March 7th for 6 days in Fresno for 1 room.",
            "The hotel at 2233 Ventura Street has been successfully booked.",
            "The price is $222 a night and no smoking is allowed at that property.",
            "What else can I help you with?",
            "Bye, and have a nice day!"
        ]
    },
    {
        "dialogue_id": "14_00013",
        "service": "Hotels_4",
        "service_call": {
            "method": {
                "method": "ReserveHotel",
                "parameters": {
                    "check_in_date": "2019-03-01",
                    "location": "London",
                    "number_of_rooms": "1",
                    "place_name": "45 Park Lane",
                    "stay_length": "7"
                }
            }
        },
        "user_utterance": [
            "I'd like assistant in finding a hotel please.",
            "I'd like to find a nice hotel in London.",
            "That sounds like a nice hotel. Can you tell me what the weather is expected to be like there on the 1st of this month?",
            "How humid will it be?",
            "Will you reserve the hotel you told me about earlier?",
            "I'll be staying for seven days and will be checking in on the 1st.",
            "Yes, that is correct. Does this hotel have smoking rooms?",
            "How much is it going to cost per night?",
            "Thank you for all your help.",
            "No, thank you. I appreciate your help."
        ],
        "system_utterance": [
            "Where would you like to search for hotels?",
            "There is a great hotel called 45 Park Lane with a 5 star rating.",
            "The expected temperature for the day is 81 degrees Fahrenheit. There is a 23 % expected chance of rain.",
            "The humidity is expected to be around 35 %.",
            "Would you like to check in on March 1st? How long is your expected stay?",
            "Can you confirm the following details: You'd like 1 room at 45 Park Lane in London. You'll be checking in on March 1st and staying for 7 days.",
            "Your reservation has been successfully booked. This is a non-smoking hotel with no smoking on the property.",
            "The cost is $480 per night.",
            "May I be of further assistance?",
            "It is always my pleasure. Have a fabulous day."
        ]
    },
    {
        "dialogue_id": "14_00014",
        "service": "Hotels_4",
        "service_call": {
            "method": {
                "method": "ReserveHotel",
                "parameters": {
                    "check_in_date": "2019-03-04",
                    "location": "New York",
                    "number_of_rooms": "2",
                    "place_name": "Ac Hotel New York Times Square",
                    "stay_length": "4"
                }
            }
        },
        "user_utterance": [
            "Can you find me a hotel in New York?",
            "What is the address and phonenumber?",
            "Can you find me something else, I only need one room and it has to be a four star hotel.",
            "Anything else? I actually want two rooms.",
            "Yeah, that sounds great.",
            "No, not now thank you.",
            "I want to know the weather on March 5th.",
            "How humid will it be though?",
            "Okay, I decided I want to stay in that hotel you found for four days.",
            "No on the 4th.",
            "This is exactly what I want.",
            "Can we smoke in the Hotel?",
            "How much is it per night and what is the phone number?",
            "Thanks for your help."
        ],
        "system_utterance": [
            "I have 10 hotels. There is a 4 star hotel called 1 Hotel Brooklyn Bridge.",
            "The phone number is +1 833-625-6111 and the address is 60 Furman street Brooklyn.",
            "I have 9 other hotels. What about 6 Columbus Hotel. This is 4 star.",
            "There is one called AC Hotel New York Times Square, this is 4 star.",
            "Do you want me to reserve it?",
            "Is there anything else I can do?",
            "The average temperature will be 73 degree F and there is a 51 percent chance of rain.",
            "It will be around 66 percent.",
            "Is the check-in on March 5th?",
            "Let's confirm the details. AC Hotel New York Times Square, check in March 4th and you will stay for 4 days, you need 2 rooms and it's located in New York.",
            "That is all booked for you.",
            "No that is not permitted.",
            "The number is +1 212-398-2700 and it will be $216 per night.",
            "Thank you, have a nice day."
        ]
    },
    {
        "dialogue_id": "14_00015",
        "service": "Hotels_4",
        "service_call": {
            "method": {
                "method": "ReserveHotel",
                "parameters": {
                    "check_in_date": "2019-03-10",
                    "location": "Paris",
                    "number_of_rooms": "1",
                    "place_name": "Best Western Bretagne Montparnasse",
                    "stay_length": "2"
                }
            }
        },
        "user_utterance": [
            "I am looking for a 4 star hotel.",
            "In Paris, France.",
            "How much does it cost for one night and is smoking allowed?",
            "Can you find me 1 room in a hotel that allows smoking?",
            "Is there anywhere else?",
            "That would be good.",
            "Not right now.",
            "I want to check in on the 10th of this month.",
            "How humid and windy would it be?",
            "I would like to book the hotel.",
            "I want to check in on the 10th of this month and stay for two days.",
            "That would be great.",
            "Thank you very much.",
            "No, thank you."
        ],
        "system_utterance": [
            "In which city?",
            "There are 10 hotel available. There is a 4 star hotel called ac hotel by marriott paris porte maillot.",
            "It costs $312 and smoking is not allowed there.",
            "There is a 4 star hotel called amastan paris.",
            "There is a 4 star hotel called best western bretagne montparnasse.",
            "You would like to reserve a room there?",
            "Is there anything else?",
            "It should be 80 degrees fahrenheit with 2 percent chance of rain.",
            "The wind speed should be 7 miles per hour and the humidity 15 percent.",
            "For how long?",
            "You would like a room for 1 at best western bretagne montparnasse in paris for 2 days from March 10th?",
            "I have booked the hotel.",
            "Would you need anything else?",
            "Enjoy your day."
        ]
    },
    {
        "dialogue_id": "14_00016",
        "service": "Hotels_4",
        "service_call": {
            "method": {
                "method": "ReserveHotel",
                "parameters": {
                    "check_in_date": "2019-03-01",
                    "location": "Phoenix",
                    "number_of_rooms": "1",
                    "place_name": "Aloft Phoenix-Airport",
                    "stay_length": "2"
                }
            }
        },
        "user_utterance": [
            "I need a hotel room.",
            "Let's try Phoenix, AZ.",
            "What's the phone number and street address?",
            "Just what I needed.",
            "Not now. Let's check out the weather in Phoenix.",
            "Will it be very humid?",
            "What day is it? What's the wind like there?",
            "Thanks. Let's reserve that room for two days.",
            "OK Do it.",
            "Exactly. What do they charge per night? Is smoking or non-smoking?",
            "Thank You. That's it."
        ],
        "system_utterance": [
            "Where are you planning on staying?",
            "I found a 3 star hotel. It's the Aloft Phoenix-Airport.",
            "The number is +1 602-275-6300 and they're at 4450 East Washington Street.",
            "Do you want to reserve that?",
            "The temperature there averages about 89 degrees and there is a 15 percent chance of precipitation.",
            "That's around 23 percent.",
            "Today is March 1st and the winds are at 11 miles per hour.",
            "Do you want that for today, March 1st?",
            "To confirm: You want 1 room for 2 days on March 1st in Phoenix at the Aloft Phoenix-Airport.",
            "It's booked. The charge is $228 per night and smoking is not allowed.",
            "Take care now"
        ]
    },
    {
        "dialogue_id": "14_00017",
        "service": "Hotels_4",
        "service_call": {
            "method": {
                "method": "ReserveHotel",
                "parameters": {
                    "check_in_date": "2019-03-01",
                    "location": "London",
                    "number_of_rooms": "1",
                    "place_name": "45 Park Lane",
                    "stay_length": "4"
                }
            }
        },
        "user_utterance": [
            "I'd like to find a hotel.",
            "I'd like to find one in London.",
            "What's their phone number and can I smoke in the hotel?",
            "That sounds fine. I'd like to check the weather there.",
            "That works for me. I'd like to book a room there.",
            "I'd like it for 4 days.",
            "Yes, that would work.",
            "Yes, that works.",
            "What's the address?",
            "Thanks for all the help.",
            "No, thanks for everything."
        ],
        "system_utterance": [
            "Where should I look for one?",
            "There's a 5 star hotel called 45 Park Lane.",
            "Their number is +44 20 7493 4545 and no, you can't smoke there.",
            "The average temperature will be 81 degrees Fahrenheit and there's a 23 percent chance of rain.",
            "How long do you want the room for?",
            "Would you like to check in on March 1st?",
            "Please confirm the following: You want 1 room for 4 days starting on March 1st at 45 Park Lane in London.",
            "The room has been booked.",
            "They are located at 45 Park Lane.",
            "Is there anything else?",
            "Have a great day!"
        ]
    },
    {
        "dialogue_id": "14_00018",
        "service": "Hotels_4",
        "service_call": {
            "method": {
                "method": "ReserveHotel",
                "parameters": {
                    "check_in_date": "2019-03-06",
                    "location": "New York",
                    "number_of_rooms": "1",
                    "place_name": "1 Hotel Brooklyn Bridge",
                    "stay_length": "3"
                }
            }
        },
        "user_utterance": [
            "I want to find a hotel.",
            "I am interested in hotels in New York City.",
            "Can you tell me if smoking is allowed at this hotel?",
            "Seems nice. Now I want to know how the weather will be there on March 14th.",
            "Alright, it is fine.",
            "I would like to make a booking for 3 days at the hotel you mentioned earlier.",
            "Actually I will be going at the hotel on Wednesday next week.",
            "Sure, that is good.",
            "Can you tell me the address of the hotel, and how much it will cost me per night?",
            "Thank you, you have helped me a lot!",
            "Nothing. I appreciate the help you have given me!"
        ],
        "system_utterance": [
            "Can you tell me the city where you want me to search for the hotel?",
            "There are 10 hotels which you might like staying in. One of the hotels is called 1 Hotel Brooklyn Bridge, which is a 4 star hotel.",
            "Yes, smoking is allowed at this hotel.",
            "The average temperature for your requested location should be 60 degrees Fahrenheit, and with a chance of raining at 6 percent.",
            "Is there something else you want?",
            "Will you be going at the hotel on March 14th?",
            "Can you please confirm that you want to book 1 room for 3 days at the 1 Hotel Brooklyn Bridge in New York for March 6th?",
            "Your requested room at the hotel has been booked.",
            "The address of the hotel is 60 Furman Street, Brooklyn, and it will be costing you $208 per night.",
            "Is there something else I can do to help you with?",
            "Good bye, have a wonderful time!"
        ]
    },
    {
        "dialogue_id": "14_00019",
        "service": "Hotels_4",
        "service_call": {
            "method": {
                "method": "ReserveHotel",
                "parameters": {
                    "check_in_date": "2019-03-03",
                    "location": "Paris",
                    "number_of_rooms": "1",
                    "place_name": "Ac Hotel By Marriott Paris Porte Maillot",
                    "stay_length": "4"
                }
            }
        },
        "user_utterance": [
            "Can you help me find a hotel to stay at?",
            "Find me something in Paris, France.",
            "Possibly. What's their street address and phone number?",
            "Sounds like that hotel will work. Can you check the weather there for me on March 10th?",
            "Sounds good, how about on Monday next week?",
            "Awesome, can you reserve the hotel you found earlier for me for Monday next week?",
            "For four days.",
            "No, let me check in on the 3rd instead.",
            "Yes that is correct. Is smoking allowed in the hotel? And also what was the price per night.",
            "Awesome thank you. That will be all for now."
        ],
        "system_utterance": [
            "In which city would you like to find a hotel?",
            "I've found 10 hotels in Paris, France. How about the Ac Hotel By Marriott Paris Porte Maillot, which is a 4 star hotel?",
            "Their address is listed as 6 Rue Gustave Charpentier, 75017, and their phone number is listed as +33 1 84 82 49 09.",
            "There is expected to be a 2 percent chance of rain and the average temperature on March 10th is expected to be 80 degrees Fahrenheit.",
            "There is expected to be a 24 percent chance of rain and the average temperature on Monday next week is expected to be 87 degrees Fahrenheit.",
            "How long would you like to stay?",
            "You would like to book 1 room for 4 days starting on March 4th at the Ac Hotel By Marriott Paris Porte Maillot in Paris. Is that correct?",
            "You would like to check in on March 3rd for 4 days. is that correct?",
            "Your room has been booked. The price came to $312 per night. Smoking is not allowed.",
            "Okay, goodbye for now."
        ]
    },
    {
        "dialogue_id": "14_00020",
        "service": "Hotels_4",
        "service_call": {
            "method": {
                "method": "ReserveHotel",
                "parameters": {
                    "check_in_date": "2019-03-11",
                    "location": "Anaheim",
                    "number_of_rooms": "1",
                    "place_name": "Anaheim Desert Inn And Suites",
                    "stay_length": "2"
                }
            }
        },
        "user_utterance": [
            "I need to find a hotel, I need 1 room.",
            "I want a hotel in Anaheim.",
            "That sounds nice. Can you tell me what the weather will be like on the 11th.",
            "Okay, thanks for that.",
            "I want to book a room at that hotel.",
            "Yeah, that's my check in. And it's for two days.",
            "Yeah, that's good. Does the hotel allow smoking? And what's the room rate per night?",
            "Okay, thanks. You've been of great help.",
            "No, thanks again for helping."
        ],
        "system_utterance": [
            "Where do you want to search?",
            "There are 10 hotels that could work. Anaheim Desert Inn And Suites is a 2 star hotel.",
            "The day's average temperature will be 70 degrees Fahrenheit. The chance of rain is 11 percent.",
            "Do you need me to do anything else?",
            "Are you checking in on March 11th? And how long is your stay?",
            "I'll get you 1 room at Anaheim Desert Inn And Suites in Anaheim for 2 days with a check in on March 11th. Is that good?",
            "I've booked the room. There is no smoking at the hotel. The room is $60 per night.",
            "Do you need me for anything else?",
            "Okay, take care!"
        ]
    },
    {
        "dialogue_id": "14_00021",
        "service": "Hotels_4",
        "service_call": {
            "method": {
                "method": "ReserveHotel",
                "parameters": {
                    "check_in_date": "2019-03-06",
                    "location": "London",
                    "number_of_rooms": "1",
                    "place_name": "45 Park Lane",
                    "stay_length": "7"
                }
            }
        },
        "user_utterance": [
            "I'm looking for a hotel.",
            "I'm looking for a hotel in London, UK.",
            "Okay. What is the weather forecast there for the 12th?",
            "How humid or windy is it expected to be?",
            "Okay. I would like to reserve the hotel you found. I'm looking to check in on Wednesday next week for a seven day stay.",
            "Yes, that's right. What is their phone number?",
            "Thanks.",
            "No, that's all. Thanks."
        ],
        "system_utterance": [
            "Which city should I look for hotels in?",
            "I found 10 hotels matching your criteria. 45 Park Lane is a 5 star hotel. Would you like that one?",
            "The forecast average temperature for the day will be 87 degrees Fahrenheit, with a 21 percent chance of rain.",
            "The average wind speed should be 2 miles per hour, and humidity around 32 percent.",
            "Please confirm: You are booking 1 room at 45 Park Lane in London. You're checking in on March 6th and you will be staying for 7 days.",
            "You have successfully booked the hotel room. Their phone number is +44 20 7493 4545.",
            "Is there anything else I can help with?",
            "Have a good day!"
        ]
    },
    {
        "dialogue_id": "14_00022",
        "service": "Hotels_4",
        "service_call": {
            "method": {
                "method": "ReserveHotel",
                "parameters": {
                    "check_in_date": "2019-03-06",
                    "location": "London",
                    "number_of_rooms": "1",
                    "place_name": "45 Park Lane",
                    "stay_length": "3"
                }
            }
        },
        "user_utterance": [
            "I want a hotel.",
            "Find hotels in London, England.",
            "Sounds nice. Find out what the weather will be there on the 12th of this month.",
            "Okay. Reserve that hotel.",
            "I want to stay for 3 days.",
            "I want to check in next Wednesday.",
            "Okay, great.",
            "Thank you for helping me.",
            "No, that is it. You have been really helpful."
        ],
        "system_utterance": [
            "What city should I look in?",
            "I have 10 hotels that should work. There's a 5 star hotel called 45 Park Lane.",
            "The temperature should be 87 degrees fahrenheit on average with a 21 percent chance of rain.",
            "How long will you stay?",
            "Would you like to check in March 12th?",
            "Could you confirm that you need a hotel in 45 Park Lane for March 6th for 3 days? This hotel is in London and you need 1 room.",
            "You have booked the hotel successfully.",
            "Could I assist with anything further?",
            "Bye and have a great day."
        ]
    },
    {
        "dialogue_id": "14_00023",
        "service": "Hotels_4",
        "service_call": {
            "method": {
                "method": "ReserveHotel",
                "parameters": {
                    "check_in_date": "2019-03-03",
                    "location": "Sydney",
                    "number_of_rooms": "2",
                    "place_name": "Alpha Hotel Eastern Creek",
                    "stay_length": "1"
                }
            }
        },
        "user_utterance": [
            "I want to search for a four star hotel. I'm going to need 2 rooms and they should allow smoking.",
            "Search for hotels in Sydney.",
            "What's their telephone number and street they're located on?",
            "Are there any other hotels?",
            "What about any other hotels?",
            "I like the sound of that.",
            "We can do that later.",
            "What's the weather going to be like over there on the 7th of this month.",
            "And how about the humidity?",
            "And how about the wind?",
            "Please check the weather on March 10th too.",
            "Alright. I want to book a room at that hotel.",
            "I'll be checking in on Sunday this week. And I'll be there for 1 day.",
            "That's correct. What's the room rate per night?",
            "And can you get me their phone number?",
            "Thanks, you've been very helpful.",
            "No, thanks again for assisting me."
        ],
        "system_utterance": [
            "What city should I search in?",
            "There's Adina Apartment Hotel Sydney Darling Harbour. It has 4 stars.",
            "Their telephone number is +61 2 9249 7000 and they're located at 55 Shelley Street.",
            "There's Adina Apartment Hotel Sydney Surry Hills. It has 4 stars.",
            "There's Alpha Hotel Eastern Creek. It has 4 stars.",
            "Do you want to book a room?",
            "Will you be needing any further help?",
            "The day's average temperature should be 89 degrees. The chance of rain is 4 percent.",
            "There should be around 18 percent humidity.",
            "The wind will be about 9 miles per hour.",
            "The day's average temperature should be 92 degrees. The chance of rain is 5 percent.",
            "Will you be checking in on March 10th? And how long will you be there?",
            "I'll get you 2 rooms at Alpha Hotel Eastern Creek in Sydney for 1 day with a check in on March 3rd. Is that correct?",
            "I've booked the rooms. A room is $312 per night.",
            "+61 2 8889 7700 is their phone number.",
            "Do you need any more help?",
            "Have a good day and take care."
        ]
    },
    {
        "dialogue_id": "14_00024",
        "service": "Hotels_4",
        "service_call": {
            "method": {
                "method": "ReserveHotel",
                "parameters": {
                    "check_in_date": "2019-03-01",
                    "location": "Sydney",
                    "number_of_rooms": "2",
                    "place_name": "Amora Hotel",
                    "stay_length": "4"
                }
            }
        },
        "user_utterance": [
            "Assitant, please help me book a hotel room.",
            "Find nice hotel rooms in Sydney, Australia for me.",
            "And what is the street address for it?",
            "I also need the phone number. Oh and tell me if smoking is allowed.",
            "Is that the only hotel that meets my requirements? I need 2 rooms in a five - star hotel.",
            "That sounds like a great place to stay.",
            "Not right this second.",
            "Tell me the forecast for Sydney Australia.",
            "What date is it?",
            "Okay thanks for that. Back to the hotel room. I want to stay four days in the Amora Hotel. Please create a reservation for me.",
            "Yeah that will be fine. The weather will be nice.",
            "Sounds good to me.",
            "Can you provide the street address as well as the cost of the rooms?",
            "Thank you so much. You've been a big help to me today.",
            "No that's all for now. I appreciate you helping me out so much."
        ],
        "system_utterance": [
            "I can do that. Please provide the city to conduct the search in.",
            "There is a lovely 4 star hotel in Sydney called the 28 Hotel Sydney.",
            "The address of the 28 Hotel Sydney is 28 Regent Street, Chippendale New South Wales 2008, Australia.",
            "The phone number is +61 2 9102 2828. The hotel is a no smoking area.",
            "Sydney has a lovely 5 star hotel called the Amora Hotel. Are you interested in that establishment?",
            "Do you wish to make a reservation at this time?",
            "Can I assist you with anything else then?",
            "There is a 4 percent chance of rain with a temperature of 94 degrees that day.",
            "This forecast is for March 1st.",
            "Is your check-in date on March 1st?",
            "Confirm the following details: You wish to stay 4 days in the Amora Hotel in Sydney. You will be checking in to 2 rooms on March 1st.",
            "I have successfully booked your hotel rooms at Amora.",
            "The htoel is located at 11 Jamison Street. Concerning the cost, the price will be $555 a night.",
            "Is there anything else you need help with?",
            "My pleasure. Have a great day!"
        ]
    },
    {
        "dialogue_id": "14_00025",
        "service": "Hotels_4",
        "service_call": {
            "method": {
                "method": "ReserveHotel",
                "parameters": {
                    "check_in_date": "2019-03-11",
                    "location": "Nairobi",
                    "number_of_rooms": "1",
                    "place_name": "Azure Hotel Nairobi Westlands",
                    "stay_length": "2"
                }
            }
        },
        "user_utterance": [
            "I want to find a hotel.",
            "I would like to find a hotel in Nairobi.",
            "That sounds good. I would like to check what the weather there will be on the 2nd.",
            "What is the wind going to be like? What is the humidity expected to be?",
            "Okay, what will it be like on the 13th?",
            "Sure, that's fine. I want to reserve the hotel you found. I need 1 room and will stay for two days. I want to check in on 11th of this month.",
            "Yes, this is very good.",
            "Thanks, that's really helpful for me. That's all I needed."
        ],
        "system_utterance": [
            "Which city do you want me to look for a hotel in?",
            "I have located 10 hotels that fit your criteria. One is a hotel called Azure Hotel Nairobi Westlands. This is a 5 star hotel.",
            "The average temperature on that day should be 86 degree Fahrenheit and there will be a 6 percent chance of rain.",
            "The wind on that day should average 2 miles per hour and the humidity will be about 20 percent.",
            "The average temperature on that day should be 89 degrees Fahrenheit and there will be a 1 percent chance of rain.",
            "Please confirm these details for me: You would like to book 1 room at the Azure Hotel Nairobi Westlands in Nairobi on March 11th for 2 days.",
            "I successfully booked the hotel for you.",
            "By, have a wonderful day!"
        ]
    },
    {
        "dialogue_id": "14_00026",
        "service": "Hotels_4",
        "service_call": {
            "method": {
                "method": "ReserveHotel",
                "parameters": {
                    "check_in_date": "2019-03-07",
                    "location": "Paris",
                    "number_of_rooms": "2",
                    "place_name": "Ac Hotel By Marriott Paris Porte Maillot",
                    "stay_length": "6"
                }
            }
        },
        "user_utterance": [
            "I'm going to be needing a hotel, can you help me book one please.",
            "I will be staying in Paris, France, so let's look there.",
            "Great, that will do.",
            "No, not now.",
            "Yes, I wanted to know the weather for March 9th there.",
            "Ok, thanks. Let's go ahead and reserve that room we we're just discussing. I'm going to need 1 room for 7 days. I am going to be arriving to check in on the 7th.",
            "No, let's adjust this to two room for 6 days please.",
            "Yes, proceed.",
            "Cool, what's the address to the hotel and I will also need the phone number as well.",
            "Great, thank you. Good bye."
        ],
        "system_utterance": [
            "Sure, which city will you need a hotel in?",
            "Alright, I've got 10 hotels for you. let's start with Ac Hotel By Marriott Paris Porte Maillot, this hotel has a 4 star rating.",
            "Ok, should I reserve a room now?",
            "Ok, I understand. Will there be anything else I can assist you with?",
            "Sure, It should be 83 degrees with a 14 percent chance of rain on March 9th.",
            "Ok, please confirm reservation for 1 room at Ac Hotel By Marriott Paris Porte Maillot in Paris. Check in is on March 7th and have you staying for 7 days. Is this correct?",
            "Sure, no problem. Please confirm a reservation for 2 rooms for a stay of 6 days. Is this correct?",
            "Great, I was able to reserve your rooms with no issues.",
            "The address is 6 Rue Gustave Charpentier, 75017 and the phone is +33 1 84 82 49 09.",
            "Alright, Good bye."
        ]
    },
    {
        "dialogue_id": "14_00027",
        "service": "Hotels_4",
        "service_call": {
            "method": {
                "method": "ReserveHotel",
                "parameters": {
                    "check_in_date": "2019-03-04",
                    "location": "New York",
                    "number_of_rooms": "1",
                    "place_name": "1 Hotel Brooklyn Bridge",
                    "stay_length": "3"
                }
            }
        },
        "user_utterance": [
            "I want to search for a four star hotel in NY.",
            "Okay, cool. Can you tell me about the weather on the 14th.",
            "Alright, what about the weather on the 11th.",
            "Okay. Let's get back to that hotel. I want to book a room. I'll be there for 3 days.",
            "No, I'll check in on the 4th.",
            "Yeah, that's correct.",
            "Where are they located?",
            "Thanks, you've been super helpful.",
            "No, thanks for the helping me out."
        ],
        "system_utterance": [
            "There are 10 hotels that match. 1 Hotel Brooklyn Bridge is a 4 star hotel.",
            "The day's average temperature is 60 degrees Fahrenheit. The chance of ran is 6 percent.",
            "The day's average temperature is 65 degrees Fahrenheit. The chance of ran is 34 percent.",
            "Will you check in on March 11th?",
            "I'll book you 1 room at 1 Hotel Brooklyn Bridge in New York. Check in is on March 4th and your stay is for 3 days. Is that correct?",
            "The room has been booked.",
            "They are located on 60 Furman Street, Brooklyn.",
            "Do you need anything else?",
            "Farewell and have a nice day!"
        ]
    },
    {
        "dialogue_id": "14_00028",
        "service": "Hotels_4",
        "service_call": {
            "method": {
                "method": "ReserveHotel",
                "parameters": {
                    "check_in_date": "2019-03-06",
                    "location": "New York",
                    "number_of_rooms": "3",
                    "place_name": "1 Hotel Brooklyn Bridge",
                    "stay_length": "7"
                }
            }
        },
        "user_utterance": [
            "I am in need of assistance to find a hotel.",
            "In New York City.",
            "I like the sound of that. What about the weather forecast for 14th of March.",
            "Will it be humid or windy?",
            "that's fine. I would like to reserve that hotel you mentioned now, 3 rooms are required for seven days from the 6th.",
            "Yes that is correct.",
            "Thanks, I really appreciate it goodbye."
        ],
        "system_utterance": [
            "In which city?",
            "There is a 4 star called 1 Hotel Brooklyn Bridge.",
            "There is a 6 % chance of rain and the temp will be around 60 degrees fahrenheit.",
            "Ave wind will be 9 mph and humidity is 19 %.",
            "To confirm then that is 3 rooms at 1 Hotel Brooklyn Bridge in New York from March 6th for 7 days.",
            "The booking is now confirmed.",
            "Have a lovely day."
        ]
    },
    {
        "dialogue_id": "14_00029",
        "service": "Hotels_4",
        "service_call": {
            "method": {
                "method": "ReserveHotel",
                "parameters": {
                    "check_in_date": "2019-03-08",
                    "location": "Sydney",
                    "number_of_rooms": "1",
                    "place_name": "57 Hotel",
                    "stay_length": "4"
                }
            }
        },
        "user_utterance": [
            "I want to find a hotel.",
            "I want a hotel in Sydney.",
            "What does it cost per night there?",
            "Could you tell me the street address?",
            "Do you have anything else that would suit me?",
            "Sounds good. Check out the weather there for the 9th of this month.",
            "What about the wind?",
            "How humid will it be?",
            "Sounds good. Please reserve the hotel that you found. I will need 2 rooms and will stay for 4 days.",
            "I would like one room to check in on 8th of this month.",
            "Sure, okay. What is the phone number and price per night?",
            "Thanks, I really appreciate the help.",
            "No, thank you. You have been helpful to me."
        ],
        "system_utterance": [
            "What city should I look in?",
            "How about this 4 star hotel called 28 Hotel Sydney?",
            "It's $232 per night.",
            "The street address is 28 Regent Street, Chippendale New South Wales 2008, Australia.",
            "How about the 4 star 57 hotel?",
            "The temperature on average for that day should be 93 degrees Fahrenheit with a 6 percent chance of rain.",
            "The average wind speed is forecasted to be about 12 miles per hour.",
            "The humidity will be about 16 percent.",
            "How about checking in on March 9th?",
            "Could you confirm that you want to book 1 room for 4 days at 57 hotel in Sydney from March 8th?",
            "I have booked the hotel successfully. The phone number is +61 2 9011 5756 and it is $100 per night.",
            "Would I be able to help with anything futher?",
            "Bye and have a great day!"
        ]
    },
    {
        "dialogue_id": "14_00030",
        "service": "Hotels_4",
        "service_call": {
            "method": {
                "method": "ReserveHotel",
                "parameters": {
                    "check_in_date": "2019-03-04",
                    "location": "New York",
                    "number_of_rooms": "2",
                    "place_name": "1 Hotel Central Park",
                    "stay_length": "6"
                }
            }
        },
        "user_utterance": [
            "In need a hotel.",
            "NYC.",
            "What is the address? What is the cost per night?",
            "Anything else? I need two smoking rooms.",
            "Sounds awesome.",
            "No, maybe later.",
            "I want to check the weather in NYC.",
            "What about on the 9th?",
            "Sure, lets reserve that hotel.",
            "I am checking in on Thursday next week.",
            "7 Days.",
            "No, I need it for 6 days and checking out on the 4th of this month.",
            "Yes, that is correct.",
            "What is the price per night and the phone number?",
            "Ok, thanks. That is all for now."
        ],
        "system_utterance": [
            "In what city?",
            "I found 10 hotels including 1 Hotel Brooklyn Bridge, it is a 4 star hotel.",
            "The address is 60 Furman Street, Brooklyn and the tickets are $176.",
            "I found 1 Hotel Central Park, it is a 5 star hotel.",
            "Are you ready to make your reservation?",
            "Anything else?",
            "The average temperature is 66 degrees with a 37 percent chance of rain.",
            "The temperature will be around 70 degrees with a 38 percent chance of rain.",
            "Are you checking in on March 9th?",
            "How long are you staying?",
            "Please confirm, reservation at 1 Hotel Central Park in New York on March 7th for 7 days. Reserving 2 rooms.",
            "Confirm, checking out on March 4th, staying 6 days.",
            "Your rooms are reserved.",
            "The phone number is +1 212-703-2001 and is $270 per night.",
            "Bye!"
        ]
    },
    {
        "dialogue_id": "14_00031",
        "service": "Hotels_4",
        "service_call": {
            "method": {
                "method": "ReserveHotel",
                "parameters": {
                    "check_in_date": "2019-03-01",
                    "location": "London",
                    "number_of_rooms": "1",
                    "place_name": "Abc Hyde Park Hotel",
                    "stay_length": "7"
                }
            }
        },
        "user_utterance": [
            "Can you please help me search for a hotel for my upcoming vacation",
            "I will be vacationing in the London, so I need a hotel in London, England",
            "Are there other hotels fitting my requirements?",
            "That seems like a nice option",
            "not at the present time.",
            "Can you tell me what kind of weather I can expect there on the 1st?",
            "Great, sounds good. I want to go ahead and book a room in the last hotel you mentioned",
            "Great, this works. I will be there for seven days",
            "Yes, that's precisely it",
            "Thank you so much for your assistance",
            "No, that's all for me. Thanks again!"
        ],
        "system_utterance": [
            "Where would you like to find a hotel?",
            "There is 45 Park Lane which is a 5 star hotel",
            "There is also a 3 star hotel, Abc Hyde Park Hotel",
            "Do you want to go ahead and book a stay at this hotel?",
            "Do you need assistance with anything further?",
            "On that date, the weather will be approximately 81 degrees Fahrenheit with a 23 percent likelihood of precipitation",
            "Is your check in date March 1st? And what is the length of your stay?",
            "So to be clear, you would like to reserve 1 room in the Abc Hyde Park Hotel in London, for a 7 day stay beginning on March 1st",
            "Your reservation has been confirmed",
            "Do you need further assistance?",
            "Take care and have a nice day!"
        ]
    },
    {
        "dialogue_id": "14_00032",
        "service": "Hotels_4",
        "service_call": {
            "method": {
                "method": "ReserveHotel",
                "parameters": {
                    "check_in_date": "2019-03-01",
                    "location": "Delhi",
                    "number_of_rooms": "1",
                    "place_name": "Aloft New Delhi Aerocity",
                    "stay_length": "5"
                }
            }
        },
        "user_utterance": [
            "Would you help me find a hotel please?",
            "In Delhi please.",
            "Okay. Could you let me know what the weather will be like March 5th?",
            "And what about the humidity level?",
            "Thanks. Let's book that hotel room now please.",
            "No, the 1st of March.",
            "One room, 5 days.",
            "Great, sounds good to me.",
            "Thanks a lot.",
            "No, thanks again."
        ],
        "system_utterance": [
            "Where would you like to stay?",
            "How about Aloft New Delhi Aerocity? It has a 4 star rating.",
            "Sure, the temperature will average 90 degrees Fahrenheit and the rain possibility will be 7 percent.",
            "21 percent, more or less.",
            "On March 5th?",
            "For how long?",
            "Confirming a 5 day stay in Delhi on March 1st at Aloft New Delhi Aerocity, 1 room.",
            "The reservation has been completed.",
            "Anything else today?",
            "It's my pleasure."
        ]
    },
    {
        "dialogue_id": "14_00033",
        "service": "Hotels_4",
        "service_call": {
            "method": {
                "method": "ReserveHotel",
                "parameters": {
                    "check_in_date": "2019-03-02",
                    "location": "Vancouver",
                    "number_of_rooms": "2",
                    "place_name": "Best Western Plus Chateau Granville Hotel & Suites & Conference Ctr.",
                    "stay_length": "5"
                }
            }
        },
        "user_utterance": [
            "I need to find a hotel please.",
            "I need one on Vancouver.",
            "What else did you find?",
            "What else did you find?",
            "What is the street address of the hotel? How much is it per night?",
            "Sounds great thanks.",
            "Maybe at another time. What is the weather going to be like on the 4th of this month?",
            "Okay, great. I would like to make hotel reservations for 2 rooms for 5 days. I need to check in on the 2nd.",
            "Yes that is correct.",
            "Thanks for your help. That's all I needed for now."
        ],
        "system_utterance": [
            "Which city would you like me to check in?",
            "I found 10 in Vancouver. A nice 3 star is the Atrium Inn Vancouver.",
            "There is a nice 4 star called Auberge Vancouver Hotel.",
            "There is another nice 3 star, the Best Western Plus Chateau Granville Hotel & Suites & Conference Ctr.",
            "The address is 1100 Granville Street and it's $72 per night.",
            "WOuld you like to make a reservation?",
            "The average temp will be 58 degrees and there is a 49 percent chance of rain.",
            "You want 2 rooms for 5 days on March 2nd at the best WEstern Plus Chateau Granville Hotel & Suites & Conference Ctr. in Vancouver, correct?",
            "The hotel has been booked.",
            "Okay have a great day!"
        ]
    },
    {
        "dialogue_id": "14_00034",
        "service": "Hotels_4",
        "service_call": {
            "method": {
                "method": "ReserveHotel",
                "parameters": {
                    "check_in_date": "2019-03-01",
                    "location": "Paris",
                    "number_of_rooms": "1",
                    "place_name": "Ac Hotel By Marriott Paris Porte Maillot",
                    "stay_length": "2"
                }
            }
        },
        "user_utterance": [
            "Hi there, could you find me some hotels please?",
            "Something in Paris, France is fine!",
            "Sure, that is fine!",
            "Perhaps later, could you check the weather there for me?",
            "Sure, could you get me a reservation at the hotel on the 1st?",
            "Just two days, please.",
            "Sure, could I have their contact number and address please?",
            "Sure, thank you! That is all I need for now."
        ],
        "system_utterance": [
            "Sure, where would you like to search in?",
            "Would you like a 4 star hotel called Ac Hotel By Marriott Paris Porte Maillot?",
            "Would you like to make a reservation?",
            "Sure, it is 77 degrees Fahrenheit with a 26 percent chance of rain.",
            "How long do you intend to stay?",
            "Sure, please confirm your reservation for 1 room at Ac Hotel By Marriott Paris Porte Maillot in Paris on March 1st for 2 days.",
            "You can call them at +33 1 84 82 49 09 and visit them at 6 Rue Gustave Charpentier, 75017! Your reservation has been made.",
            "No worries, enjoy!"
        ]
    },
    {
        "dialogue_id": "14_00035",
        "service": "Hotels_4",
        "service_call": {
            "method": {
                "method": "ReserveHotel",
                "parameters": {
                    "check_in_date": "2019-03-02",
                    "location": "Sydney",
                    "number_of_rooms": "3",
                    "place_name": "28 Hotel Sydney",
                    "stay_length": "6"
                }
            }
        },
        "user_utterance": [
            "I will be travelling soon and I would like to find a four star hotel with three available rooms",
            "I need to find a hotel in Sydney",
            "Great, this sounds perfect. Can you tell me what the weather will be like there on this Saturday?",
            "Great, sounds good",
            "I want to go ahead and book a reservation for the hotel you mentioned earlier. I am hoping to check in this Saturday for a 6 day stay.",
            "Yes, that's it exactly. Can you tell me the cost for each night as well as their exact location?",
            "Great, thanks so much for all of your help!",
            "No, that's it for me. You've been of great assistance"
        ],
        "system_utterance": [
            "And in what location would you like to search?",
            "There are 10 hotels that fit your requirements. One such hotel is 28 Hotel Sydney and it is a 4 star hotel",
            "On that day, the temperature will be approximately 101 degrees Fahrenheit and there is a 2 percent chance of precipitation",
            "Would you like assistance with anything additional?",
            "To confirm, you would like to reserve 3 rooms at the 28 Hotel Sydney, located in Sydney, for a 6 day stay beginning on March 2nd.",
            "Your reservation has been confirmed at this hotel. The hotel is located at 28 Regent Street, Chippendale New South Wales 2008, Australia. The price for a one night stay is $264.",
            "Will there be anything further?",
            "Take care and have a lovely day!"
        ]
    },
    {
        "dialogue_id": "14_00036",
        "service": "Hotels_4",
        "service_call": {
            "method": {
                "method": "ReserveHotel",
                "parameters": {
                    "check_in_date": "2019-03-02",
                    "location": "London",
                    "number_of_rooms": "1",
                    "place_name": "Amba Hotel Marble Arch",
                    "stay_length": "7"
                }
            }
        },
        "user_utterance": [
            "I need to find a 4 star hotel in London.",
            "Do you have a contact number?",
            "Are there any other options?",
            "What's their address and phone number?",
            "Are there any other hotels in the area?",
            "That one sounds good. What will the weather be like there the day after tomorrow?",
            "What will the humidity be like and how windy?",
            "Great thanks. I would like to book 1 room for 7 days.",
            "Can you book from the 2nd of this month please?",
            "Yes. Great. What's their address?",
            "Great. Thanks. That's all I need."
        ],
        "system_utterance": [
            "Ace Hotel London is a 4 star hotel in the area.",
            "Their number is +44 20 7613 9800.",
            "Amba Hotel Charing Cross is a 4 star hotel in the area.",
            "They're located at Strand and their number is +44 871 376 9012.",
            "Amba Hotel Marble Arch is a 4 star hotel in the area.",
            "The average temperature will be 88 degrees Fahrenheit with a 29 percent chance of rain.",
            "The humidity will be around 66 percent with a wind speed of 2 miles per hour.",
            "Will you be checking in on March 3rd?",
            "Please confirm you want me book 1 room at Amba Hotel Marble Arch on March 2nd in London for 7 days.",
            "Your booking was a success. The hotel is located at Bryanston Street.",
            "You're welcome. Have a great day."
        ]
    },
    {
        "dialogue_id": "14_00037",
        "service": "Hotels_4",
        "service_call": {
            "method": {
                "method": "ReserveHotel",
                "parameters": {
                    "check_in_date": "2019-03-02",
                    "location": "Chicago",
                    "number_of_rooms": "1",
                    "place_name": "Ac Hotel By Marriott Chicago Downtown",
                    "stay_length": "4"
                }
            }
        },
        "user_utterance": [
            "I need to look for a hotel, and need 1 room. I need a 3 star hotel in Chicago.",
            "That sounds great.",
            "Yeah, what's the weather there on next Monday?",
            "Okay, now I would like to book a hotel.",
            "I'll be there for 4 days and actually on the 2nd of March.",
            "Yes, it is. Is smoking allowed? What is the contact number?",
            "Alright, thanks a lot!"
        ],
        "system_utterance": [
            "There is a hotel called Ac Hotel by Marriott Chicago Downtown. It is a 3 star hotel.",
            "Is there anything else that I may help you with?",
            "The average temperature for next Monday is predicted to be around 65 degrees Fahrenheit. There is a 35 percent chance of rain.",
            "Would you like to check in on the date of March 4th? What is the duration of your stay?",
            "Please confirm the following information: Booking 1 room in Ac Hotel By Marriott Chicago Downtown in Chicago. The date of check in is designated as March 2nd and your stay is for 4 days. Is this correct?",
            "Your reservation has been confirmed. The phone number of the reception desk is +1 312-981-6600 and no smoking is allowed on the property.",
            "Of course. Have a wonderful day."
        ]
    },
    {
        "dialogue_id": "14_00038",
        "service": "Hotels_4",
        "service_call": {
            "method": {
                "method": "ReserveHotel",
                "parameters": {
                    "check_in_date": "2019-03-01",
                    "location": "London",
                    "number_of_rooms": "1",
                    "place_name": "Ace Hotel London",
                    "stay_length": "5"
                }
            }
        },
        "user_utterance": [
            "I need to book 1 hotel room please and I'd like a four star hotel, if possible.",
            "In London, UK please.",
            "What's the contact number there?",
            "Okay, that's fine.",
            "Not at the moment, thanks.",
            "Yes, I want to know the forecast please.",
            "What ahout the wind conditions? And can you verify which date we're talking about?",
            "Okay, great. Let's go ahead and book that hotel room. It's going to be a five day stay starting on the 1st of this month.",
            "Thanks. How much is the room and can I smoke there?",
            "Thank you for your help.",
            "No, thank you."
        ],
        "system_utterance": [
            "In what city please?",
            "There are 10 possible hotels for you. I have a hotel with a 4 star rating to recommend, which is Ace Hotel London.",
            "That number is +44 20 7613 9800.",
            "Shall I book that for you?",
            "Anyting else today?",
            "The average Fahrenheit temperature is 81 degrees with a 23 percent chance of precipitation.",
            "Yes, this is for March 1st and the wind will average 10 mph.",
            "Confirming a 5 day reservation for 1 at Ace Hotel London in London on March 1st.",
            "Sorry, it's a non smoking hotel. The room costs $200 a night and the room has been booked.",
            "May I help you with anything else?",
            "Thank you very much."
        ]
    },
    {
        "dialogue_id": "14_00039",
        "service": "Hotels_4",
        "service_call": {
            "method": {
                "method": "ReserveHotel",
                "parameters": {
                    "check_in_date": "2019-03-05",
                    "location": "Philadelphia",
                    "number_of_rooms": "1",
                    "place_name": "Hilton Philadelphia At Penn'S Landing",
                    "stay_length": "6"
                }
            }
        },
        "user_utterance": [
            "Can you help me find a three star hotel?",
            "Look for hotels in Philly.",
            "What else is there? Any 4 star hotels?",
            "Alright, thank you. Can you check the weather there on the 7th?",
            "How windy and humid is it going to be?",
            "Okay, thanks. Can you reserve the hotel you found?",
            "I want to check in March 5th and stay for 6 days.",
            "Yes, that works just fine. What's the street address?",
            "Do they allow smoking?",
            "Thanks so much for the help.",
            "No, really, thanks."
        ],
        "system_utterance": [
            "Where would you like me to look?",
            "There is a 3 star hotel called Aka University City.",
            "I found 9 possibles. There is a 4 star hotel called Hilton Philadelphia At Penn's Landing.",
            "The average temperature that day is 91 degrees F with an 11 % chance of rain.",
            "It is estimated to be 7 mph wind with humidity at 20 %.",
            "Do you want to check in on March 7th? How long will you be staying for?",
            "Please confirm: You want 1 room for 6 days in Philadelphia at the Hilton Philadelphia At Penn's Landing, checking in March 5th.",
            "Your reservation is confirmed. Their address is 201 South Christopher Columbus Boulevard.",
            "No, there is no smoking allowed.",
            "Is there anything else I can assist you with?",
            "Enjoy your day!"
        ]
    },
    {
        "dialogue_id": "14_00040",
        "service": "Hotels_4",
        "service_call": {
            "method": {
                "method": "ReserveHotel",
                "parameters": {
                    "check_in_date": "2019-03-03",
                    "location": "San Diego",
                    "number_of_rooms": "1",
                    "place_name": "Bahia Resort Hotel",
                    "stay_length": "7"
                }
            }
        },
        "user_utterance": [
            "I am searching for a hotel.",
            "I'm searching for hotels in San Diego.",
            "How much does it cost per day?",
            "Does the hotel permit smoking?",
            "That's fine with me.",
            "Perhaps later. I'd like to verify the weather there on 6th of March.",
            "Sure, alright. I'd like to book the hotel you mentioned.",
            "My stay will last 7 days.",
            "I plan to check in on 3rd of March.",
            "Alright, that's wonderful. Can you tell me their contact number?",
            "Thank you for your assistance.",
            "No, thank you for your assistance."
        ],
        "system_utterance": [
            "What metropolis ought I search for hotels in?",
            "There is a 3 star hotel named Bahia Resort Hotel.",
            "The price is $189 per day.",
            "No, the hotel does not permit smoking.",
            "Do you wish to book this hotel?",
            "The mean temperature on that date ought to be 80 degrees Fahrenheit, with a 6 percent probability of rain.",
            "How many days will you stay for?",
            "Would you like to check in on March 6th?",
            "Please verify the following information: you want 1 room at Bahia Resort Hotel for 7 days in San Diego on March 3rd.",
            "Your reservation is complete. The contact number is +1 858-539-8666.",
            "Do you require me to assist with something else?",
            "Good bye, and have a pleasant afternoon!"
        ]
    },
    {
        "dialogue_id": "14_00041",
        "service": "Hotels_4",
        "service_call": {
            "method": {
                "method": "ReserveHotel",
                "parameters": {
                    "check_in_date": "2019-03-06",
                    "location": "London",
                    "number_of_rooms": "1",
                    "place_name": "45 Park Lane",
                    "stay_length": "7"
                }
            }
        },
        "user_utterance": [
            "I want to find a hotel.",
            "I want to find hotels in London.",
            "Okay. What is the weather like there?",
            "How windy and humid will itbe?",
            "What about 12th of March?",
            "Okay. I want to reserve that hotel and I need one room. I'll check in on the 6th.",
            "I want to stay for 3 days.",
            "No, I will be staying for seven days.",
            "Okay,this is good. Will smoking be allowed? Where is it located?",
            "Thank you. You have been helpful. That is all for now."
        ],
        "system_utterance": [
            "What city should I look in?",
            "There is a 5 star hotel called 45 Park Lane.",
            "The temperature on average should be about 81 degrees Fahrenheit with a 23 percent chance of rain.",
            "The wind speed should be about 10 miles per hour and the humidty around 35 percent.",
            "The temperature on average is expected to beabout 87 degrees Fahrenheit with a 21 percent chance of rain.",
            "How long will you stay?",
            "Could you confirm that you want to find a hotel 45 Park Lane? You will check in on March 6th for 3 days and you need 1 room. This hotel is located in London. Is all of this correct?",
            "Could you confirm that you are checking in on March 6th for 7 days?",
            "I have booked the hotel successfully. The address is 45 Park Lane. Smoking is not allowed on the property.",
            "Bye, have a good one."
        ]
    },
    {
        "dialogue_id": "14_00042",
        "service": "Hotels_4",
        "service_call": {
            "method": {
                "method": "ReserveHotel",
                "parameters": {
                    "check_in_date": "2019-03-01",
                    "location": "Toronto",
                    "number_of_rooms": "1",
                    "place_name": "Best Western Primrose Hotel Downtown-Toronto",
                    "stay_length": "3"
                }
            }
        },
        "user_utterance": [
            "Get me a hotel reservation.",
            "I want to stay in Toronto.",
            "What else can you find?",
            "Do they allow smoking in the building?",
            "How much does it cost per night?",
            "What other hotels can you find?",
            "That works for me.",
            "No, not at the moment.",
            "What is the weather going to be there on the 1st of this month.",
            "What is about the humidity and the wind?",
            "I see. Get the 1 room for 3 days on the 1st of this month at the previous hotel you found.",
            "That is right. What is their physical address and do they allow smoking?",
            "Thanks for your help.",
            "No, not right now. Thanks again."
        ],
        "system_utterance": [
            "What city do you want to stay in?",
            "Search revealed 10 results. Best Western Plus Toronto North York Hotel & Suites is rated 3 stars.",
            "Best Western Premier Toronto Airport Carlingview Hotel is rated 3 stars.",
            "There is no smoking there.",
            "The cost per each night is $351.",
            "Best Western Primrose Hotel Downtown-Toronto is rated at 3 stars.",
            "Shall I get you a room?",
            "Do you need more help?",
            "The forecast is a temperature of 58 degrees and a 13 percent chance of rain",
            "Humidity is expected to be 25 percent with wind blowing at 9 miles per hour.",
            "You want 1 room for 3 days at Best Western Primrose Hotel Downtown-Toronto in Toronto on March 1st, correct?",
            "Your room is booked. You can find them at 111 Carlton Street and there is no smoking.",
            "Do you need more help?",
            "Goodbye and have a wonderful day."
        ]
    },
    {
        "dialogue_id": "14_00043",
        "service": "Hotels_4",
        "service_call": {
            "method": {
                "method": "ReserveHotel",
                "parameters": {
                    "check_in_date": "2019-03-05",
                    "location": "San Diego",
                    "number_of_rooms": "1",
                    "place_name": "Bahia Resort Hotel",
                    "stay_length": "4"
                }
            }
        },
        "user_utterance": [
            "Hello. Can you find me 1 hotel room in SD?",
            "Sounds good to me.",
            "Not right now.",
            "I want to make sure the weather on the 5th is alright.",
            "How windy and humid is it expected to be?",
            "Okay. That weather is fine. I'd like to rent the hotel now.",
            "For four days.",
            "That sounds good to me.",
            "I sure do.",
            "Thanks so much. You've been a great help today. That's all for now."
        ],
        "system_utterance": [
            "Sure. I found 10 possibilities. There's a 3 star hotel there called Bahia Resort Hotel.",
            "Want to rent it?",
            "Can I help with something else?",
            "The temperature then should be about 84 degrees Fahrenheit, with an 8 percent chance of rain.",
            "That day should have wind speeds of roughly 4 miles per hour, and a humidity level of around 21 percent.",
            "For how many days?",
            "Do you want your stay to begin on March 5th?",
            "Alright. You'll book 1 room in Bahia Resort Hotel in San Diego for 4 days, starting March 5th?",
            "I booked the hotel for you.",
            "See you later! Enjoy the rest of your day!"
        ]
    },
    {
        "dialogue_id": "14_00044",
        "service": "Hotels_4",
        "service_call": {
            "method": {
                "method": "ReserveHotel",
                "parameters": {
                    "check_in_date": "2019-03-02",
                    "location": "Los Angeles",
                    "number_of_rooms": "1",
                    "place_name": "Airtel Plaza Hotel",
                    "stay_length": "7"
                }
            }
        },
        "user_utterance": [
            "I need to book a hotel for my trip out of town. Can you help me find a suitable one?",
            "I would like to find a 3 star hotel in LAX",
            "That works. Can you tell me what the weather will be like there on the 4th?",
            "Great, sounds good. I want to go ahead and make a book a room at the hotel you mentioned earlier.",
            "I would like to check in on the 2nd of this month for a total of 7 days",
            "Yes, that sounds fine",
            "Great, that's it for me right now. Thanks for your help!"
        ],
        "system_utterance": [
            "Where would you like to find a hotel?",
            "There is a 3 star hotel named Airtel Plaza hotel",
            "On that day, the temperature will be approximately 81 degrees Fahrenheit with a 16 percent chance of precipitation",
            "You would like to check in on March 4th? And what is the length of your stay?",
            "To confirm, you would like to make a reservation for a 7 day stay beginning on March 2nd in the Airtel Plaza Hotel in Los Angeles. You would like to reserve 1 room.",
            "Your reservation has been confirmed.",
            "Take care and have a nice day!"
        ]
    },
    {
        "dialogue_id": "14_00045",
        "service": "Restaurants_2",
        "service_call": {
            "method": {
                "method": "GetRide",
                "parameters": {
                    "destination": "425 Main Street",
                    "number_of_riders": "2",
                    "shared_ride": "True"
                }
            }
        },
        "user_utterance": [
            "I'm getting hungry but I don't want to cook. I need to find a place to eat.",
            "Find some restaurants in Pleasanton.",
            "Look for something that serves Brasserie.",
            "That sounds good. Let's reserve a table there.",
            "Let's make the reservation for 12:30 pm.",
            "Yes, sounds good.",
            "Can I get a cab ride there for me and my friends?",
            "Yes, that's right.",
            "A shared ride is just fine.",
            "Yes, that works. What's the cost?",
            "And how long will it take to get there?",
            "Thanks for all your help, that's all for now."
        ],
        "system_utterance": [
            "What area should I search in?",
            "What type of food would you like?",
            "I found Nonni's Bistro that's located in Pleasanton.",
            "What time would you like a reservation for?",
            "Okay, let's confirm: We're booking a table for 2 on March 1st at 12:30 pm at Nonni's Bistro located in Pleasanton.",
            "I've made your reservation.",
            "And you're heading to 425 Main Street?",
            "How about a shared ride?",
            "Okay, let's confirm: You are booking a shared cab ride for 2 people to 425 Main Street.",
            "Your cab is booked and on its way. The cost is $13.32.",
            "The ride is about 23 minutes",
            "Have a great day!"
        ]
    },
    {
        "dialogue_id": "14_00046",
        "service": "Restaurants_2",
        "service_call": {
            "method": {
                "method": "GetRide",
                "parameters": {
                    "destination": "Egg Roll King",
                    "number_of_riders": "2",
                    "shared_ride": "True"
                }
            }
        },
        "user_utterance": [
            "Hi, are there any nice places I can eat at?",
            "Something in SF is fine.",
            "Something which serves sushi will be fine.",
            "Where are they located at?",
            "I see, are there any alternatives?",
            "Are there any vegetarian food served and do they have outdoor seating?",
            "I see, that is fine. Could you make a reservation for one on the 12th at 12:15 in the afternoon?",
            "Sure, what is the price range of their food and how are they rated?",
            "Could you try reserving on the 13th instead?",
            "Could you reserve the table for two instead?",
            "Could you reserve it at twelve pm instead?",
            "Sure, that is fine with me.",
            "Could you get me a cab ride with my friends please?",
            "Sure, I do not mind a shared ride.",
            "Sorry, could I go to Egg Roll King instead?",
            "That is fine with me!",
            "Thank you, that is all I need for now."
        ],
        "system_utterance": [
            "Any preferred locations?",
            "Any food preferences you might have?",
            "There are 10 restaurants in San Francisco, how about Atami Sushi Bar & Grill?",
            "You can find them at 1662 Lombard Street.",
            "How about Juban Yakiniku House Japanese in San Francisco?",
            "Unfortunately, they do not have vegetarian options nor have outdoor setting.",
            "Sure, please confirm your reservation for 1 at Juban Yakiniku House Japanese in San Francisco at 12:15 pm on March 12th.",
            "Sorry, your reservation could not be made. Could I further assist you?",
            "Sure, please confirm your reservation for 1 at Juban Yakiniku House Japanese in San Francisco at 12:15 pm on March 13th.",
            "Sure, please confirm your reservation for 2 at 12:15 pm.",
            "Sure, please confirm your reservation at Juban Yakiniku House Japanese in San Francisco at 12 pm.",
            "Your reservation has been made.",
            "Will you be travelling to 1581 Webster Street and would you mind a shared ride?",
            "Please confirm your booking for a shared ride for 2 to 1581 Webster Street.",
            "Please confirm your booking for a shared ride for 2 to Egg Roll King.",
            "Your booking has been made and is on its way to you now.",
            "Sure, have a great day ahead!"
        ]
    },
    {
        "dialogue_id": "14_00047",
        "service": "Restaurants_2",
        "service_call": {
            "method": {
                "method": "GetRide",
                "parameters": {
                    "destination": "4288 Dublin Boulevard #110",
                    "number_of_riders": "2",
                    "shared_ride": "True"
                }
            }
        },
        "user_utterance": [
            "Find me a place to eat.I want to be a restaurant tagged intermediate priced for price.",
            "In Dublin will be great.",
            "Something where is serving Sushi.",
            "Ye that sounds great.",
            "Yes help me book a table at a restaurant.",
            "On evening 6:30 will be okay.",
            "Perfect.I also need to know if they serve vegetarian food and the contact phone.",
            "Get for me and my friends a cab to go there.",
            "Yes is okay.",
            "Yes will be great.",
            "Yes that's good.",
            "Tell me the cost please.",
            "Thanks.That's all that I wanted now."
        ],
        "system_utterance": [
            "In which location you want to be?",
            "What type of food you want to eat?",
            "I have 2 option for you that you may like.A nice restaurant called Halu Shabu Shabu licated in Dublin.",
            "With something else I can help?",
            "At what time you want to be?",
            "Book a table for 2 people at Halu Shabu Shabu in Dublin in March 1st at 6:30 pm.",
            "Reservation was made.They don;t have vegetarian food.925-833-9833 is the contact phone number.",
            "4288 Dublin Boulevard #110 is the address?",
            "Would you like a shared ride?",
            "You want a shared ride and a cab for 2 people to go at 4288 Dublin Boulevard #110.Is that correct?",
            "The ride is booked and the cab is on its way.",
            "$25.10 is the total cost.",
            "Have a nice day!"
        ]
    },
    {
        "dialogue_id": "14_00048",
        "service": "Restaurants_2",
        "service_call": {
            "method": {
                "method": "GetRide",
                "parameters": {
                    "destination": "1919 Davis Street",
                    "number_of_riders": "1",
                    "shared_ride": "True"
                }
            }
        },
        "user_utterance": [
            "Find me a place that serves Coffee & light bites.",
            "I want to eat in San Leandro.",
            "That works for me.",
            "Yes, book me a table for three people on the 8th of this month.",
            "I wish to eat at 10:30.",
            "That is right.",
            "Try to get a table on the 1st of March for evening 7.",
            "No, make it for 1 person.",
            "That is right.",
            "Is this a ultra high-end place?",
            "Thanks. I need a ride to get there.",
            "A shared ride is fine and that is where I am headed.",
            "That is right.",
            "What is the total bill?",
            "Thanks a bunch.",
            "No, that is all. Thanks."
        ],
        "system_utterance": [
            "What city do you want to eat in?",
            "Mcdonalds' serves Coffee & light bites in San Leandro.",
            "Shall I book you a table there?",
            "What time do you want to eat?",
            "You want a table for 3 at Mcdonald's in San Leandro for 10:30 am on March 8th, correct?",
            "I can't book you a table. Do you require more help?",
            "You want a table for 3 at 7 pm on March 1st at Mcdonald's in San Leandro?",
            "You want a table for 1 in San Leandro, correct?",
            "Your table is booked.",
            "No, they have cheap prices.",
            "Is a shared ride okay and is your destination 1919 Davis Street?",
            "You want a shared ride for 1 to 1919 Davis Street, correct?",
            "Your cab is ordered and is coming right now.",
            "The total is $15.97.",
            "Do you need more help?",
            "Have a good day."
        ]
    },
    {
        "dialogue_id": "14_00049",
        "service": "Restaurants_2",
        "service_call": {
            "method": {
                "method": "GetRide",
                "parameters": {
                    "destination": "101 Parrott Street",
                    "number_of_riders": "2",
                    "shared_ride": "True"
                }
            }
        },
        "user_utterance": [
            "Hello! Please can you find me some good restaurant to have food?",
            "I'm looking in San Leandro.",
            "Please can you find a moderate priced restaurant that can serve English food.",
            "Yup, sounds good.",
            "Yup, Please can you reserve a table for three people on 2nd of March at 12:45?",
            "Nope, please can you reserve only for two people at eleven in the morning?",
            "Yup, sounds good.",
            "Thanks much. Please can you find me a ride to reach there, for I wish to travel along with my friends?",
            "Yup, you're right.",
            "Yup, I'm looking for a shared one.",
            "Yup, you are correct.",
            "Thanks much for the help.",
            "Nope, thanks much for your help."
        ],
        "system_utterance": [
            "Sure, where are you searching for?",
            "What type of cuisine are you looking for - American, Indian or anything else?",
            "Sure. Do you wish to dine at The Englander Sports Pub & Restaurant, which is a nice one located at San Leandro?",
            "Do you wish to reserve a table at this restaurant?",
            "Okay! Please can you confirm me that you wish to book a table at the hotel The Englander Sports Pub & Restaurant in San Leandro on March 2nd at 12:45 pm for 3 people, right?",
            "Please can you confirm me that you wish to reserve a table for 2 people at 11 am, right?",
            "Okay! your booking is successful",
            "Sure, do you look for a shared ride to reach 101 Parrott Street?",
            "So, you are looking for a shared ride, right?",
            "Please can you confirm me that you wish to book a cab for 2 people to reach 101 Parrott Street with a shared ride, right?",
            "Okay, I've booked the cab for you and its on your way.",
            "Do you want me to assist you with anything else?",
            "Have a wonderful day."
        ]
    },
    {
        "dialogue_id": "14_00050",
        "service": "Restaurants_2",
        "service_call": {
            "method": {
                "method": "GetRide",
                "parameters": {
                    "destination": "351 West Washington Avenue",
                    "number_of_riders": "2",
                    "shared_ride": "True"
                }
            }
        },
        "user_utterance": [
            "my mouth is watering for the outside food. find me a good place to eat?",
            "find some good restaurants in sunnyvale? find halal kind of food ?",
            "ok thats good. please book a table at a restaurant?",
            "the reservation should be at 11:30 in the morning.",
            "ok that works for me.",
            "thanks a lot . find me a good cab to go over there (with my friends)?",
            "sure , i am comfortable with a shared ride.",
            "yes thats great.",
            "ok that suits for me. how much does it cost?",
            "thanks a lot for your immense help. that's all i need ."
        ],
        "system_utterance": [
            "in which location are you searching for and what kind of food are you looking for?",
            "i found 1 restaurants as per your taste. how about kabul afghan cuisine which is a nice restaurant ? It is located in sunnyvale.",
            "at what time should i reserve for ?",
            "please check and confirm the following details. book a table at kabul afghan cuisine. the city is sunnyvale. the reservation is at 11:30 am for 2 people and the date is march 1st.",
            "reservation is successful.",
            "do you need a shared ride?",
            "Whether are you travelling to 351 west washington avenue?",
            "please confirm the following details. cab ride to 351 west washington avenue. the passengers is 2 people. it should be shared ride.",
            "cab ride is booked successfully. its costs $22.68.",
            "enjoy, have a good day"
        ]
    },
    {
        "dialogue_id": "14_00051",
        "service": "Restaurants_2",
        "service_call": {
            "method": {
                "method": "GetRide",
                "parameters": {
                    "destination": "127 North McDowell Boulevard",
                    "number_of_riders": "1",
                    "shared_ride": "True"
                }
            }
        },
        "user_utterance": [
            "I'd like to eat out at a not very costly restaurant in Petaluma. Any suggestions?",
            "Please find me one that offers Szcheuan cuisine.",
            "Where are they located?",
            "Do they offer vegetarian dishes?",
            "That works for me.",
            "Sure. Please reserve a table for 1 this evening 7:30.",
            "That is correct.",
            "Please find me and my friends a cab to go there.",
            "I don't mind sharing a ride.",
            "That is correct. How long will the cab ride last?",
            "What's the cost?",
            "Thank you very much. You've been very helpful.",
            "No. Thank you very much. You've been very helpful."
        ],
        "system_utterance": [
            "What type of cuisine did you have in mind?",
            "How about City Chopsticks, a good Petaluma restaurant?",
            "They are located at 127 North McDowell Boulevard.",
            "They have a wide selection of vegetarian dishes.",
            "Should I go ahead and reserve a table here?",
            "Okay. Please confirm that you'd like to reserve a table for 1 at City Chopsticks in Petaluma, for 7:30 pm on March 1st.",
            "I have successfully made your reservation.",
            "Do you mind sharing a ride?",
            "Please confirm that you'd like 1 shared ride seat in a cab going to 127 North McDowell Boulevard.",
            "I have successfully booked your cab and it should be here shortly. The cab ride is approximately 11 minutes long.",
            "The price is $6.43.",
            "Will you be needing my help with anything else?",
            "Thank you, and do have yourself a wonderful day!"
        ]
    },
    {
        "dialogue_id": "14_00052",
        "service": "Restaurants_2",
        "service_call": {
            "method": {
                "method": "GetRide",
                "parameters": {
                    "destination": "244 Jackson Street",
                    "number_of_riders": "2",
                    "shared_ride": "True"
                }
            }
        },
        "user_utterance": [
            "I'm trying to find a restaurant. I'd like someplace pricey.",
            "In San Francisco please.",
            "I'd love to find a nice steakhouse.",
            "Okay, great. Would you please make a reservation for me?",
            "I'd like it at 11:15 in the morning.",
            "Yes, that's correct.",
            "Sure, that's fine.",
            "Thanks, and the address please.",
            "Do they have any outside tables? I'd also like the phone number.",
            "Thanks for your help.",
            "Yes, I'm going to need a taxi.",
            "That's no problem.",
            "Okay, thank you.",
            "Thank you, I'm all set."
        ],
        "system_utterance": [
            "What location are you thinking of?",
            "And what type of cuisine?",
            "I recommend 5a5 Steak Lounge in San Francisco.",
            "Certainly, when would you like it?",
            "All right, confirming a table on March 1st at 11:15 AM at 5a5 Steak Lounge in San Francisco for 2 people.",
            "I apologize, there was a problem booking that reservation. Would you like to try March 1st at 11 AM for 2 at 5a5 Steak Lounge?",
            "That table has been booked.",
            "Sure, the restaurant is located at 244 Jackson Street.",
            "I'm sorry, they have no outside seating. The telephone number is 415-989-2539.",
            "My pleasure. Anything else?",
            "Would you like a shared ride?",
            "Confirming a shared cab for 2 passengers going to 244 Jackson Street.",
            "The taxi has been ordered and will arrive soon.",
            "You're very welcome."
        ]
    },
    {
        "dialogue_id": "14_00053",
        "service": "Restaurants_2",
        "service_call": {
            "method": {
                "method": "GetRide",
                "parameters": {
                    "destination": "140 North Civic Drive",
                    "number_of_riders": "3",
                    "shared_ride": "True"
                }
            }
        },
        "user_utterance": [
            "Find me somewhere to dine.",
            "Spicy Indian would be great.",
            "Walnut Creek is fine.",
            "What is the pricing like? Where exactly are they?",
            "Perfect, make a reservation there.",
            "The morning 11:30 works.",
            "I need the reservation for 3 people.",
            "You are correct.",
            "You're such a help.",
            "Me and my buddies need a cab there.",
            "A shared ride is fine.",
            "That is correct.",
            "You're such a great help.",
            "Nothing. I'm all set."
        ],
        "system_utterance": [
            "Which food type would you like?",
            "Where are you looking>",
            "Sargam Indian Cuisine in Walnut Creek is 1 good choice for you.",
            "They are a moderate priced restaurant located at 140 North Civic Drive.",
            "What time would you like the reservation at?",
            "I will reserve a table for 2 this March 1st at the Sargam Indian Cuisine in Walnut Creek at 11:30 am if that is correct.",
            "If I am correct the date is March 1st and the number of people is 3.",
            "The table has been reserved for you.",
            "What else do you need?",
            "Will a shared ride work?",
            "Is it correct you're needing a shared ride for 3 to 140 North Civic Drive.",
            "The taxi will be here soon.",
            "What else would you like?",
            "Enjoy the day."
        ]
    },
    {
        "dialogue_id": "14_00054",
        "service": "Restaurants_2",
        "service_call": {
            "method": {
                "method": "GetRide",
                "parameters": {
                    "destination": "Hatcho Japanese Cuisine",
                    "number_of_riders": "4",
                    "shared_ride": "True"
                }
            }
        },
        "user_utterance": [
            "I need to find a place to eat.",
            "Something Persian.",
            "Find something in Morgan Hill.",
            "Sounds good thanks.",
            "Yes please.",
            "Make it for the morning 11:30.",
            "No actually I need a table for 3 next Monday.",
            "Yes that's correct. How expensive is it?",
            "Thanks. I need a cab for the four of us to get there. Shared is okay, we are going to 17500 Depot Street #180.",
            "No I need to go to Hatcho japanese Cuisine instead.",
            "Yes that is correct thanks.",
            "Thanks that is all for now."
        ],
        "system_utterance": [
            "What type of food would you like?",
            "Where should I look?",
            "I found 1 you may like. Odeum in Morgan Hill.",
            "Would you like to make a reservation?",
            "What time would you like your table reserved?",
            "You want a table for 2 at Odeum in Morgan Hill on March 1st at 11:30 am, correct?",
            "You want a table for 3 on March 4th, correct?",
            "Your table has been booked. They are pricey.",
            "You want a shared ride for 4 to 17500 Depot Street #180, correct?",
            "You want a shared ride for 4 to Hatcho Japanese Cuisine, correct?",
            "Your ride is on the way.",
            "Okay enjoy your day."
        ]
    },
    {
        "dialogue_id": "14_00055",
        "service": "Restaurants_2",
        "service_call": {
            "method": {
                "method": "GetRide",
                "parameters": {
                    "destination": "1041 Middlefield Road",
                    "number_of_riders": "2",
                    "shared_ride": "True"
                }
            }
        },
        "user_utterance": [
            "I want pizza",
            "find in redwood city",
            "yes that works",
            "5:30 in the evening",
            "yes that is fine",
            "yes that is fine",
            "I want a cab",
            "yes that worksd",
            "yes that works",
            "thanks a lot"
        ],
        "system_utterance": [
            "what location then?",
            "donato enoteca redwood city 3 places",
            "wanna get a table there?",
            "donato enoteca redwood city 5:30 pm 2 people march 1st",
            "4.3 rating donato enoteca march 1st 5 pm 2 people",
            "it went through",
            "1041 middlefield road shared ride",
            "1041 middlefield road 2 people",
            "it is booked",
            "bye bye then"
        ]
    },
    {
        "dialogue_id": "14_00056",
        "service": "Restaurants_2",
        "service_call": {
            "method": {
                "method": "GetRide",
                "parameters": {
                    "destination": "35192 Newark Boulevard",
                    "number_of_riders": "2",
                    "shared_ride": "True"
                }
            }
        },
        "user_utterance": [
            "Help me find a good place to eat",
            "I want to have coffee & light bites in Newark",
            "What's its rating?",
            "Tell me the address. Do they have vegetarian options?",
            "Cool, book a table for 2 there on march 6th morning 11:30",
            "Cool, is it an expensive place?",
            "Thanks, I also need a cab to get there",
            "Yes, a shared ride will do",
            "Cool, what is the duration?",
            "What's the cost?",
            "Thanks a ton",
            "No, thanks again"
        ],
        "system_utterance": [
            "which city and what king of food are you looking for?",
            "Sure, I have found 1 place for you in Newark. How about Mcdonald's there?",
            "It is 3.2",
            "They don't serve vegetarian and are located on 35192 Newark Boulevard",
            "Booking a table for 2 at Mcdonald's Newark on March 6th at 11:30 am",
            "Booking confirmed. It is a cheap restaurant",
            "Is a shared ride fine?",
            "Booking a shared ride for 2 to 35192 Newark Boulevard",
            "The ride is on its way and will be of 15 minutes.",
            "It is $14.91",
            "Can I help you with anything else?",
            "Have a great time there"
        ]
    },
    {
        "dialogue_id": "14_00057",
        "service": "Restaurants_2",
        "service_call": {
            "method": {
                "method": "GetRide",
                "parameters": {
                    "destination": "2053 Broadway",
                    "number_of_riders": "2",
                    "shared_ride": "True"
                }
            }
        },
        "user_utterance": [
            "I'm looking for a cheap restaurant in Redwood City. I'd like to eat some Middle eastern food",
            "Perfect! I want to book a table here on March 13th",
            "I want to reserve at 11:15",
            "Yes, it is. What's the restaurant's address? Are there outdoor seats?",
            "Yes, please. Try to book a table at 11:00",
            "Yes, It's correct. Thanks",
            "Thanks a lot!",
            "I need a cab to go there",
            "Yes, to go there",
            "Yes, a shared ride It's good",
            "Yes, I confirm",
            "Thanks a lot for helping. That's all."
        ],
        "system_utterance": [
            "In Redwood City there's Rocknwraps And Kabobs",
            "What time do you want to reserve the table?",
            "A table for 2 people at Rocknwraps And Kabobs in Redwood City, on March 13th at 11:15 am. Is it correct?",
            "Isn't possible to reserve the table. Can I do anything else for you?",
            "A table for 2 people at Rocknwraps And Kabobs in Redwood City, on March 13th at 11 am. Is it correct?",
            "Your reservation is confirmed",
            "Do you need anything else?",
            "A cab to reach 2053 Broadway?",
            "Is a shared ride okay?",
            "A cab for 2 people in a shared ride to go to 2053 Broadway. Do you confirm?",
            "Perfect! Your cab is coming!",
            "Have a nice day!"
        ]
    },
    {
        "dialogue_id": "14_00058",
        "service": "Restaurants_2",
        "service_call": {
            "method": {
                "method": "GetRide",
                "parameters": {
                    "destination": "462 Santa Clara Avenue",
                    "number_of_riders": "2",
                    "shared_ride": "True"
                }
            }
        },
        "user_utterance": [
            "Find me a place that serves Veggie.",
            "I want to eat in Oakland.",
            "That works for me.",
            "Yes, book me a table for one person.",
            "I wish to eat at afternoon 12:30.",
            "That is correct. What is their price range?",
            "Thanks. I need a shared ride for two people to get to 462 Santa Clara Avenue.",
            "That is right.",
            "Thanks a bunch. That is everything for now."
        ],
        "system_utterance": [
            "What city do you want to eat in?",
            "Search revealed 4 results. Cafe Romanat serves veggie in Oakland.",
            "Shall I book you a table there?",
            "What tiem do you wish to eat?",
            "You want a table for 1 person at 12:30 pm on March 1st at Cafe Romanat in Oakland, correct?",
            "Your table is booked and they have moderate prices.",
            "You want a shared cab for 2 to 462 Santa Clara Avenue, correct?",
            "Your cab is ordered and is coming for you right now.",
            "Have a good day."
        ]
    },
    {
        "dialogue_id": "14_00059",
        "service": "Restaurants_2",
        "service_call": {
            "method": {
                "method": "GetRide",
                "parameters": {
                    "destination": "1971 San Pablo Avenue",
                    "number_of_riders": "2",
                    "shared_ride": "True"
                }
            }
        },
        "user_utterance": [
            "Can you find me a place to eat?",
            "Search for a restaurant which serves Taiwanese.",
            "Search for the restaurant in Pinole.",
            "Do you have any other restaurants?",
            "Okay, That sounds good to me. Can you help me in booking a table for 2 people on 11th of March?",
            "I would like to reserve the table at 1 pm.",
            "Yes, That is correct. Can you confirm whether the restaurant is ultra high-end?",
            "Thank you for the help!",
            "Can you book a shared ride to 1971 San Pablo Avenue for me and my friends.",
            "Yes, That is correct. Can you tell me total cost of my ride?",
            "That will be all. Thank you!"
        ],
        "system_utterance": [
            "What kind food do you prefer?",
            "Which city should I look for?",
            "There is a nice restaurant called China Delights located in Pinole.",
            "There is a nice restaurant called China House Restaurant located in Pinole.",
            "What time should I put for the reservation?",
            "Please confirm: You want me to reserve a table for 2 people at China House Restaurant located in Pinole at 1 pm on March 11th.",
            "I have successfully booked the table for you And they are moderate restaurant.",
            "Is there anything else I can help you with?",
            "Please confirm: You want me to book a shared ride for 2 people in a cab to 1971 San Pablo Avenue.",
            "I have successfully booked your ride and the total cost for the ride is $19.11.",
            "I am glad I could help. Have a nice day!"
        ]
    },
    {
        "dialogue_id": "14_00060",
        "service": "Restaurants_2",
        "service_call": {
            "method": {
                "method": "GetRide",
                "parameters": {
                    "destination": "4115 El Camino Real",
                    "number_of_riders": "4",
                    "shared_ride": "True"
                }
            }
        },
        "user_utterance": [
            "Looking for a place to eat",
            "search in Palo alto",
            "search for Take-out",
            "ok, please book me a table for four on the 11th of march",
            "Book it at Five in the evening",
            "yes, thats correct",
            "Thanks, get a cab for me and my friends to there",
            "yes, that works",
            "yes thats ok, whats its cost?",
            "thanks a lot, thats all"
        ],
        "system_utterance": [
            "in which location?",
            "what kind of food?",
            "Palo Alto has Pizz'a Chicago",
            "whats the time?",
            "Please confirm: Booking a table for 4 at the Pizz'a Chicago in Palo Alto at 5 pm on March 11th",
            "your booking is done",
            "Is a shared ride ok to 4115 El Camino Real",
            "Please confirm: Booking a shared cab to 4115 El Camino Real for 4 people",
            "your ride is booked, it will cost $23.30",
            "have a good day"
        ]
    },
    {
        "dialogue_id": "14_00061",
        "service": "Restaurants_2",
        "service_call": {
            "method": {
                "method": "GetRide",
                "parameters": {
                    "destination": "5813 Cottle Road",
                    "number_of_riders": "1",
                    "shared_ride": "True"
                }
            }
        },
        "user_utterance": [
            "I need a place to eat",
            "I'd like some Taiwanese food",
            "I'm looking a restaurant in San Jose",
            "Can I get the contact number and the address, please?",
            "Thanks a lot. Are there other restaurants in the area?",
            "This is ok! I want to book a table for 1 people on 11th of this month at evening 6:30",
            "No, I prefer to reserve at 1:30 in the afternoon",
            "Yes, I confirm. China Delight is an ultra high-end restaurant?",
            "Are there outdoor seats? Are vegetarian dishes also served?",
            "Thanks a lot! I need a cab to go to 5813 Cottle Road",
            "Yes, a shared ride is fine, thanks",
            "Yes, It is. How much does the cab cost? How long is the ride?",
            "Thank you very much",
            "No, It's all for today. Thanks"
        ],
        "system_utterance": [
            "What kind of food would you like to eat?",
            "In which city?",
            "There are 10 restaurants in San Jose. What about Chef Li?",
            "Sure! Contact number: 408-377-8310. Address: 2033 Camden Avenue # F3",
            "In San Jose there's China Delight",
            "A table for 1 people at China Delight in San Jose, on March 11th at 6:30 pm. Is it correct?",
            "A table on March 11th at 1:30 pm. Do you confirm?",
            "No, it's a moderate restaurant. Your table is booked!",
            "Unfortunately no outdoor seats. Yes, there are many vegetarian dishes.",
            "Do you prefer a shared ride?",
            "A cab for 1 people in a shared ride to 5813 Cottle Road. Is it correct?",
            "It costs $10.67. The ride should last about 30 minutes. Your cab is coming!",
            "Can I do anything else for you?",
            "Have a good day"
        ]
    },
    {
        "dialogue_id": "14_00062",
        "service": "Restaurants_2",
        "service_call": {
            "method": {
                "method": "GetRide",
                "parameters": {
                    "destination": "175 Sutter Street",
                    "number_of_riders": "2",
                    "shared_ride": "True"
                }
            }
        },
        "user_utterance": [
            "I need to find a place to eat.",
            "Something Parisian in SFO.",
            "What is the adrdress?",
            "Do they offer vegetarian options? What is the number to the restaurant?",
            "Can you recommend another with a moderate price.",
            "Sounds good. Can you book me a table.",
            "Make it evening 4:30.",
            "Yes that is correct.",
            "Can you try again for 5:30 in the evening?",
            "Yes that's correct.",
            "Yes that will work.",
            "I need a cab for us to get there please.",
            "Yes that works.",
            "Yes that is correct. What's the total?",
            "Thank you for you assistance.",
            "No that's all thanks."
        ],
        "system_utterance": [
            "What are you in the mood for and where should I search?",
            "I found 10 you may like. How about Amelie San Francisco in San Francisco?",
            "They are located at 1754 Polk Street.",
            "The do not offer vegetarian options and the number is 415-292-6916.",
            "I found 9 others. How about Aquitaine Wine Bar & Bistro in San Francisco?",
            "What time would you like your reservation?",
            "You want a table for 2 at 4:30 pm on March 1st at the Aquitaine Wine bar & Bistro in San Francisco, correct?",
            "I was unable to book the table. Can I do anything else for you?",
            "You want a table for 2 at 5:30 pm on March 1st at the Aquitaine Wine bar & Bistro in San Francisco, correct?",
            "I was unable to book the table. How about 5 pm on March 1st for 2 at Aquitaine Wine Bar & Bistro?",
            "Your reservation has been made.",
            "Do you want a shared ride to 175 Sutter Street?",
            "You want a shared ride with 2 seats to 175 Sutter Street, correct?",
            "Your ride is on the way. The total is $10.73.",
            "Can I do anything else for you?",
            "Okay, enjoy your meal."
        ]
    },
    {
        "dialogue_id": "14_00063",
        "service": "Restaurants_2",
        "service_call": {
            "method": {
                "method": "GetRide",
                "parameters": {
                    "destination": "1599 Sanchez Street",
                    "number_of_riders": "2",
                    "shared_ride": "True"
                }
            }
        },
        "user_utterance": [
            "Hi, I want to find a Sichuan restaurant please.",
            "In San Fran please.",
            "Okay, I like that.",
            "Can you make a reservation for me for two at 13:00?",
            "Thank you. Do they make vegetarian meals?",
            "What's their price range, by the way?",
            "Okay, thanks. I need a cab, too, for my trip to 1599 Sanchez Street.",
            "That's no problem.",
            "Yes, thanks a lot.",
            "Thank you. I'm all set."
        ],
        "system_utterance": [
            "In what area?",
            "I have 10 places for you. How about Alice's, which is in San Francisco?",
            "Anything else today?",
            "Confirming a table at Alice's for 2 on March 1st at 1 pm in San Francisco.",
            "Yes, they sure do. And the table has been booked.",
            "They are cheap.",
            "A shared ride is okay?",
            "Confirming a cab for 2 to 1599 Sanchez Street.",
            "The cab has been dispatched and it will arrive in a bit.",
            "You're welcome, my pleasure."
        ]
    },
    {
        "dialogue_id": "14_00064",
        "service": "Restaurants_2",
        "service_call": {
            "method": {
                "method": "GetRide",
                "parameters": {
                    "destination": "15099-A Hesperian Boulevard",
                    "number_of_riders": "1",
                    "shared_ride": "True"
                }
            }
        },
        "user_utterance": [
            "I want to find a place to eat in San Leandro that is cheap and has vegetarian options.",
            "I like Latin American food.",
            "Is there outdoor seating there? What's their user rating like?",
            "Okay, I'll go there.",
            "I want to book a table there.",
            "I want it at 7:15 pm.",
            "No, it's just for one person.",
            "That's right.",
            "Yeah, that's good too.",
            "I'll need a cab to get to 15099-A Hesperian Boulevard. Shared ride is fine.",
            "Yeah, that's good. How long does the trip take and how much is it?",
            "Thanks for all the help.",
            "No, thanks again for the help."
        ],
        "system_utterance": [
            "Is there a type of cuisine you prefer?",
            "Taco Bell in San Leandro is nice.",
            "There's no outdoor seating there. They have a 3.2 user rating.",
            "Do you need help with anything else?",
            "What time do you want the table?",
            "I'll book you a table for 2 at Taco Bell in San Leandro for March 1st at 7:15 pm. Is that correct?",
            "I'll book you a table for 1 at Taco Bell, is that right?",
            "I'm sorry but the reservation didn't go through. Do you want to try to book a table at Taco Bell for 1 for March 1st at 7:30 pm?",
            "I've booked the table for you.",
            "I'll get you a shared ride cab for 1 to 15099-A Hesperian Boulevard, is that okay?",
            "I've booked the cab and it's on route. The trip is 15 minutes long and is $16.41.",
            "Can I do anything else for you?",
            "Have a wonderful day."
        ]
    },
    {
        "dialogue_id": "14_00065",
        "service": "Restaurants_2",
        "service_call": {
            "method": {
                "method": "GetRide",
                "parameters": {
                    "destination": "1599 Sanchez Street",
                    "number_of_riders": "2",
                    "shared_ride": "True"
                }
            }
        },
        "user_utterance": [
            "I'm in the mood for some sichuan in san fran, find me something where I can sit and enjoy the food",
            "will I find a vegetarian menu once there?",
            "I like this place, book me a table there on the 5th of this month at 1:30 in the afternoon",
            "yes, I'm really looking forward that day",
            "I have to ask you to insist for that table see if there's one on the 11th at one pm",
            "yes, see if we have better luck this time",
            "I think I'll reach the place by shared ride, the address is 1599 sanchez street",
            "your data are correct. how much will it cost us and how long will it take to get us there?",
            "your help is very infomative",
            "no, I know everything I need at the moment. see you next"
        ],
        "system_utterance": [
            "if you're in san francisco, you can go to alice's",
            "they take good care of vegetarians",
            "confirm me the booking before it's final. you are looking for a table for 2 at alice's in san francisco. the date you'll need that table is march 5th at 1:30 pm",
            "the reservation is not done, ask me any other thing",
            "I'll recap this to see if it is right. You want a table for 2 at alice's in san francisco. you want it on march 11th at 1 pm",
            "you do actually, the table has been reserved",
            "confirm me the data: you are in need of a shared ride for 2 to reach 1599 sanchez street",
            "your shared ride will require 10 minutes of your time to take you there for the price of $20.12",
            "I can inform you on many other things",
            "goodbye sir"
        ]
    },
    {
        "dialogue_id": "14_00066",
        "service": "Restaurants_2",
        "service_call": {
            "method": {
                "method": "GetRide",
                "parameters": {
                    "destination": "300 El Camino Real",
                    "number_of_riders": "2",
                    "shared_ride": "True"
                }
            }
        },
        "user_utterance": [
            "Where can I dine with a vegetarian choices on the menu?",
            "I am looking for Cantonese restaurant in Millbrae.",
            "That sounds perfect.",
            "I would like a restaurant reservation.",
            "Half past 7 in the evening would be great.",
            "Permission granted.",
            "Is the establishment pricey. Do they have a rating?",
            "Nice. Me and my buddies need a cab, even if it is a shared ride, to 300 El Camino Real",
            "That's right. What is the drive time?",
            "What is the total charge?",
            "You're the best. I'm set for now."
        ],
        "system_utterance": [
            "Where am I looking? Do you have a food type preference.",
            "Tai Wu Restaurant in Millbrae is 1 choice you may like.",
            "What else can I do for you?",
            "Is there a time you prefer?",
            "I will reserve a t table for 2 at the Tai Wu Restaurant in Millbrae this March 1st at 7:30 pm with your permission.",
            "The table has been booked.",
            "The restaurant is moderate in pricing with a rating of 3.7.",
            "I will find a shared ride for 2 to 300 El Camino Real if that is right.",
            "The drive is approximately 24 minutes. The cab should be here soon.",
            "The charge is $16.24.",
            "Have fun today."
        ]
    },
    {
        "dialogue_id": "14_00067",
        "service": "Restaurants_2",
        "service_call": {
            "method": {
                "method": "GetRide",
                "parameters": {
                    "destination": "1027 Oliver Road",
                    "number_of_riders": "2",
                    "shared_ride": "True"
                }
            }
        },
        "user_utterance": [
            "it's about time for me to start looking for a restaurant",
            "the area is fairfield and I'm looking for american type of food",
            "I've hard of this one, yes, I want to go",
            "4:30 pm would be wonderful",
            "yes, you may go on with the procedure",
            "I'm still very interested in this reservation so it's fine if you can book it at 12:30 pm",
            "yes, let's hope they have a table for me. can you tell me if vegetarians can find something to meets their taste on the menu?",
            "another thing I would like to know is if I can sit outside and if you can retrieve the address",
            "it's still fine with me. I just need a shared ride now",
            "my request is that one",
            "that's awesome! bye for now"
        ],
        "system_utterance": [
            "if there's a particular type of food you wish to eat, you can tell me. I also need to know where do I have to look for it",
            "in fairfield you can try chuck e. cheese's",
            "tell me the time for your reservation",
            "read and carefully consider what I am about to do. you want a table for 2 at chuck e. cheese's in fairfield on march 1st at 4:30 pm",
            "the reservation was not confirmed. can I help you some other way?",
            "this is what I'm going to try again. you want to book a table for 2 at chuck e. cheese's in fairfield. the date is march 1st and the reservation is 12:30 pm",
            "you're request has been satisfied and vegetarians may enjoy a nice meal there too!",
            "they are at 1027 oliver road and there's no chance for you to sit outside",
            "confirm me your request for a shared ride for 2 people to reach 1027 oliver road",
            "then you'll be on your car in a short time",
            "thank you and have fun"
        ]
    },
    {
        "dialogue_id": "14_00068",
        "service": "Restaurants_2",
        "service_call": {
            "method": {
                "method": "GetRide",
                "parameters": {
                    "destination": "754 The Alameda #10",
                    "number_of_riders": "2",
                    "shared_ride": "True"
                }
            }
        },
        "user_utterance": [
            "Please help me find a place to eat.",
            "In San Jose.",
            "I like Ramen.",
            "That one is good.",
            "Yes, please.",
            "At 11:30 in the morning.",
            "Yes, do they cater vegetarians foods on their menu? What is their address?",
            "Please help me find a cab going there with my friends.",
            "That's okay with me.",
            "Yes, how long does the ride takes?",
            "Thanks for your help."
        ],
        "system_utterance": [
            "Which location do you prefer?",
            "What food do you want?",
            "How about Bluefin in San Jose?",
            "Will I reserve you table there now?",
            "What time do you prefer to go there?",
            "Okay, you want to reserve a table for 2 at Bluefin in San Jose on march 1st at 11:30 am. Please confirm.",
            "No, they don't have vegetarian options and they are located at 754 The Alameda #10. Your reservation is now confirmed!",
            "Do you prefer shared ride?",
            "Okay, you want a shared ride for 2 people going to 754 The Alameda #10. Please confirm.",
            "About 22 minutes and your cab is on its way!",
            "You are welcome."
        ]
    },
    {
        "dialogue_id": "14_00069",
        "service": "Restaurants_2",
        "service_call": {
            "method": {
                "method": "GetRide",
                "parameters": {
                    "destination": "4580 Dublin Boulevard",
                    "number_of_riders": "3",
                    "shared_ride": "True"
                }
            }
        },
        "user_utterance": [
            "I'd like to find a restaurant.",
            "I think I'm in the mood for a Cantonese place.",
            "I'm thinking of Dublin.",
            "Yes, please make a reservation for next Tuesday at twelve PM for a party of 3.",
            "Is there any outside seating and what is the phone number?",
            "Okay, thanks. I'm also going to need a taxi.",
            "No problem, yes.",
            "Yes, it's fine.",
            "Correct, thank you.",
            "Excellent, I appreciate it.",
            "I don't think so."
        ],
        "system_utterance": [
            "What type of restaurant are you looking for?",
            "In what city please?",
            "I have 7 possibilities for you in Dublin. Would you be interested in China Paradise Restaurant?",
            "Confirming a reservation at 12 PM for 3 people on March 5th at China paradise restaurant in Dublin.",
            "They don't have outdoor seating, I'm sorry. The telephone number is 925-556-9988 and the reservation is complete.",
            "Is your destination 4580 Dublin Boulevard and are you OK with a shared ride?",
            "Just confirming that a shared ride is OK?",
            "Confirming 3 passengers for a shared taxi to 4580 Dublin Boulevard.",
            "The taxi has been dispatched.",
            "Will there be anything else?",
            "Thank you very much."
        ]
    },
    {
        "dialogue_id": "14_00070",
        "service": "Restaurants_2",
        "service_call": {
            "method": {
                "method": "GetRide",
                "parameters": {
                    "destination": "16 Mint Plaza",
                    "number_of_riders": "3",
                    "shared_ride": "True"
                }
            }
        },
        "user_utterance": [
            "I'm looking for a place to go eat",
            "I want some Pizza and Pasta!",
            "How about in San Fran?",
            "Yes, that's fine",
            "Sure, please do",
            "Make it for 12 pm",
            "No, make that for three people for next Monday",
            "Yes that's better",
            "Awesome, now I need a cab to go to 16 Mint Plaza with my friends",
            "Yes, it's good",
            "Yes please. How much is that?",
            "Awesome, that's it for now!"
        ],
        "system_utterance": [
            "What kind of food are you craving?",
            "Sure, where should we look?",
            "I found 10 places in San Francisco including 54 Mint Ristorante Italiano",
            "Want me to book you a table?",
            "At what time then?",
            "Confirming a table for 2 on March 1st at 12 pm at 54 Mint Ristorante Italiano in San Francisco",
            "OK, so a table for 3 on March 4th?",
            "OK, it's booked!",
            "Is a shared cab good?",
            "So a shared cab for 3 to 16 Mint Plaza?",
            "It's booked and will be there soon. It'll be $30.43 total",
            "OK, sure thing, take care"
        ]
    },
    {
        "dialogue_id": "14_00071",
        "service": "Restaurants_2",
        "service_call": {
            "method": {
                "method": "GetRide",
                "parameters": {
                    "destination": "Georgetown Waterfront Park",
                    "number_of_riders": "2",
                    "shared_ride": "True"
                }
            }
        },
        "user_utterance": [
            "I am searching for a place to eat which serves Ramen.",
            "Search it in Berkeley.",
            "It is good.",
            "Yes. Please.",
            "I wish to reserve a table at 12:00.",
            "It is good. What is their user rating?",
            "Thank you very much.",
            "I wish to book a cab to go to 1830 Fourth Street. I am happy with the shared ride",
            "No. I wish to go to Georgetown Waterfront Park.",
            "It is good.",
            "what is the cost?",
            "Thank you so much for your help.",
            "No. Thank you so much for your help."
        ],
        "system_utterance": [
            "In which place shall I search?",
            "Iyasare is a great restaurant in Berkeley.",
            "Shall I book the table there?",
            "When shall I reserve it?",
            "Kindly ensure that, On March 1st, booking is done for 2 persons at Iyasare in Berkeley at 12 pm.",
            "Your booking is done. The user rating is 4.5",
            "Do you need any other help?",
            "Kindly ensure that, you wish to go to 1830 Fourth Street. The shared ride has been booked for 2 persons.",
            "Kindly ensure that, you wish to go to Georgetown Waterfront Park in shared ride.",
            "Your ride has been reserved and it is on its way.",
            "The cost is $18.09",
            "Do you need any other help?",
            "Have a fantastic day."
        ]
    },
    {
        "dialogue_id": "14_00072",
        "service": "Restaurants_2",
        "service_call": {
            "method": {
                "method": "GetRide",
                "parameters": {
                    "destination": "1480 First St Napa, Ca 94559",
                    "number_of_riders": "2",
                    "shared_ride": "True"
                }
            }
        },
        "user_utterance": [
            "Hello! Please can you help me to find some good restaurant in Napa?",
            "Please can you find something which would serve Greek?",
            "Is there outdoor seating available?",
            "Is it an economical restaurant?",
            "That sounds good.",
            "Yup, Please can you book a table at this restaurant?",
            "I wish to make the reservation at 8 o\"clock in the night.",
            "Yup, you are correct.",
            "Please can you try booking the table again for I wish to reserve 12 in the afternoon?",
            "Yup, that sounds good.",
            "Thanks much. Please can you find me a cab to reach that place with my friends?",
            "Yup, that would work. I can have a shared ride.",
            "Yup, sounds good.",
            "Thanks much for the help.",
            "Nope, thanks much for the help."
        ],
        "system_utterance": [
            "Sure. What type of cuisine are you looking for?",
            "Sure. What about Tarla Mediterranean Bar + Grill Napa Valley Restaurant located in Napa?",
            "Yup, you have.",
            "Nope, the price is moderate.",
            "So, do you wish to book a table here?",
            "At what time you wish to reserve?",
            "Please can you confirm me that you wish to book a table at Tarla Mediterranean Bar + Grill Napa Valley Restaurant located in Napa for 2 people on March 1st at 8 pm. Is that right?",
            "Sorry, your booking is unsuccessful. Do you want me to assist you with anything else?",
            "Sure. Please can you confirm me that you wish to book a table at Tarla Mediterranean Bar + Grill Napa Valley Restaurant for 2 people on March 1st at 12 pm in Napa, right?",
            "Okay! Your booking is confirmed.",
            "Sure. So, do you wish to have a shared ride to reach 1480 First St Napa, Ca 94559?",
            "Okay! Please can you confirm me that you wish to have a shared ride for 2 people to reach 1480 First St Napa, Ca 94559, right?",
            "Okay your booking is confirmed and the cab in on the way.",
            "Do you want me to assist you with anything else?",
            "Have a wonderful day."
        ]
    },
    {
        "dialogue_id": "14_00073",
        "service": "Restaurants_2",
        "service_call": {
            "method": {
                "method": "GetRide",
                "parameters": {
                    "destination": "1420 Market Street",
                    "number_of_riders": "3",
                    "shared_ride": "True"
                }
            }
        },
        "user_utterance": [
            "I need to find a place to eat.",
            "Something Jamaican would be great.",
            "I need to find something in SFO.",
            "Sounds good thank you.",
            "Yes I need a table for 3 on the 2nd at 19:00.",
            "Yes that is correct.",
            "Do they have vegetarian dinners on the menu? Where are they located?",
            "Thanks, can you get me a shared ride for my friends and I?",
            "YEs that is correct.",
            "Thanks for everything.",
            "No that's it for now."
        ],
        "system_utterance": [
            "What type of cuisine do you want?",
            "Where should I look?",
            "Kaya Restaurant in San Francisco is a nice place.",
            "Would you like a reservation?",
            "You want a table for 3 at Kaya Restaurant in San Francisco at 7 pm on March 2nd, correct?",
            "Your reservation has been made.",
            "They don't offer vegetarian. They are located at 1420 Market Street.",
            "You need a shared ride for 3 to 1420 Market Street, correct?",
            "Your ride is on the way.",
            "Can I do anything else for you?",
            "Okay have a great day!"
        ]
    },
    {
        "dialogue_id": "14_00074",
        "service": "Restaurants_2",
        "service_call": {
            "method": {
                "method": "GetRide",
                "parameters": {
                    "destination": "12108 Saratoga Sunnyvale Road",
                    "number_of_riders": "2",
                    "shared_ride": "True"
                }
            }
        },
        "user_utterance": [
            "Hi, could you help me search for some nice places to eat please.",
            "Something in Saratoga will suffice.",
            "A restaurant which serves some fresh lobster will do.",
            "That is fine with me, could you assist in making a reservation there?",
            "Some time at 19:00.",
            "Sure, I am fine with that.",
            "Thank you! Could you get me a cab ride there too?",
            "Sure, that is fine with me.",
            "Yes, that is fine for me too.",
            "Sure, thank you for your kind assistance.",
            "No, that is all I need."
        ],
        "system_utterance": [
            "Sure, any preferred locations of your restaurant?",
            "Sure, what type of food will you prefer?",
            "How about Sushi Heaven in Saratoga?",
            "When will you be dining in?",
            "Please confirm your reservation for 2 at Sushi Heaven in Saratoga at 7 pm on March 1st.",
            "Your reservation has been made.",
            "Will you be travelilng to 12108 Saratoga Sunnyvale Road and do you mind a shared ride?",
            "Please confirm your booking for a shared ride for 2 to 12108 Saratoga Sunnyvale Road.",
            "Your booking has been made and is on its way!",
            "Do you need further assistance?",
            "Have an enjoyable trip!"
        ]
    },
    {
        "dialogue_id": "14_00075",
        "service": "Restaurants_2",
        "service_call": {
            "method": {
                "method": "GetRide",
                "parameters": {
                    "destination": "500 Precita Avenue",
                    "number_of_riders": "2",
                    "shared_ride": "True"
                }
            }
        },
        "user_utterance": [
            "I want to search for a nice restaurant.",
            "Somewhere that has Asado.",
            "Something in SF.",
            "Where are they located and are they expensive?",
            "that suits fine could you book me a table?",
            "1:15 in the afternoon.",
            "Yes that is perfect. Do you have a contact number for them?",
            "Could you try again but try for 1:30 in the afternoon.",
            "Yes that is correct.",
            "Thanks for that now could you get me a cab there?",
            "Yes that is fine.",
            "Yes that's right, how much will it be and how long will the journey take?",
            "Thanks for your assistance.",
            "No that's all thanks."
        ],
        "system_utterance": [
            "what type of food do you fancy?",
            "Which city do you want?",
            "There is a lovely restaurant called Precita Park Cafe & Grill in San Francisco.",
            "They are considered moderate price range and are located at 500 precita Avenue.",
            "What time works best?",
            "To confirm then that is a table for 2 at 1:15 pm on March 1st, at Precita Park Cafe & Grill in San Francisco.",
            "Unfortunately I was unable to book that for you, can I do anything more for you?",
            "To confirm then that is a table for 2 on March 1st at 1:30 pm at Precita Park Cafe & Grill in San Francisco.",
            "Your booking is now confirmed.",
            "Would you be happy with a shared ride?",
            "To confirm that is shared ride cab for 2 to 500 Precita Avenue.",
            "It is booked and will be with you shortly. In total it will cost $24.45 and will take around 30 minutes.",
            "Anything else you require?",
            "Have a lovely day."
        ]
    },
    {
        "dialogue_id": "14_00076",
        "service": "Restaurants_2",
        "service_call": {
            "method": {
                "method": "GetRide",
                "parameters": {
                    "destination": "39145 Farwell Drive",
                    "number_of_riders": "1",
                    "shared_ride": "True"
                }
            }
        },
        "user_utterance": [
            "I am interested in finding a place where I can eat, and the place I am looking for should be considered as moderate regarding the price.",
            "I am interested in restaurants in Fremont, and that serve Quick meal.",
            "Yes, that is nice.",
            "Yes, I want to book a table for four people on Wednesday next week at 12:15.",
            "That is not right, because I want to have the table booked for March 11th.",
            "That is not right, because my frieds cancelled so I need to have the table for one person at half past 11 in the morning.",
            "Yes, that suits me well.",
            "Yes that works for me too.",
            "I appreciate it very much! Now I need to find a cab I can have to go there with my friends.",
            "I do not mind have a shared ride.",
            "Yes, that is where I want to go.",
            "Yes, that is correct.",
            "I am thankful for the help you provided to me. That would be all for now."
        ],
        "system_utterance": [
            "Is there some particular kind of food you are interested in? In which location should I look for the restaurant?",
            "A good restaurant in Fremont I can recommend is Olive Garden Italian Restaurant.",
            "Do you want to book a table at this restaurant?",
            "Can you please confirm that you want to book a table for 4 people at Olive Garden Italian Restaurant in Fremont on March 6th at 12:15 pm?",
            "Can you please confirm that you want to book a table at Olive Garden Italian Restaurant for March 11th?",
            "Can you please confirm that you want to book a table for 1 person at 11:30 am?",
            "I apologize but I could not make the reservation you asked for. Do you want me to try again book a table for 1 person at Olive Garden Italian Restaurant on March 11th at 11 am?",
            "Your requested reservation has been made.",
            "Are you willing to have a shared ride?",
            "Is your destination 39145 Farwell Drive?",
            "Can you please confirm that you want to have a shared ride cab for 1 person to go to 39145 Farwell Drive.",
            "Your requested cab has been booked, and is already on the way.",
            "Have a wonderful time!"
        ]
    },
    {
        "dialogue_id": "14_00077",
        "service": "Restaurants_2",
        "service_call": {
            "method": {
                "method": "GetRide",
                "parameters": {
                    "destination": "71 North San Pedro Street",
                    "number_of_riders": "2",
                    "shared_ride": "True"
                }
            }
        },
        "user_utterance": [
            "I'm looking for a place to eat at any price range",
            "I'd love to visit a Diner in San Jose",
            "What's their rating, and do they have vegetarian options?",
            "Yes, that sounds awesome",
            "Yes please, for two on March 9th at 5:30 pm",
            "Yes that works",
            "Great, no I need to take a cab with my friends to 71 North San Pedro Street",
            "Yes, that's ok",
            "Yes please. How much is that, and how long is that ride?",
            "Thanks for your help!",
            "No, for now we're all good"
        ],
        "system_utterance": [
            "What kind of food, and where?",
            "I found 10 places including 71 Saint Peter in San Jose",
            "They have a pretty solid 4.0 rating and yes, they do have vegetarian options",
            "Would you like to reserve a table?",
            "Confirming a table for 2 at 5:30 pm on March 9th at 71 Saint Peter in San Jose",
            "Your reservation is booked",
            "Is a shared ride fine?",
            "Confirming you want a shared ride for 2 to 71 North San Pedro Street",
            "It's booked an on the way! It'll be about an 8 minute ride and cost you $12.32",
            "Can I do something else?",
            "Alright, have a good one!"
        ]
    },
    {
        "dialogue_id": "14_00078",
        "service": "Restaurants_2",
        "service_call": {
            "method": {
                "method": "GetRide",
                "parameters": {
                    "destination": "298 Gough Street",
                    "number_of_riders": "3",
                    "shared_ride": "True"
                }
            }
        },
        "user_utterance": [
            "Find me a place where vegetarians can eat.",
            "Find places in San Jose.",
            "I want an economical priced place serving Asian in San Francisco.",
            "Can you eat outdoors there?",
            "That works for me. Book me a table for 6 o\"clock in the evening.",
            "No, I want to eat there on the 12th of this month.",
            "That is right.",
            "How can I contact them and can you tell me their rating?",
            "Thanks a bunch. I need a ride to get there.",
            "A shared ride is fine with me.",
            "Yes it is and I need a ride for 3 people.",
            "That is right. What is the ride duration and total cost?",
            "Thanks a bunch.",
            "No, not right now. Thanks."
        ],
        "system_utterance": [
            "What city do you want to eat in?",
            "What type of food do you like?",
            "Search revealed 10 places. Bai Thong Thai is in San Francisco.",
            "No, you can't eat outdoors there.",
            "You want a table for 2 at Bai Thong Thai in San Francisco for 6 pm on March 1st?",
            "I should book at table at Bai Thong Thai on March 12th?",
            "Your table is booked.",
            "You can contact them at 415-863-9335 and they have a 3.7 rating.",
            "Is a shared ride fine with you?",
            "Is your destination 298 Gough Street?",
            "You want a shared cab for 3 people to 298 Gough Street, correct?",
            "Your ride is ordered and is coming for you. The ride duration is 14 minutes and the total cost is $14.13.",
            "Do you need more help?",
            "Have a good day."
        ]
    },
    {
        "dialogue_id": "14_00079",
        "service": "Restaurants_2",
        "service_call": {
            "method": {
                "method": "GetRide",
                "parameters": {
                    "destination": "383 1st Street",
                    "number_of_riders": "2",
                    "shared_ride": "True"
                }
            }
        },
        "user_utterance": [
            "Please help me to find restaurant in Gilroy.",
            "I want European.",
            "That's good.",
            "Yes at 11:15.",
            "Yes that's good.",
            "Can you help me to book a table again and make the reservation at 6 pm.",
            "That's good.",
            "Is this a cheap restaurant.",
            "May I know the address?",
            "Please help me to find cab to go there with my friends.",
            "Yes its okay for me.",
            "That's good.",
            "How long is the ride and how much does it cost?",
            "Thank you.",
            "No thanks."
        ],
        "system_utterance": [
            "What find of food do you prefer?",
            "I found 1 restaurant and that is Tasso's Old House Restaurant and it is located in Gilroy.",
            "Will I reserve you a table now?",
            "Okay, You want to reserve a table for 2 at Tasso's Old House Restaurant in Gilroy on March 1st at 11:15 am. Please confirm.",
            "Apologies I fail to make a reservation. Anything else can I help you with?",
            "Okay, You want to reserve a table for 2 at Tasso's Old House Restaurant in Gilroy on March 1st at 6 pm. Please confirm.",
            "Your reservation is successfully booked.",
            "No, but they are moderate restaurant.",
            "Their address is 383 1st Street.",
            "Do you prefer shared ride?",
            "Okay, you want book a shared ride for 2 people going to 383 1st Street. Please confirm.",
            "Your cab is on its way.",
            "Its only $19.22 and the ride will last about 22 minutes.",
            "Anything else can I help you with?",
            "Enjoy your day!"
        ]
    },
    {
        "dialogue_id": "14_00080",
        "service": "Restaurants_2",
        "service_call": {
            "method": {
                "method": "GetRide",
                "parameters": {
                    "destination": "39145 Farwell Drive",
                    "number_of_riders": "2",
                    "shared_ride": "True"
                }
            }
        },
        "user_utterance": [
            "I'm searching for a restaurant.",
            "I'd like someplace that's reasonably priced that also has a vegetarian dishes where I can pick-up my food.",
            "How about in Fremont?",
            "All right, that's fine.",
            "Yes, I'd like one.",
            "I'd like it at 12:30 in the afternoon.",
            "That all sounds great.",
            "Could you tell me the phone number and the address?",
            "Thanks. I'd also like to hail a cab, a shared ride is no problem.",
            "Thank you very much.",
            "Thanks for your help."
        ],
        "system_utterance": [
            "What kind of place?",
            "In what city?",
            "I'd like to suggest Olive Garden Italian Restaurant in Fremont.",
            "Should I make a reservation?",
            "When would you like it?",
            "Confirming a 12:30 PM reservation in Fremont for 2 people on March 1st at Olive Garden Italian Restaurant.",
            "That table has been booked.",
            "Yes, the contract number is 510-796-5102 and the address is 39145 Farwell Drive.",
            "Confirming arktaxi for 2 passengers, a shared ride, to 39145 Farwell Drive.",
            "The taxi has been dispatched.",
            "It is my pleasure."
        ]
    },
    {
        "dialogue_id": "14_00081",
        "service": "Restaurants_2",
        "service_call": {
            "method": {
                "method": "GetRide",
                "parameters": {
                    "destination": "13670 Arnold Drive",
                    "number_of_riders": "2",
                    "shared_ride": "True"
                }
            }
        },
        "user_utterance": [
            "Find me an economical priced place that Serves southern food in Glen Ellen.",
            "What is their location and contact number?",
            "That is great. Book me a table for 2 at 5 o\"clock in the evening on the 5th of March.",
            "That is right. Can vegetarians eat there and what is their rating?",
            "Find me a taxi to get there.",
            "Yes, a shared ride is just fine.",
            "That is right. What is the total bill?",
            "Thanks a bunch.",
            "No, that is all. Thanks."
        ],
        "system_utterance": [
            "Search revealed 1 result which is Glen Ellen Inn in Glen Ellen.",
            "You can find them at 13670 Arnold Drive and you can get in touch with them at 707-996-1174.",
            "You want a table for 2 at 5 pm on March 5th at the Glen Ellen Inn in Glen Ellen, correct?",
            "Your table is booked. They do have any food for vegetarians and they are rated 4.5 stars.",
            "Is a shared ride okay with you?",
            "You want a shared ride for 2 people to get to 13670 Arnold Drive, correct?",
            "Your ride is ordered and is coming for you right now. The total bill is $21.28.",
            "Do you need something more?",
            "Have a good day."
        ]
    },
    {
        "dialogue_id": "14_00082",
        "service": "Restaurants_2",
        "service_call": {
            "method": {
                "method": "GetRide",
                "parameters": {
                    "destination": "629 Union Street",
                    "number_of_riders": "2",
                    "shared_ride": "True"
                }
            }
        },
        "user_utterance": [
            "Hey! Please can you find me some hotels to have food?",
            "Please can you search for restaurants serving Asian Fusion in Mountain View?",
            "Do you have any other recommendations, for I'm looking for a economical priced restaurant.",
            "Yup, I'm looking for this kind of restaurant only. Please can you book a table here?",
            "Please can you make it at twelve in the afternoon?",
            "Yup, that sounds good. Is it a vegetarian or non-veg hotel?",
            "Please can you help me to find a cab to reach there with my friends?",
            "Yup, its good to have a shared ride.",
            "Nope, I wish to go to 629 Union Street.",
            "Yup sounds good.",
            "Thanks much for the help.",
            "Nope, thanks much for the help."
        ],
        "system_utterance": [
            "Where are you searching for? What type of cuisine do you wish to have?",
            "Yup, I've 4 restaurants for you in Mountain View. Do you wish to dine at Hangen Szechuan?",
            "Okay! there are 2 restaurants for you. Do you wish to dien at Kirin located in Mountain View.",
            "At what time?",
            "Please can you confirm me that you wish to reserve a table for 2 people on March 1st at 12 pm at Kirin in Mountain View, right?",
            "It's a pure vegetarian restaurant and your booking is successful.",
            "Sure. Do you prefer a shared ride to reach 485 Castro Street?",
            "Please can you confirm me that you wish to have a shared ride for 2 people to reach 485 Castro Street, right?",
            "Okay, Please can you confirm me that you wish to book a cab for 2 people to reach 629 Union Street, right?",
            "Okay your cab is confirmed and its on the way.",
            "Okay, do you want me to help you with anything else?",
            "Have a wonderful day."
        ]
    },
    {
        "dialogue_id": "14_00083",
        "service": "Restaurants_2",
        "service_call": {
            "method": {
                "method": "GetRide",
                "parameters": {
                    "destination": "2317 South El Camino Real",
                    "number_of_riders": "2",
                    "shared_ride": "True"
                }
            }
        },
        "user_utterance": [
            "Help me find a place to eat.",
            "I want a place that serves lobster.",
            "I want a place in San Mateo.",
            "That sounds like it'll hit the spot.",
            "Yeah, book a table for two for the 9th of March at 1:15 pm.",
            "Yeah, you got it.",
            "Yeah, try that.",
            "My friend and I also need a cab to get to 2317 South El Camino Real. A shared ride is fine.",
            "Yes, please get it.",
            "How long will the trip be and what's the cost?",
            "Thanks for the help, I'll be going now."
        ],
        "system_utterance": [
            "Is there a kind of food you prefer?",
            "What area would you like to search in?",
            "Andes Cafe San Mateo in San Mateo is nice.",
            "Do you want me to book a table?",
            "I'll book a table for 2 at Andes Cafe San Mateo in San Mateo for March 9th at 1:15 pm, is everything correct?",
            "I'm sorry but the reservation didn't go through. Would you like to try a table for 2 at Andes Cafe San Mateo on March 9th at 1 pm?",
            "I've booked the table for you.",
            "I'll get you a shared ride cab for 2 to 2317 South El Camino Real, correct?",
            "I've booked the cab and it's on route.",
            "It is $14.95 and the trip is around 16 minutes.",
            "Have a fun day!"
        ]
    },
    {
        "dialogue_id": "14_00084",
        "service": "Restaurants_2",
        "service_call": {
            "method": {
                "method": "GetRide",
                "parameters": {
                    "destination": "601 Van Ness Avenue",
                    "number_of_riders": "4",
                    "shared_ride": "True"
                }
            }
        },
        "user_utterance": [
            "I need to find a restaurant in SFO.",
            "I am in the mood for japanese cuisine but at a restaurant that is not very costly.",
            "Great. I would like to book at table for 3 at eleven in the morning.",
            "Yes, that would be great. May I have an address?",
            "What is the user rating for there and may I have a contact number",
            "Thanks a lot.",
            "I want to go there with some friends, so I would need a shared ride.",
            "I want it for 4 persons.",
            "That's correct. How long would it take me to get there and how much does the cab cost?",
            "Thanks. That would be all."
        ],
        "system_utterance": [
            "What sort of food would you like to eat.",
            "I have found 10 suitable choices in San Francisco. There is a lovely restaurant called 2g japanese brasserie.",
            "You would like a table for 3 at 2g japanese brasserie in san francisco for March 1st at 11 am?",
            "I have made the reservation. The address is 601 van ness avenue.",
            "The rating is 3.5 and the numbe is 415-292-9997.",
            "Would you need anything else?",
            "You would like a shared ride for 3 heading to 601 van ness avenue?",
            "You would like a cab for 4 to go to 601 van ness avenue?",
            "Your cab will arrive shortly. The trip is 15 minutes and the price is $25.44.",
            "Enjoy your day."
        ]
    },
    {
        "dialogue_id": "14_00085",
        "service": "Restaurants_2",
        "service_call": {
            "method": {
                "method": "GetRide",
                "parameters": {
                    "destination": "2135 Franklin Street",
                    "number_of_riders": "2",
                    "shared_ride": "True"
                }
            }
        },
        "user_utterance": [
            "I want to eat out side once and I need your help to find some nice places in Oakland. Can you find the best one which should supply Burrito type food.",
            "This is good to me I think. I want to book a table in that restaurant. Can you help me to do so?",
            "Book it at 13:45.",
            "That is correct to proceed. Also check whether they have outdoor seating there?",
            "That's Okay, try for the new time.",
            "Thanks for the same.",
            "Yes, I need only one help finally which is to book a Cab for me to go to 2135 Franklin Street. I can adjust with shared ride.",
            "That is confirmed and let me know about the time will be taken for that ride.",
            "That's okay. Thanks for your help.",
            "No. Thanks. that's all."
        ],
        "system_utterance": [
            "How about the one like Agave Uptown restaurant in Oakland which is the best I think among the 8 results that I found.",
            "Which time will be perfect to you to book the table?",
            "Please confirm to book a table for 2 at Agave Uptown in Oakland on March 1st for the time 1:45 pm.",
            "Unfortunately I could not book the table for 2 at Agave Uptown at that particular time. Shall I try it for some other time on the same day March 1st like the time 1:30 pm? and also for your information please not that they do not have outdoor seating.",
            "That is confirmed and booked successfully.",
            "Anything else you need?",
            "Please confirm to book a cab with shared ride for 2 persons to 2135 Franklin Street.",
            "I have booked your cab and the same will reach you at any time and your ride will last about 14 minutes.",
            "Do you want to do any more help?",
            "Have a good day."
        ]
    },
    {
        "dialogue_id": "14_00086",
        "service": "Restaurants_2",
        "service_call": {
            "method": {
                "method": "GetRide",
                "parameters": {
                    "destination": "2121 San Pablo Avenue",
                    "number_of_riders": "2",
                    "shared_ride": "True"
                }
            }
        },
        "user_utterance": [
            "I am interested in finding a restaurant.",
            "In Berkeley please.",
            "Somewhere serving Pick-up.",
            "Where are they located?",
            "yes I like the sound of there.",
            "please, could you make it for half past 7 in the evening.",
            "that suits me fine, do they have vegetarian options.",
            "Do they have tables outside and what is their contact number?",
            "thanks for that now to get a cab there?",
            "yes that would do fine.",
            "that's great, how much will it be and how long will the journey take?",
            "Thanks for that.",
            "No that's all thanks."
        ],
        "system_utterance": [
            "in which city?",
            "What type of food do you like?",
            "There is 1 restaurant called Gaumenkitzel in Berkeley.",
            "at 2121 San Pablo Avenue.",
            "Will I book a table for you?",
            "To confirm then that is a table for 2 at 7:30 pm on March 1st at Gaumenkitzel in Berkeley.",
            "Your booking is confirmed and yes they have lovely vegetarian options.",
            "There is no ouside tables and their contact number is 510-647-5016.",
            "What do you think of a shared ride?",
            "To confirm then that is a taxi cab for 2 to 2121 San Pablo Avenue.",
            "your taxi cab is booked and will be there soon. It will be $16.93 and the journey should take 29 minutes.",
            "Can I assist you with anything else?",
            "Have a lovely day."
        ]
    },
    {
        "dialogue_id": "14_00087",
        "service": "Restaurants_2",
        "service_call": {
            "method": {
                "method": "GetRide",
                "parameters": {
                    "destination": "1367 North McDowell Boulevard #110",
                    "number_of_riders": "4",
                    "shared_ride": "True"
                }
            }
        },
        "user_utterance": [
            "Can you find me a restaurant that serves Asian Fusion that has moderate prices?",
            "Find me the ones in Petaluma.",
            "Is outdoor seating available and do they serve vegetarian dishes?",
            "Okay. That sounds good.",
            "Yes, please get me a table for 1 at five pm on the 3rd of March.",
            "Hold on. Make it a table for 4 on next Thursday.",
            "Right. Can you get me their phone number please?",
            "Thanks a bunch! Veg you get a cab for me and my friends to go there?",
            "Yes, that should be fine. I need to go to 1367 North McDowell Boulevard #110.",
            "Yes, that is correct.",
            "How much will it cost and how long will it take to get there?",
            "Thanks again! That's all I need for now."
        ],
        "system_utterance": [
            "In which city should I find the restaurants?",
            "Of the 2 restaurants that I found, Flowering Tea House in Petaluma is a nice restaurant.",
            "They do have good options for vegetarians, but they do not have outdoor seating.",
            "Should I reserve a table for you there?",
            "Please confirm that you want a table for 1 at the Flowering Tea House restaurant in Petaluma at 5 pm on March 3rd.",
            "Okay. So you want a table for 4 on March 7th. Is that correct?",
            "Your table has been reserved successfully. Their phone number is 707-775-3088.",
            "Is a shared ride okay?",
            "Please confirm that you want a shared cab for 4 to go to 1367 North McDowell Boulevard #110.",
            "Your cab has been booked and it is on its way.",
            "It will cost $15.52 and the to will take 31 minutes.",
            "Have a great day!"
        ]
    },
    {
        "dialogue_id": "14_00088",
        "service": "Restaurants_2",
        "service_call": {
            "method": {
                "method": "GetRide",
                "parameters": {
                    "destination": "8000 El Cerrito Plaza",
                    "number_of_riders": "1",
                    "shared_ride": "True"
                }
            }
        },
        "user_utterance": [
            "I'm going out with some friends for dinner and I want to find a good restaurant.",
            "Let's search in El Cerrito for a place with pizza and pasta.",
            "Yes, that'll work just fine. I'd like to reserve a table there for 3 people on the 6th of March at 11:30.",
            "My friends just cancelled. So on second thought, let's get a table for 1 on March 14th.",
            "Yes, that's great. Can you tell me what this restaurant is rated and if they have vegetarian options?",
            "I'd like to get a cab ride there with my friends. I need to get to 8000 El Cerrito Plaza.",
            "Sure, I'm fine with a shared ride.",
            "Yep, sounds good. How much is the ride and how long will it take to get there?",
            "Thanks for your help.",
            "No, that's it for now, thanks."
        ],
        "system_utterance": [
            "What kind of cuisine are you interested in and what area should I search in?",
            "I found 1 restaurant you might like. Romano's Macaroni Grill is a good restaurant located in El Cerrito.",
            "Okay, let's confirm: You are booking a table for 3 at Romano's Macaroni Grill in El Cerrito on March 6th at 11:30 am.",
            "Okay, let's confirm: You are booking a table for 1 on March 14th.",
            "Your table has been reserved. They have good vegetarian options and the restaurant received a user rating of 3.9.",
            "Is a shared ride okay?",
            "Let's confirm the details: You are booking a shared cab for 1 to 8000 El Cerrito Plaza.",
            "Your cab has been booked and is on the way. The ride takes about 12 minutes and costs $14.36.",
            "Anything else I can help you with?",
            "Have a great day!"
        ]
    },
    {
        "dialogue_id": "14_00089",
        "service": "Restaurants_2",
        "service_call": {
            "method": {
                "method": "GetRide",
                "parameters": {
                    "destination": "3120 16th Street",
                    "number_of_riders": "1",
                    "shared_ride": "True"
                }
            }
        },
        "user_utterance": [
            "I refuse to cook, find me a restaurant",
            "the city is sf and the food I want to eat is tapas",
            "I'm not really happy with the one you suggested me, I was thinking to seat outside and pay a moderate price for my food",
            "can you tell me where is this place? may them take good care of vegetarians?",
            "I'm still interested in booking a table for one person at 6:45 pm",
            "it is partially correct, the time for the reservation must be 12:30",
            "better now",
            "perfect, now I need rating and phone number",
            "let's find transportation now, a shared ride is fine",
            "yes, I want that and I also need to know the price for it and",
            "thanks a lot for the useful information",
            "no, that's all for now"
        ],
        "system_utterance": [
            "nice idea, give me a city and a type of food and I'll do the rest",
            "there are 8 places in san francisco where you can satisfy your cravings, one is aatxe",
            "there is a good 1 in san francisco and it's picaro",
            "No, vegetarians won't find anythings for them. the restaurant's location is 3120 16th street",
            "confirm me the specifics of your plan. you want to eat a picaro in san francisco on march 1st at 6:45 pm so you need a table for 1 person",
            "I've fixed the time, please check. you want a reservation for 1 people at 12:30 pm",
            "you got your table for 1",
            "rating is 4.4 and the number to call if needed is 415-431-4089",
            "tell me if this is what you asked me. you want a shared ride for 1 people to go to 3120 16th street",
            "you have your transportation to get there, it will take 21 minutes circa. the price for it is $16.72",
            "may I assist you furthermore?",
            "thank you and goodbye"
        ]
    },
    {
        "dialogue_id": "14_00090",
        "service": "Restaurants_2",
        "service_call": {
            "method": {
                "method": "GetRide",
                "parameters": {
                    "destination": "1501 Tara Hills Drive",
                    "number_of_riders": "1",
                    "shared_ride": "True"
                }
            }
        },
        "user_utterance": [
            "Hi, could you help me search for places to eat please?",
            "Something in Pinole will be great!",
            "Could you find one which serves up some steaming hot dumplings?",
            "That is fine with me!",
            "Could you do so for 1 on the 6th of this month at 6:30 in the evening please?",
            "That is fine with me.",
            "Do you know if they have outdoor seating?",
            "How can I contact them?",
            "Could you get me a shared ride to 1501 Tara Hills Drive too?",
            "Yes, I am fine with that. How much will this cost me?",
            "I see, that is all I need!"
        ],
        "system_utterance": [
            "Where will you prefer to dine at?",
            "Any preferred type of food?",
            "Sure, there are 3 restaurants in Pinole, how about China Delights?",
            "Would you like me to make a reservation for you?",
            "Sure, please confirm your reservation for 1 at China Delights in Pinole at 6:30 pm on March 6th.",
            "Your reservation has been made.",
            "No, they do not.",
            "You can try calling them at 510-964-1882.",
            "Sure, please confirm your shared ride for 1 to 1501 Tara Hills Drive.",
            "Your booking has been made and is on its way to you now. This will set you back $12.65.",
            "Sure, have a great day ahead!"
        ]
    },
    {
        "dialogue_id": "14_00091",
        "service": "Restaurants_2",
        "service_call": {
            "method": {
                "method": "GetRide",
                "parameters": {
                    "destination": "4058 18th Street A",
                    "number_of_riders": "1",
                    "shared_ride": "True"
                }
            }
        },
        "user_utterance": [
            "I need to find a place to eat.",
            "Find something is San Francisco please.",
            "A light meal please.",
            "What else can you find?",
            "Can you recommend anything else?",
            "Yes that is perfect.",
            "Yes please do.",
            "Make it in the evening 6.",
            "Yes that sounds good.",
            "What is the restaurant's rating?",
            "Thanks, I also need a cab to get to 4058 18th Street A. Shared is fine, one seat.",
            "Yes that's correct. How much is it? How long does it take to get there?",
            "Thanks for everything.",
            "Not right now thank you."
        ],
        "system_utterance": [
            "Where should I look?",
            "What kind of food would you like?",
            "I found 8 you might like. How about Aatxe in San Francisco?",
            "Barvale is a nice restaurant in San Francisco.",
            "Beso Bistronomia is a nice place in San Francisco.",
            "Would you like to make a reservation?",
            "What time would you like your table reserved?",
            "You want a table for 2 at Beso Bistronomia in San Francisco on march 1st at 6 pm, correct?",
            "Your reservation has been made.",
            "They are rated about 4.3.",
            "You want a shared ride with 1 seat to 4058 18th Street A, correct?",
            "Your ride is on the way. It takes about 31 minutes to get there and costs $14.96.",
            "Can I do anything else?",
            "Okay have a nice day."
        ]
    },
    {
        "dialogue_id": "14_00092",
        "service": "Restaurants_2",
        "service_call": {
            "method": {
                "method": "GetRide",
                "parameters": {
                    "destination": "2362 Market Street",
                    "number_of_riders": "2",
                    "shared_ride": "True"
                }
            }
        },
        "user_utterance": [
            "Find me a restaurant tagged as intermediate priced.I love outdoor seating.",
            "I would like to be in San Fran and Southern food to be served.",
            "Tell me the user rating please.",
            "You can suggest me other?",
            "That sounds very good.",
            "Yes make a reservation for two people on March 7th at 13:00.",
            "Sounds great.Tell me the phone number.",
            "They have food for vegetarians?Tell me please the address.",
            "Thank you very much.",
            "Get for me and my friends a cab to go there.",
            "Yes a shared ride will be great.",
            "Yes that's good.",
            "Tell me please the cost.",
            "How long will be the ride?",
            "Thank you for all.",
            "No.Is okay.Thanks."
        ],
        "system_utterance": [
            "What kind of food you want and in which location you want to be?",
            "10 option I have for you.A nice restaurant called B located in San Francisco.",
            "Around 4.1 is the user rating at this restaurant.",
            "A nice restaurant is Catch located in San Francisco.",
            "You want a table there?",
            "Book a table for 2 people at Catch in San Francisco on March 7th at 1 pm.",
            "Reservation was made.415-431-5000 is the phone number.",
            "Yes they have very good options for vegetarians.2362 Market Street is the address.",
            "With something else I can help you?",
            "You want a shared ride?",
            "You want a shared ride and a cab for 2 people to go at 2362 Market Street.",
            "The ride was booked and the cab is on its way.",
            "$13.11 is the cost.",
            "Will last about 14 minutes.",
            "I can help with something else?",
            "Have a good day!"
        ]
    },
    {
        "dialogue_id": "14_00093",
        "service": "Restaurants_2",
        "service_call": {
            "method": {
                "method": "GetRide",
                "parameters": {
                    "destination": "6935 Camino Arroyo",
                    "number_of_riders": "2",
                    "shared_ride": "True"
                }
            }
        },
        "user_utterance": [
            "i wish to eat outside rather than from home. find a good place to eat?",
            "find restaurants in gilroy?",
            "find something like light meal?",
            "ok thats fine. book a table at a restaurant? the table is for two people. looking for a table on 5th of march and the time of reservation should be six in the evening.",
            "ok that suits for me.",
            "ok thats good. find a cab to go there with my friends? i need to go to 6935 camino arroyo. i prefer a shared ride.",
            "ok that works for me.",
            "how much does the cab ride cost?",
            "how long is the cab ride?",
            "thanks a lot for your kind help",
            "no, thanks for now"
        ],
        "system_utterance": [
            "in which location should i search for?",
            "what kind of food are you searching for?",
            "what about mimi's cafe which is a nice restaurant? it is located in gilroy.",
            "please check and confirm the following details. book a table at mimi's cafe in the city gilroy. the reservation timings is at 6 pm for 2 people and the date is march 5th.",
            "reservation is successful.",
            "please check and confirm the following details. Cab ride to 6935 camino arroyo and the cab is for 2 people and it should be a shared ride.",
            "cab ride is booked successfully. the cab is on its way.",
            "it costs around $17.48.",
            "the ride will last for about 19 minutes.",
            "whether i need to find anything else?",
            "enjoy, have a good day."
        ]
    },
    {
        "dialogue_id": "14_00094",
        "service": "Restaurants_2",
        "service_call": {
            "method": {
                "method": "GetRide",
                "parameters": {
                    "destination": "14583 Big Basin Way # 2A",
                    "number_of_riders": "2",
                    "shared_ride": "True"
                }
            }
        },
        "user_utterance": [
            "Find me a place to eat",
            "Look for serving Diner around Saratoga",
            "That's good one",
            "Yes sure. Reserve it on Thursday next week",
            "Time is 11:30",
            "Make the table for 2 people",
            "That's perfect",
            "Find a shared ride cab to go there",
            "That's the address",
            "That's good",
            "Thank you so much. Bye"
        ],
        "system_utterance": [
            "Which type of food do you prefer? Do you prefer any place?",
            "There is 1 restaurant that is Sent Sovi Restaurant in Saratoga",
            "Do you want to reserve?",
            "Please mention the time",
            "Please confirm this: Booking a table at Sent Sovi Restaurant at Saratoga at 11:30 am for 2 people on March 7th",
            "Please confirm this: The reservation time is 11:30 am for 2 people",
            "Reservation successful",
            "Is the address is 14583 Big Basin Way # 2A",
            "Please confirm this: You want to go to 14583 Big Basin Way # 2A in a cab for 2 people. You want a shared ride",
            "Cab booked and is on its way",
            "Have a nice day"
        ]
    },
    {
        "dialogue_id": "14_00095",
        "service": "Restaurants_2",
        "service_call": {
            "method": {
                "method": "GetRide",
                "parameters": {
                    "destination": "16 Mint Plaza",
                    "number_of_riders": "2",
                    "shared_ride": "True"
                }
            }
        },
        "user_utterance": [
            "I'd like a outdoor seating restaurant that serves pasta in san fran",
            "Hmmm what are they rated and are there vegetarian options?",
            "Ok, great. Reserve me a table",
            "12:30 pm",
            "Perfect",
            "Oh, I'll need a shared ride cab for me and my friends.",
            "Yes",
            "Correct",
            "Sweet, thanks.",
            "Nope, thanks"
        ],
        "system_utterance": [
            "How about 54 mint ristorante italiano in san francisco",
            "4.4 and yes they have vegetarian options",
            "What time?",
            "Please confirm your table: a 12:30 pm table for 2 at 54 mint ristorante italiano in san francisco on march 1st",
            "This reservation is now complete",
            "Is your destination address 16 mint plaza?",
            "Please confirm: a shared ride for 2 people enroute to 16 mint plaza",
            "This ride is complete and officially on the way",
            "Is there anything else I can help you with",
            "Enjoy your trip."
        ]
    },
    {
        "dialogue_id": "14_00096",
        "service": "Restaurants_2",
        "service_call": {
            "method": {
                "method": "GetRide",
                "parameters": {
                    "destination": "1662 Lombard Street",
                    "number_of_riders": "4",
                    "shared_ride": "True"
                }
            }
        },
        "user_utterance": [
            "I have a plan to eat outside for once and I need your help to search for a good place to eat. Can you help me in this regard.",
            "I like to eat Sushi Bar and I want to fine some nice restaurants in San Francisco.",
            "Yes, I like this restaurant and I want to book a table there for 4 persons on the 13th. Can you do it for me?",
            "Book it at evening 5:30.",
            "Yes, confirmed to proceed with booking. Can you check about the price range in that place?",
            "That's nice, thanks. And I want to book a Cab to go there along with my friends.",
            "That's all okay, please proceed.",
            "Yes, I am okay with it.",
            "That is correct and proceed.",
            "Thanks for your help.",
            "No, that's all for now. Thanks."
        ],
        "system_utterance": [
            "Yes, always. What about your favorite food and in which City do you want me to search for?",
            "What about a restaurant like Atami Sushi Bar & Grill which is located in San Francisco? Do you like this place?",
            "Yes, what is your comfortable time to book the table?",
            "Do you want to book a table for 4 at Atami Sushi Bar & Grill in San Francisco on March 13th at 5:30 pm? I want your confirmation.",
            "They offer food for moderate prices and I have successfully booked the table.",
            "Is it okay for shared ride and please confirm to book a Cab to 1662 Lombard Street.",
            "Can you confirm again whether shared ride is okay to you?",
            "Please give me your confirmation to book a cab with shared ride for 4 persons to 1662 Lombard Street.",
            "I have successfully booked the Cab and the same will reach you soon.",
            "Anything else you need?",
            "Have a good day."
        ]
    },
    {
        "dialogue_id": "14_00097",
        "service": "Restaurants_2",
        "service_call": {
            "method": {
                "method": "GetRide",
                "parameters": {
                    "destination": "16 Mint Plaza",
                    "number_of_riders": "1",
                    "shared_ride": "True"
                }
            }
        },
        "user_utterance": [
            "I need to find a place to dine.",
            "I like Pizza.",
            "I'm in San Francisco.",
            "Sure do that then?",
            "Try for six in the evening.",
            "Wrong, 1 person and I want twelve in the afternoon like I said.",
            "Fine, just do that. Do they have vegetarian choices?",
            "How about a cab there?",
            "Yes, that's great. Shared is fine.",
            "Yes, indeed. Nailed it.",
            "Thanks for helping me.",
            "Nothing now, thanks."
        ],
        "system_utterance": [
            "What foods do you like best?",
            "Where are you?",
            "There are 10 options. First in the list is 54 Mint Ristorante Italiano, it's in San Francisco.",
            "When do you want to eat there?",
            "Fine, I have 2 for Dinner at 54 Mint Ristorante Italiano in San Francisco at 6 pm on March 1st.",
            "Ok to be clear: 1 person ad 12 pm.",
            "Your set to dine. Sure they have options for vegetarians. They also have outdoor seating.",
            "Do you want to share a ride? You're going to 16 Mint Plaza right?",
            "Sure, I have 1 to 16 mint Plaza, shared?",
            "Fine, you're ride is on the way.",
            "What else can I get for you?",
            "Enjoy your pizza."
        ]
    },
    {
        "dialogue_id": "14_00098",
        "service": "Restaurants_2",
        "service_call": {
            "method": {
                "method": "GetRide",
                "parameters": {
                    "destination": "388 Grand Avenue",
                    "number_of_riders": "2",
                    "shared_ride": "True"
                }
            }
        },
        "user_utterance": [
            "Please help me find a reasonably priced restaurant.",
            "I want restaurants in Oakland that serves Pizza and pasta.",
            "What's the address?",
            "Any other option?",
            "I like that one, please help me book a table there.",
            "At six pm.",
            "Yes, What's their rating and their address?",
            "Thanks, please help me get a shared ride cab to go there with my friends.",
            "Yes.",
            "Thank you."
        ],
        "system_utterance": [
            "Which location and food do you prefer?",
            "How about Belotti Ristorante E Bottega in Oakland?",
            "It's 5403 College Avenue.",
            "How about Contrasto in Oakland?",
            "What time do you prefer?",
            "Okay, you want to reserve a table for 2 people at Contrasto in oakland on March 1st at 6 pm. Please confirm.",
            "Their rating is around 4.5 and they are located at 388 Grand Avenue. Your table is now reserved!",
            "Okay, you want a shared ride cab for 2 going to 388 Grand Avenue. Please confirm.",
            "Your cab is on its way!",
            "You are welcome."
        ]
    },
    {
        "dialogue_id": "14_00099",
        "service": "RentalCars_1",
        "service_call": {
            "method": {
                "method": "SearchOnewayFlight",
                "parameters": {
                    "departure_date": "2019-03-04",
                    "destination_city": "Philadelphia",
                    "flight_class": "Economy",
                    "number_checked_bags": "0",
                    "origin_city": "New York",
                    "passengers": "1"
                }
            }
        },
        "user_utterance": [
            "I will want a small car for rent and I will take it at night 8.",
            "I want the car from Friday next week till the 14th.",
            "I will take the car from Philly and I will use it till the 9th of this month.",
            "That is fantastic.",
            "Not at the moment. Help me look for a bus to get there. I need it for one person and I am going from NY.",
            "I will go this Sunday.",
            "Do you have other bus options?",
            "That will be fine.",
            "Not really. I don't want to get the tickets right away.",
            "What do you know of a oneway flight to the place? I need Economy class tickets for the 4th and I will be carrying 0 bags.",
            "Ok. Thank you. That will do."
        ],
        "system_utterance": [
            "What day will you need it from and until what date will you use the car?",
            "What location will you pick it up?",
            "You can have a Compact Cooper ready at Intercity Terminal on March 8th for pick up.",
            "Shall I book the car?",
            "Are you going on March 8th?",
            "There is a bus leaving at 7:40 am. It has 0 stops and will cost $24.",
            "What do you think of the bus leaving at 8 am with 0 stops costing you $19?",
            "Shall I book you the bus tickets?",
            "Shall I help you with something else?",
            "How about this American Airlines flight which leaves at 7:55 am and has 0 layover. You will be charged $56 for one ticket.",
            "Have a wonderful day!"
        ]
    },
    {
        "dialogue_id": "14_00100",
        "service": "RentalCars_1",
        "service_call": {
            "method": {
                "method": "SearchOnewayFlight",
                "parameters": {
                    "departure_date": "2019-03-03",
                    "destination_city": "New York",
                    "origin_city": "Philadelphia",
                    "passengers": "4"
                }
            }
        },
        "user_utterance": [
            "I'd like a large rental car.",
            "I need it until the 5th.",
            "I need it until March 9th in NY. I'll pick up the car at afternoon 12.",
            "That's a good one.",
            "Not right now.",
            "I'd like a bus for there. I need it for 4 people.",
            "I'm coming from Washington. I'm leaving on Saturday this week.",
            "What else is there? I'm leaving on March 1st.",
            "What station would I be leaving from?",
            "What else is there? I'm coming from Philly.",
            "That's the one.",
            "No. I'd like a one way flight there.",
            "I'm leaving a day after tomorrow.",
            "Where does the flight go to?",
            "Thanks. That's all for now."
        ],
        "system_utterance": [
            "When would you like it?",
            "Where will you pick it up? Until when will you have the car? What time do you want it?",
            "I found 5 cars for you. A Cherokee is available at Grand Central Station on March 5th. It's a full-size car.",
            "Would you like to reserve the car?",
            "Do you need anything else?",
            "Are you leaving on March 5th? Where are you coming from?",
            "I found 8 buses. One is leaving at 8:10 am and costs $32 with 0 transfers.",
            "I found 7 buses. One is leaving at 8:20 am and costs $32 with 0 transfers.",
            "Union Station is the origin.",
            "I found 8 buses. One is leaving at 8:30 am and costs $24 with 0 transfers.",
            "Would you like tickets?",
            "Are you leaving March 5th.",
            "I found 3 flights. An American Airlines flight leaves at 8:45 am and costs $59 with 0 layovers.",
            "JFK International Airport is the destination.",
            "Have a nice day."
        ]
    },
    {
        "dialogue_id": "14_00101",
        "service": "RentalCars_1",
        "service_call": {
            "method": {
                "method": "SearchOnewayFlight",
                "parameters": {
                    "departure_date": "2019-03-02",
                    "destination_city": "San Francisco",
                    "flight_class": "Economy",
                    "number_checked_bags": "0",
                    "origin_city": "Los Angeles",
                    "passengers": "3"
                }
            }
        },
        "user_utterance": [
            "I need a rental car. I want to go out on a vacation.",
            "By 12:30 Friday next week, I will go after work.",
            "Maybe in San Francisco. I ll go there after work.",
            "Until the 11th, please.",
            "I just need a small car, I will be travelling alone. Find a car that will be ready for pick up on next Wednesday.",
            "Okay, I liek that one. IS there a bus going there for 3 persons? We are from LA and will be leaving on March 2nd.",
            "Yes, that sounds good.",
            "Not yet. I will consult my friends first.",
            "Yes, I would liek to know if there's a flight going there? Just one way.",
            "Yes, I prefeer economy class and I have zero bags to check in.",
            "And where will it land?",
            "Okay, thanks! It is good to know the price difference."
        ],
        "system_utterance": [
            "What time will you be needing it?",
            "And where will you pick it up?",
            "And until what day you'll be needing it?",
            "Okay, I found 6 cars that is available at SFO international Airport, it will be ready for pick up on March 8th, a standard Altima car.",
            "There's a nice car that is available at SFO international Airport on March 6th, It is a compact Cooper.",
            "There's 10 buses for you, try one that will leave at 6:20 am with 0 stops. It costs $50.",
            "Would you like to purchase tickets?",
            "Do you need help with anything else?",
            "Will you leave in March 2nd?",
            "There's a flight with Alaska Airlines that leaves at 4:55 am with 0 stop over It cost $100 per person.",
            "It will arrive at SFO international Airport.",
            "Great! Have a nice day."
        ]
    },
    {
        "dialogue_id": "14_00102",
        "service": "RentalCars_1",
        "service_call": {
            "method": {
                "method": "SearchOnewayFlight",
                "parameters": {
                    "departure_date": "2019-03-04",
                    "destination_city": "San Francisco",
                    "origin_city": "San Diego",
                    "passengers": "4"
                }
            }
        },
        "user_utterance": [
            "I want a rental car.",
            "I need it next Wednesday until the 12th of this month.",
            "I prefer SFO.",
            "Six in the evening.",
            "What is the cost?",
            "That is good. Can you look for a bus to the same destination.",
            "Actually, next Monday from Anaheim.",
            "Anything else available for four people leaving from SD?",
            "That sounds fine.",
            "Not now. What about a one way flight?",
            "Try next Monday.",
            "Ok, thank you.",
            "No, thanks a lot."
        ],
        "system_utterance": [
            "Which date and how long do you need it?",
            "Where do you want to pick up the rental?",
            "What time do you prefer?",
            "I have 4 options. Salesforce Transit Center has a Cruze, standard, available on March 6th.",
            "The total is $198.",
            "Will you be leaving on March 6th?",
            "There is a bus leaving at 8 am with 0 transfers for $47.",
            "There are 6 options. One bus leaves at 7:40 am with 0 transfers for $61.",
            "Do you want tickets?",
            "Leaving on March 6th?",
            "Alaska Airlines has a flight leaving at 12:40 pm with 0 layovers for $102.",
            "Is there anything else?",
            "Have a nice day."
        ]
    },
    {
        "dialogue_id": "14_00103",
        "service": "RentalCars_1",
        "service_call": {
            "method": {
                "method": "SearchOnewayFlight",
                "parameters": {
                    "departure_date": "2019-03-10",
                    "destination_city": "Seattle",
                    "origin_city": "Vancouver",
                    "passengers": "2"
                }
            }
        },
        "user_utterance": [
            "I'd like a spacious rental car on the 12th.",
            "I'd like to pick it up around afternoon 3:30 in Seattle and need it till March 14th.",
            "For how much?",
            "Sounds good. Can you find me a bus there?",
            "I'm leaving this Saturday.",
            "I need 2 seats from Vancouver.",
            "What bus station will I arrive at?",
            "Can you find a oneway flight there?",
            "March 10th",
            "Which airport does it depart from? When will I arrive?",
            "Okay.",
            "Nope, that will be all."
        ],
        "system_utterance": [
            "When and where would you like to pick it up? How long do you need the car?",
            "There's a full-size Forester available on March 12th from Seattle-Tacoma International Airport.",
            "$98",
            "Are you leaving on March 12th?",
            "From where?",
            "I've found 10 buses. There's one with 0 transfers leaving at 6:40 am for $28.",
            "King Street Station.",
            "For March 12th or March 2nd?",
            "I've found 4 flights. Would you like to fly with Air Canada on a flight with 1 layover leaving at 4:20 am for $282?",
            "It leaves from YVR International Airport and will arrive at 11:02 am.",
            "Anything else I can help with?",
            "Have a great day."
        ]
    },
    {
        "dialogue_id": "14_00104",
        "service": "RentalCars_1",
        "service_call": {
            "method": {
                "method": "SearchOnewayFlight",
                "parameters": {
                    "departure_date": "2019-03-01",
                    "destination_city": "Seattle",
                    "number_checked_bags": "0",
                    "origin_city": "Vancouver"
                }
            }
        },
        "user_utterance": [
            "I would like a rental car.",
            "I want to pick the car up in Seattle in the afternoon 1:30.",
            "I need it for March 3rd.",
            "Until the 9th of this month.",
            "That is good.",
            "No, not now.",
            "is there a bus from Vancouver?",
            "Actually, the 2nd of this month.",
            "Well, what about a one way flight on March 1st. I have 0 bags to check.",
            "No, i want something else.",
            "Anything else available?",
            "Where does it depart?",
            "OK, thanks for that.",
            "No, that's all, thank you."
        ],
        "system_utterance": [
            "When will you need it and where do you want to pick it up?",
            "Which date, please.",
            "How long will you have the car?",
            "OK, I have 3 cars. A Civic, standard, is available at Seattle-Tacoma International Airport for March 3rd.",
            "Do you want to make a reservation?",
            "Can I do anything else for you?",
            "Leaving on March 3rd?",
            "I have 10 options. One departs at 6:40 am with 0 transfers and a cost of $28.",
            "Air Canada leaves at 4:20 am with 1 layover. The ticket costs $273.`",
            "American Airlines has a 1:30 am flight with 1 layover for $256.",
            "Delta Airlines has a 6:40 am flight with 1 layover for $266.",
            "YVR International Airport.",
            "Can I do anything else for you?",
            "Have a nice day."
        ]
    },
    {
        "dialogue_id": "14_00105",
        "service": "RentalCars_1",
        "service_call": {
            "method": {
                "method": "SearchOnewayFlight",
                "parameters": {
                    "departure_date": "2019-03-02",
                    "destination_city": "Seattle",
                    "origin_city": "Vancouver",
                    "passengers": "4"
                }
            }
        },
        "user_utterance": [
            "I'd like to look for a spacious rental vehicle. I require it until the 3rd of this month.",
            "I'd like to pick up the vehicle Fromm Seattle, and I require it from tomorrow. I'd prefer to pick it up near two pm.",
            "How much does it cost?",
            "That's fine with me.",
            "I do not wish to book right now. Could you assist me in looking for a bus headed there for four people. I will depart from Vancouver, BC.",
            "I intend to depart on later today.",
            "That's fine by me. What about a oneway flight heading there?",
            "I'd like to leave tomorrow.",
            "Okay, thank you; that's all."
        ],
        "system_utterance": [
            "When would you like the vehicle from, what location do yu intend to pick it up from, and when will you require it?",
            "I possess 3 vehicles you may enjoy. There is a lovely full-size Forester vehicle available at Seattle-Tacoma International Airport for pickup on MArch 2nd.",
            "Your booking price is $39.",
            "Would you like to book this vehicle?",
            "Do you intend to depart on March 2nd?",
            "I discovered 10 buses for you. What do you think about a bus costing $30 that departs at 6:40 am with 0 transfers?",
            "Will you depart on MArch 2nd or March 1st?",
            "I discovered 4 flights for you. What do you think about a ticket costing $297 for a Air Canada flight that departs at 4:20 am local time with 1 layover?",
            "Have a pleasant afternoon."
        ]
    },
    {
        "dialogue_id": "14_00106",
        "service": "RentalCars_1",
        "service_call": {
            "method": {
                "method": "SearchOnewayFlight",
                "parameters": {
                    "airlines": "Southwest Airlines",
                    "departure_date": "2019-03-02",
                    "destination_city": "Philadelphia",
                    "flight_class": "Economy",
                    "origin_city": "New York",
                    "passengers": "2"
                }
            }
        },
        "user_utterance": [
            "I'm trying to find a car to rent until the 13th of this month and I'd like to get around 8 o\"clock in the night. I want something intermediate.",
            "In Philadelphia please.",
            "On March 11th, I'm thinking.",
            "Okay, that works for me.",
            "No, not now.",
            "I'd like two bus tickets on the 2nd of this month.",
            "That's going to be NYC.",
            "What bus stations does it use?",
            "Okay. I want to find a oneway flight also, something in economy class on the 2nd of this month. Maybe on Southwest Airlines?",
            "Okay, thank you.",
            "No, I'm all set."
        ],
        "system_utterance": [
            "Picking up from where?",
            "Starting when please?",
            "Would you like a standard Altima? It will be available March 11th at Intercity Terminal.",
            "Shall I book that for you?",
            "How else may I serve you?",
            "Departing from what city?",
            "There's a bus with a 7:40 am departure and 0 transfers which is a $24 fare.",
            "It goes from Port Authority Station to Intercity Terminal.",
            "I have 1 Southwest Airlines flight at 8:20 pm, 0 layovers, for $67.",
            "Is there anything else today?",
            "Thank you very much."
        ]
    },
    {
        "dialogue_id": "14_00107",
        "service": "RentalCars_1",
        "service_call": {
            "method": {
                "method": "SearchOnewayFlight",
                "parameters": {
                    "departure_date": "2019-03-01",
                    "destination_city": "Washington",
                    "origin_city": "Philadelphia",
                    "passengers": "2"
                }
            }
        },
        "user_utterance": [
            "I want to search for a car for rent and I need you help to find the best one for me.",
            "Book it from Washington up to March 9th.",
            "Make it from 4th of this month.",
            "Book it for the pickup at half past 12 in the afternoon.",
            "This looks perfect for me. Thanks.",
            "No, may be later.",
            "I want to search for a bus from Philadelphia on later today. I need your help to book two tickets in that bus.",
            "Yes, that is nice and I want one more help from you. Search for a one-way flight to go there.",
            "Yes, do it so.",
            "All right. Thanks.",
            "No, that's all for now and thanks."
        ],
        "system_utterance": [
            "From which place you want to book the car and up to which date?",
            "Which is your convenient date to book the car for pickup?",
            "And what about the pickup time that you want to book?",
            "Got 3 results. How about a standard Camry car available for the pickup from Dulles International Airport on March 4th.",
            "Shall I book this car now?",
            "How can I help you further?",
            "What about your opinion on a bus which leaves at 7:30 am with 0 transfers for the cost $27?",
            "Shall I proceed with the departure date on March 1st?",
            "How about a flight from American Airlines which takes off at 5:50 pm and has the itinerary of 1 layovers for which the ticket cost is $228 per passenger? I think this is the suitable one among the 3 I got.",
            "Do you want me to help further?",
            "Have a great day."
        ]
    },
    {
        "dialogue_id": "14_00108",
        "service": "RentalCars_1",
        "service_call": {
            "method": {
                "method": "SearchOnewayFlight",
                "parameters": {
                    "departure_date": "2019-03-05",
                    "destination_city": "Vancouver",
                    "origin_city": "Seattle",
                    "passengers": "2"
                }
            }
        },
        "user_utterance": [
            "I need to get a rental car soon. Please find a crental car in Vancouver from the 6th of march. Available for pick up at afternoon 12:30.",
            "I need it until the 9th of this month.",
            "What is the cost of it?",
            "That sounds great.",
            "Yes, what options of buses are going there? Look for something for three people leaving from Portland on Tuesday next week.",
            "From which station does it leaves?",
            "To which one it arrives?",
            "What other options are there? Look something for two people on Seattle, WA.",
            "What other buses are there? Look for something on the 3rd of March.",
            "That one sounds great.",
            "Not right now. For now just find me a one way flight to there.",
            "Look for something on Tuesday next week.",
            "When and at what times does it arrive to the destination?",
            "That sounds great, that would be all for now."
        ],
        "system_utterance": [
            "Until when do you need the car?",
            "There are 7 cars for you. There is a Standard Accord car available for pickup at YVR International Airport on March 6th.",
            "It has a cost of $90.",
            "Is there anything else I can help you with?",
            "There are 8 buses you might like. There is a bus that leaves at 6:50 am and has 0 transfers. It has a total cost of $39 per ticket.",
            "It departs from Portland Bus Station",
            "It arrives to Pacific Central Station.",
            "There are 9 buses you might like. There is a bus that departs at 6:40 am and has 0 transfers. It has a total cost of $29 per ticket.",
            "There is a bus that departs at 7:40 am and has 0 transfers. It has a total cost of $21 per ticket.",
            "Do you want to book tickets?",
            "Do you want to depart on March 6th or March 3rd?",
            "There are 5 possible flights for you. There is a flight from Alaska Airlines that takes off at 11:35 am and has 1 layover. It has a cost of $265 per ticket.",
            "The flight arrives on the same day at 8:12 pm local time.",
            "Have a great day."
        ]
    },
    {
        "dialogue_id": "14_00109",
        "service": "RentalCars_1",
        "service_call": {
            "method": {
                "method": "SearchOnewayFlight",
                "parameters": {
                    "departure_date": "2019-03-06",
                    "destination_city": "New York",
                    "origin_city": "Washington"
                }
            }
        },
        "user_utterance": [
            "I want to go for a short ride and I need a rental car to go there. Can you search for the one suitable for me and for your information, I can adjust with any type of ride.",
            "Book it from the 10th. What else details you need to book the car?",
            "Book it for the pickup from NYC around 12 o\"clock in the afternoon.",
            "Book it up to 11th of this month.",
            "Yes, that is perfect.",
            "Yes, I want to search for a bus from Washington and I need your help to find the one.",
            "No, please search for the bus from the 7th.",
            "Let me know about the origin and destination stations for my reference.",
            "This is not suitable to me. please search for some other buses as per my requirements.",
            "No, I want some more options.",
            "Yes, that is okay to me. Can you search for an one-way flight to go there?",
            "I want to search for the flight on Wednesday next week.",
            "Thanks, that's all."
        ],
        "system_utterance": [
            "What is your planned date to book the car from?",
            "Tell me your convenient time and place to book the car?",
            "What is your expected return date up to which you want to book the car?",
            "What about a standard Accord car available for pickup at Grand Central Station on March 10th?",
            "Do you want any more help to do now?",
            "Shall I book it from March 10th?",
            "What about a bus which leaves at 8:10 am with 0 transfers for the cost $38.",
            "This bus will leave from Union Station and it will reach its destination at Port Authority Station.",
            "Another one which leaves at 8:20 am for the cost at $38 with 0 transfers. How about your opinion on this?",
            "What about a bus which leaves at 11:10 am for the cost $36 with 0 transfers?",
            "yes, what about your departure date whether you want to search on March 7th or March 10th.",
            "Got 3 results, What about the one with American Airlines which takes off at 4:10 am local time which has the itinerary 0 layovers and the ticket cost will be $87 per passenger.",
            "Have a great day."
        ]
    },
    {
        "dialogue_id": "14_00110",
        "service": "RentalCars_1",
        "service_call": {
            "method": {
                "method": "SearchOnewayFlight",
                "parameters": {
                    "airlines": "American Airlines",
                    "departure_date": "2019-03-04",
                    "destination_city": "Vancouver",
                    "flight_class": "Economy",
                    "number_checked_bags": "0",
                    "origin_city": "Seattle"
                }
            }
        },
        "user_utterance": [
            "I'd like a rental car.",
            "I need it until the 6th and can pick it up from Vancouver, BC.",
            "I'd like to pick it up at three pm on the 5th of this month.",
            "How much is it?",
            "Any other vehicles available?",
            "Any others?",
            "Sounds good. Can you find me a bus there?",
            "No, I'd like to leave on the 2nd.",
            "Seattle.",
            "That sounds great.",
            "No thanks. I'm okay.",
            "Can you find me a oneway economy flight with American Airlines? I have zero bags.",
            "I'd like to fly out next Monday.",
            "From which airport?",
            "That will work.",
            "Nope. Thanks."
        ],
        "system_utterance": [
            "Where would you like to pick it up? How long do you need it?",
            "When do you want to pick it up?",
            "How about a standard car? There's an accord available on March 5th at YVR International Airport.",
            "it will be $31",
            "Would you like a standard car? There's an altima available for pick up on March 5th at YVR International Airport.",
            "There's a corolla, which is also a standard car, for March 5th at YVR International Airport.",
            "For March 5th?",
            "From where?",
            "There's a bus with 0 transfers leaving at 6:40 am for $26.",
            "Would youlike to buy tickets?",
            "Anything else I can help you with?",
            "So are you leaving on March 5th or March 2nd?",
            "I found 1 American Airlines flight with 1 layover that takes off at 7:50 pm for $248.",
            "It will leave from Seattle-Tacoma International Airport.",
            "Anything else I can help with?",
            "Have a great day."
        ]
    },
    {
        "dialogue_id": "14_00111",
        "service": "RentalCars_1",
        "service_call": {
            "method": {
                "method": "SearchOnewayFlight",
                "parameters": {
                    "departure_date": "2019-03-04",
                    "destination_city": "Portland",
                    "flight_class": "Premium Economy",
                    "origin_city": "Vancouver",
                    "passengers": "2"
                }
            }
        },
        "user_utterance": [
            "I need a rental car.",
            "I want it until the 8th. I'll pick it up in Portland, OR. I'll need it until the 4th of March.",
            "I'll pick it up around 15:30.",
            "What would it cost?",
            "That's fine. I'd like a bus to get there.",
            "I'm coming from Vancouver.",
            "I'm going with 2 people. I'm leaving on the 2nd of this month.",
            "That's fine. I'd like a one-way flight there. I'd like some premium economy class tickets.",
            "I'm leaving on the 4th of March.",
            "That's fine.",
            "No. That's all."
        ],
        "system_utterance": [
            "Where will you pick it up from? Until when will you have the car? When do you want it?",
            "What time do you want it?",
            "I found 8 cars. An Accord is available at PDX International Airport on March 4th. It's a standard car.",
            "It would cost $152.",
            "Where are you coming from?",
            "Are you leaving on March 4th?",
            "A bus is leaving at 9:20 am with 0 transfers and costs $43.",
            "Are you leaving March 2nd?",
            "I've got 3 flights for you. An Air Canada flight leaves at 1:40 am with 1 layover. A ticket costs $379.",
            "Do you need anything else?",
            "Have a nice day."
        ]
    },
    {
        "dialogue_id": "14_00112",
        "service": "RentalCars_1",
        "service_call": {
            "method": {
                "method": "SearchOnewayFlight",
                "parameters": {
                    "airlines": "Delta Airlines",
                    "departure_date": "2019-03-03",
                    "destination_city": "New York",
                    "origin_city": "Washington",
                    "passengers": "4"
                }
            }
        },
        "user_utterance": [
            "I need a rental car from New York at around 15:00.",
            "I need it until next Tuesday and I plan to have it beginning on the Sunday this week.",
            "What is the total rental price?",
            "Okay then. I need a bus that will travel there from Washington on the 1st of March. I have 4 people in my party, total.",
            "Which bus station will I be arriving at? Which bus station will I be leaving from?",
            "Are there any other buses?",
            "Okay, that sounds fine.",
            "No, not now.",
            "Um, are there any one-way flights that will go there?",
            "I want to leave on Sunday this week.",
            "I want something else, like Delta Airlines.",
            "Okay thanks then."
        ],
        "system_utterance": [
            "Until which date would you like the car?",
            "There is a nice vehicle available at Grand Central Station. You can pick it up on March 3rd. It is a Standard vehicle, and is an Accord.",
            "The reservation fee is $56.",
            "There are 8 buses which match your selection. One departs at 8:10 AM and the ticket price is $37, with 0 transfers.",
            "The station which you will be departing from is Union Station and the designated destination station is Port Authority Station.",
            "There is another which is set to depart at 8:20 AM. The ticket price is $32. This route has 0 transfers.",
            "Would you like to purchase these tickets now?",
            "Is there anything that I may help you with?",
            "Would you like to depart on March 3rd or March 1st?",
            "Would you like to fly with American Airlines? The flight will take off at 4:10 AM local time, and will have 0 layovers. The airline ticket price is $90.",
            "Would you like to fly with Delta Airlines? There is a flight at 5:55 PM local time, with 0 layovers. The airline ticket price is $84.",
            "Of course. Have a wonderful day."
        ]
    },
    {
        "dialogue_id": "14_00113",
        "service": "RentalCars_1",
        "service_call": {
            "method": {
                "method": "SearchOnewayFlight",
                "parameters": {
                    "departure_date": "2019-03-07",
                    "destination_city": "Philadelphia",
                    "origin_city": "New York",
                    "passengers": "1"
                }
            }
        },
        "user_utterance": [
            "I'm looking to pick up a rental car on the 10th of this month at 9:30 am.",
            "I need it until the 11th and I'm fine with any type of car.",
            "I want to pick it up from Philly.",
            "Okay, that sounds good. How about a bus going there?",
            "I'm leaving from New York City.",
            "No, I'm leaving on the 7th of March and I just need 1 ticket.",
            "What station does the bus depart from and arrive at?",
            "Okay, that sounds good.",
            "No, not right now.",
            "I'd like to find a oneway flight going there.",
            "I want to depart on the 7th of March.",
            "Okay, thanks. That is all I needed."
        ],
        "system_utterance": [
            "How long do you need the car?",
            "Where do you want to pick the car up at?",
            "There is a full-size Jeep Cherokee for pickup at the Intercity Terminal on March 10th.",
            "Where are you departing from?",
            "Are you leaving on March 10th?",
            "There is a bus leaving at 7:40 am with 0 transfers for $23.",
            "The bus departs from Port Authority Station and arrive at the Intercity Terminal.",
            "Do you want to buy the bus ticket?",
            "Is there anything else I can help you with?",
            "Are you departing on March 10th or March 7th.",
            "There is an American Airlines flight departing at 4:30 am with 0 layovers for $62 per ticket.",
            "Have a great day."
        ]
    },
    {
        "dialogue_id": "14_00114",
        "service": "RentalCars_1",
        "service_call": {
            "method": {
                "method": "SearchOnewayFlight",
                "parameters": {
                    "departure_date": "2019-03-06",
                    "destination_city": "Washington",
                    "number_checked_bags": "0",
                    "origin_city": "New York",
                    "passengers": "1"
                }
            }
        },
        "user_utterance": [
            "Hey, can you rent me a compact car in Washington?",
            "At around 4:30 in the evening on the 11th of March.",
            "Until March 12th please.",
            "Is there anything else? How about a standard car from Wednesday next week?",
            "That sounds great, thanks.",
            "No, not right now.",
            "Yeah, can you get me a bus there? I need 1 ticket from NY.",
            "No, on Saturday this week.",
            "That sounds great, thanks.",
            "No thanks. Can you find a one-way flight there for Wednesday next week? I have 0 bags to check in.",
            "Great, thanks a lot. That's all."
        ],
        "system_utterance": [
            "Sure, from what time on what day?",
            "Okay, and until when do you need it?",
            "Okay, I found a compact Bolt at Dulles International Airport on March 11th.",
            "I found a standard Accord from Union Station on March 6th.",
            "Should I reserve it for you?",
            "Is there anything else?",
            "Okay sure, on March 6th?",
            "Okay, there's a bus departing at 6 am with 0 transfers for $40.",
            "Should I buy your tickets?",
            "There's an American Airlines flight with 0 layovers at 1:30 pm for $82 per person.",
            "Okay, see you."
        ]
    },
    {
        "dialogue_id": "14_00115",
        "service": "RentalCars_1",
        "service_call": {
            "method": {
                "method": "SearchOnewayFlight",
                "parameters": {
                    "departure_date": "2019-03-02",
                    "destination_city": "Portland",
                    "origin_city": "Seattle",
                    "passengers": "3"
                }
            }
        },
        "user_utterance": [
            "I need a small rental car.",
            "I would like it form saturday this week till march 9th.",
            "For 12:30 pm.",
            "I want to pick it up in Portland.",
            "That would be fine. I would need a bus to reach there.",
            "From Seattle, WA and there are three of us.",
            "I want to leave on the 1st of this month.",
            "That would be great. What about an oneway flight to get there?",
            "Yes, that would be great.",
            "Ok, cool. That would be all."
        ],
        "system_utterance": [
            "When would you like it from and till what date?",
            "For what time?",
            "Where would you like to pick it up?",
            "There is a lovely compact forte available for pick up at union station on march 2nd.",
            "Where would you be traveling from?",
            "You want to leave on march 2nd?",
            "There are 10 buses leaving on that there. There is a bus that would be leaving at 6:10 am. It costs $30 and there are 0 transfers.",
            "You would want it for March 2nd?",
            "There are 4 flights leaving that day. There is an alaska airlines flight that leaves at 10:05 pm. There are 0 layovers and a ticket costs $71.",
            "Enjoy your day."
        ]
    },
    {
        "dialogue_id": "14_00116",
        "service": "RentalCars_1",
        "service_call": {
            "method": {
                "method": "SearchOnewayFlight",
                "parameters": {
                    "airlines": "American Airlines",
                    "departure_date": "2019-03-01",
                    "destination_city": "San Diego",
                    "origin_city": "San Francisco"
                }
            }
        },
        "user_utterance": [
            "I need a rental car please.",
            "Till next Wednesday.",
            "I need to pick it up from SD next monday at 6 pm.",
            "What else is available, any type.",
            "Sounds good. Can you find a bus to get there?",
            "I need to leave from San Fran.",
            "I want to leave on the 3rd of this month.",
            "Which station does it arrive at?",
            "What is the departure station?",
            "What else is available.",
            "Sounds good. Can you find any one way flight going there?",
            "I need to leave on the 1st. Please try to find an American Airlines flight.",
            "All right. Thanks, that is all I need."
        ],
        "system_utterance": [
            "Till what date would you like to rent the car?",
            "What time and date would you like to pick it up? Where will you be picking it up from?",
            "There is a nice standard Accord at the Santa Fe Depot on March 4th.",
            "I found 9 cars. There is a nice compact Bolt at Santa Fe Depot on March 4th.",
            "Where will you be departing from?",
            "Will you be leaving on March 4th?",
            "There is a bus departing at 11 am with 0 transfers and costs $56.",
            "The destination is Santa Fe Depot.",
            "It leaves from Salesforce transit Center.",
            "How about one that departs at 1:40 pm and costs $51 with 0 transfers?",
            "Are you leaving March 3rd or March 4th?",
            "I found 1 flight. American Airlines has a flight leaving at 6 pm with 1 layover that costs $162 per passenger.",
            "Have a great day!"
        ]
    },
    {
        "dialogue_id": "14_00117",
        "service": "RentalCars_1",
        "service_call": {
            "method": {
                "method": "SearchOnewayFlight",
                "parameters": {
                    "airlines": "American Airlines",
                    "departure_date": "2019-03-01",
                    "destination_city": "Portland",
                    "origin_city": "Vancouver"
                }
            }
        },
        "user_utterance": [
            "I need a rental car",
            "until march 6th Portland Saturday this week",
            "pick up 3 pm",
            "tell me the cost",
            "anything else there?",
            "what is the cost?",
            "to vancouver bc",
            "1st of this month",
            "any other buses?",
            "1st of this month american airlines",
            "it is economy",
            "thanks a lot"
        ],
        "system_utterance": [
            "until waht date?",
            "at what time?",
            "pdx international airport march 2nd standard accord",
            "it is $144",
            "Portland bus station march 2nd standard camry",
            "it is $112",
            "march 2nd it is",
            "9:20 am $42 8 buses 0 transfers",
            "9:30 am $36 0 transfers",
            "american airlines 1:30 am $292 1 layover 1",
            "alright economy seat",
            "have a nice day"
        ]
    },
    {
        "dialogue_id": "14_00118",
        "service": "RentalCars_1",
        "service_call": {
            "method": {
                "method": "SearchOnewayFlight",
                "parameters": {
                    "departure_date": "2019-03-03",
                    "destination_city": "San Francisco",
                    "origin_city": "San Diego"
                }
            }
        },
        "user_utterance": [
            "Get me a Compact car at nine am on March 13th.",
            "I want to get it in SFO and will return it on the 14th of this month.",
            "Can you find an intermediate car?",
            "How much money will this cost me?",
            "That is great.",
            "No, not right now. I need a bus to get there.",
            "I am departing out of SD.",
            "I am departing on the 12th.",
            "That works for me.",
            "No, not right now.",
            "Find me a one way flight there.",
            "I am departing the day after tomorrow.",
            "That is fine.",
            "No, that is all. Thanks."
        ],
        "system_utterance": [
            "When will you return it?",
            "Search revealed 4 results. There is a Compact Cooper at SFO International Airport on March 13th.",
            "Search revealed 4 results. There is a Standard Altima at SFO International Airport on March 13th.",
            "The total bill is $37.",
            "Shall I book you a car reservation?",
            "What is your departure city?",
            "Are you departing March 13th?",
            "I found a bus with 0 transfers, a departure time of 7:40 am and a cost of $53.",
            "Shall I buy you bus tickets?",
            "Do you need more help?",
            "Are you departing March 12th or March 13th?",
            "Search revealed 5 results. Alaska Airlines has 0 layovers, a departure time of 12:40 pm and a cost of $112.",
            "Do you need more help?",
            "Have a great day."
        ]
    },
    {
        "dialogue_id": "14_00119",
        "service": "RentalCars_1",
        "service_call": {
            "method": {
                "method": "SearchOnewayFlight",
                "parameters": {
                    "airlines": "United Airlines",
                    "departure_date": "2019-03-11",
                    "destination_city": "Los Angeles",
                    "number_checked_bags": "0",
                    "origin_city": "Las Vegas",
                    "passengers": "4"
                }
            }
        },
        "user_utterance": [
            "Hey, can you get me an intermediate rental car from the 12th of this month until the 14th?",
            "From LAX at around half past 4 in the evening.",
            "How much is it?",
            "Is there anything else?",
            "How much will that cost?",
            "Sure. Can you get me 4 tickets on a bus there from Las Vegas this Sunday?",
            "Sounds good. Are there any one-way flights?",
            "On the 6th of March.",
            "Is there anything else? I have 0 bags.",
            "Is there anything else? How about United Airlines on the 11th?",
            "Sounds good, that'll be all thanks."
        ],
        "system_utterance": [
            "Sure, where from? At what time?",
            "Okay, I found 6 cars for you. How about a standard Camry from LAX International Airport on March 12th?",
            "It'll cost $64 in total.",
            "How about a standard Civic from Union Station on March 12th?",
            "It'll be $70 in total.",
            "Okay, I found 4 buses. How about the 7:20 am bus with 0 transfers for $41?",
            "On March 12th or March 3rd?",
            "I found 3 flights. American Airlines has one with 0 layovers at 4:50 am, it costs $86 per person.",
            "Delta Airlines has a flight with 1 layover departing at 10:10 am for $148 per person.",
            "United Airlines? They have one flight at 5:35 pm with 0 layovers for $78 per person.",
            "Okay, see you."
        ]
    },
    {
        "dialogue_id": "14_00120",
        "service": "RentalCars_1",
        "service_call": {
            "method": {
                "method": "SearchOnewayFlight",
                "parameters": {
                    "departure_date": "2019-03-03",
                    "destination_city": "Vancouver",
                    "origin_city": "Seattle"
                }
            }
        },
        "user_utterance": [
            "I'm going to attend a party on March 11th. Please help me find a rental car that I need from 10th of March.",
            "I will be in Vancouver, BC, make it the pick up point.",
            "I will pick it up after work so that would be around evening 5.",
            "How much will it cost?",
            "That's quite a big money. Is there anything else?",
            "That's good to know.",
            "Not yet, I need to check my budget first.",
            "How a about a bus going there?",
            "I'm here at Seattle, WA.",
            "No. Make it 6th of this month since I should be there early.",
            "Okay, that sounds good.",
            "How about if I take a plane going there?",
            "I think I can do it on March 3rd. I will just apply for a vacation leave.",
            "Okay, thank you. Now I know the difference.",
            "Not yet, but thanks for your help."
        ],
        "system_utterance": [
            "Okay. Where do you want to pick it up?",
            "What time will you need it?",
            "I found a nice car available at YVR International Airport that will be ready for pick up on March 10th. It is a Standard Honda Accord.",
            "It will just cost $34.",
            "I found a nice car available at YVR International Airport that will be ready for pick up on March 10th. It is a Standard Altima.",
            "Do you want to make a reservation?",
            "Do you need help with anything else?",
            "And where will you leaving from?",
            "Would you like to leave on March 10th?",
            "Okay, there's 9 buses for you. The best one leaves at 6:40 am with 0 transfers. It costs $26.",
            "Do you need further assistance?",
            "Would you like to leave on March 6th or March 10th?",
            "There are 5 flights that I found, one is from Alaska Airlines that will leave at 7:30 am with 1 layover. It cost $257.",
            "Do you need help in booking one of it?",
            "Sure thing, have a great day."
        ]
    },
    {
        "dialogue_id": "14_00121",
        "service": "RentalCars_1",
        "service_call": {
            "method": {
                "method": "SearchOnewayFlight",
                "parameters": {
                    "departure_date": "2019-03-03",
                    "destination_city": "Washington",
                    "origin_city": "New York"
                }
            }
        },
        "user_utterance": [
            "I'd like a rental car around 2 o\"clock in the afternoon until March 7th.",
            "I need it on March 4th and can pick it up from Washington.",
            "Can you help me find a bus to go there?",
            "I'm leaving from NY later today.",
            "Sounds good.",
            "How about a oneway flight there on the 3rd of March?",
            "Okay, that will be all."
        ],
        "system_utterance": [
            "When and where do you want to pick it up?",
            "There's a nice standard vehicle like an accord available on March 4th at Union Station.",
            "Are you leaving March 4th? Where are you leaving from?",
            "There's a bus leaving at 6 am that has 0 transfers and costs $34.",
            "Anything else I can help with?",
            "There's an American Airlines flight with 0 layovers that takes off at 1:30 pm and costs $82.",
            "Have a great day."
        ]
    },
    {
        "dialogue_id": "14_00122",
        "service": "RentalCars_1",
        "service_call": {
            "method": {
                "method": "SearchOnewayFlight",
                "parameters": {
                    "airlines": "Delta Airlines",
                    "departure_date": "2019-03-01",
                    "destination_city": "Philadelphia",
                    "origin_city": "Washington",
                    "passengers": "1"
                }
            }
        },
        "user_utterance": [
            "I'm looking for an intermediate rental car to pick up around afternoon 12.",
            "I need to pick up the car from Philadelphia from this Sunday until Saturday this week",
            "What is the total cost?",
            "Okay, thanks.",
            "No, not right now.",
            "I'd like to find a bus going there.",
            "I'm departing from Washington today and I just need one ticket.",
            "Okay, thanks. What about a one way flight going there? I want to fly on Delta Airlines.",
            "I want to depart today.",
            "Okay, thanks. That is all I needed."
        ],
        "system_utterance": [
            "What are the dates of the reservation? Where do you want to pick the car up from?",
            "There is a standard Nissan Altima available for pickup at 30th Street Station on March 2nd.",
            "The total cost is $31.",
            "Do you want to reserve the car?",
            "Is there anything else I can help you with?",
            "Where are you departing from?",
            "There is a bus leaving at 7:10 am with 0 transfers for $30.",
            "Are you departing on March 1st or March 2nd?",
            "I found 1 flight for you. There is a Delta Airlines flight with 1 layover departing at 5:55 pm for $148 per ticket.",
            "Have a great day."
        ]
    },
    {
        "dialogue_id": "14_00123",
        "service": "RentalCars_1",
        "service_call": {
            "method": {
                "method": "SearchOnewayFlight",
                "parameters": {
                    "departure_date": "2019-03-07",
                    "destination_city": "New York",
                    "number_checked_bags": "0",
                    "origin_city": "Washington",
                    "passengers": "1"
                }
            }
        },
        "user_utterance": [
            "I need to find a compact rental car that I can pickup in NY on the 12th of March",
            "I need it till March 13th",
            "I want to pick it up at two in the afternoon",
            "What's that gonna cost?",
            "OK, that sounds great",
            "No, not at the moment, but can you find me a bus going there?",
            "I'm coming from Washington on March 3rd",
            "That sounds good. What about a one way flight for 1 with 0 bags to check in.",
            "I want to fly out on the 7th please",
            "What airport does this flight depart from?",
            "Does it arrive the next day?",
            "OK, good to know",
            "No, for now I've gotten all I need"
        ],
        "system_utterance": [
            "Till when do you need the car?",
            "At what time do you need it?",
            "There's a pretty good Compact Bolt available on March 12th at Port Authority Station",
            "It'll be $25 total",
            "Do you want to reserve it now?",
            "Do you plan to leave on March 12th, where are you coming from?",
            "How about this 8:10 am bus with 0 transfers that'll cost $37",
            "Are you leaving on March 3rd or March 12th",
            "I found 4 flights including an American Airlines flight at 4:10 am with 0 layovers for $88",
            "It leaves from Dulles International Airport",
            "It actually arrives on the same day",
            "Can I do something else at the moment?",
            "Thank you so much"
        ]
    },
    {
        "dialogue_id": "14_00124",
        "service": "RentalCars_1",
        "service_call": {
            "method": {
                "method": "SearchOnewayFlight",
                "parameters": {
                    "airlines": "United Airlines",
                    "departure_date": "2019-03-02",
                    "destination_city": "San Francisco",
                    "origin_city": "San Diego",
                    "passengers": "4"
                }
            }
        },
        "user_utterance": [
            "Can you help me find a rental car in San Fran? I need it for the 2nd of March at around 12:30.",
            "Until next Thursday.",
            "Okay, that sounds promising.",
            "Not at this moment, but could you help me find a bus that is going to San Fran for four people?",
            "I'm leaving from SD on March 1st.",
            "That's okay but are there any other buses?",
            "That's alright, are there any one way flights headed there? Preferably through United Airlines.",
            "Yes, that's correct.",
            "Thank you, that's all I need."
        ],
        "system_utterance": [
            "Sure, until what day will you need the car?",
            "Okay, there's a Standard car, an Altima available for pickup one March 2nd at SFO International Airport.",
            "Would you like to reserve this car?",
            "Sure, where is the place of origin? Is your departure date on March 2nd?",
            "Okay, I found 6 buses that match your requirements. There is a bus departing at 7:40 am with 0 transfers ans the price is $54. How does that sound?",
            "Yes, there's a bus departing at 10 am with 0 transfers for $56.",
            "You're leaving on March 2nd?",
            "Okay, I found 1 flight meeting your requirements. The flight is through United Airlines and departs at 6:35 am local time with 0 layovers. The price is $115 per person.",
            "Okay, have a nice day."
        ]
    },
    {
        "dialogue_id": "14_00125",
        "service": "RentalCars_1",
        "service_call": {
            "method": {
                "method": "SearchOnewayFlight",
                "parameters": {
                    "departure_date": "2019-03-01",
                    "destination_city": "New York",
                    "origin_city": "Washington"
                }
            }
        },
        "user_utterance": [
            "Hey, can you get me a rental car in NY until the 14th of March?",
            "I need it from morning 11 on March 7th. I need a full-size car.",
            "Sounds great, thanks.",
            "No thanks. Can you find me a bus there?",
            "From Washington, please.",
            "No, the day after tomorrow.",
            "Which station does it depart from and arrive at?",
            "Thanks a lot. Any one-way flights going there on March 1st?",
            "Thanks, that'll be all."
        ],
        "system_utterance": [
            "Sure, what day and time do you need it?",
            "Okay, there's a good full-size Escape at JFK International Airport on March 7th.",
            "Should I reserve it for you?",
            "Sure, where from?",
            "Okay, on March 7th?",
            "Okay how about the 8:10 am bus? It's $37 with 0 transfers.",
            "It departs from Union Station and arrives at the Port Authority Station.",
            "I found 4 flights for you. There's an American Airlines flight departing 1 pm with 0 layovers for $88 per person.",
            "Okay, see you."
        ]
    },
    {
        "dialogue_id": "14_00126",
        "service": "RentalCars_1",
        "service_call": {
            "method": {
                "method": "SearchOnewayFlight",
                "parameters": {
                    "departure_date": "2019-03-05",
                    "destination_city": "San Diego",
                    "origin_city": "San Francisco",
                    "passengers": "2"
                }
            }
        },
        "user_utterance": [
            "I need to pick up a medium-sized rental car on Wednesday next week.",
            "I am picking the car up from SD and I need it until next Friday.",
            "I want to pick it up around 1:30 pm.",
            "Okay, thanks. I also want to find a bus going to San Francisco for two people on the 1st of this month.",
            "What station does the bus depart from and arrive at?",
            "What other buses are there?",
            "Okay, that sounds good.",
            "No, not right now.",
            "I'd like to find a one way flight going there on the 5th and any airline works.",
            "Does the flight arrive on the day after it departs? How may checked bags are allowed?",
            "Okay, thank you. That is all I needed."
        ],
        "system_utterance": [
            "How long will you need the car? Where you do want to pick it up from?",
            "What time do you want to pick it up at?",
            "I found 6 cars for you. There is a standard Honda Accord available for pickup at Santa Fe Depot on March 6th.",
            "There is a bus departing at 11 am with 0 transfers for $58.",
            "The bus departs from Salesforce Transit Center and arrives at Santa Fe Depot.",
            "There is a bus departing at 1:40 pm with 0 transfers for $51.",
            "Do you want to purchase the bus tickets?",
            "Is there anything else I can help you with?",
            "There is an Alaska Airlines flight departing at 7:40 pm with 0 layovers for $118 per ticket.",
            "The flight arrives at the destination on the same day and 0 checked bags are allowed.",
            "Have a great day."
        ]
    },
    {
        "dialogue_id": "14_00127",
        "service": "RentalCars_1",
        "service_call": {
            "method": {
                "method": "SearchOnewayFlight",
                "parameters": {
                    "airlines": "Delta Airlines",
                    "departure_date": "2019-03-05",
                    "destination_city": "Seattle",
                    "number_checked_bags": "0",
                    "origin_city": "Vancouver",
                    "passengers": "4"
                }
            }
        },
        "user_utterance": [
            "I'd like to find an intermediate rental car.",
            "I want to pick it up on the 8th of this month.",
            "I'll return it the next day, on the 9th of this month.",
            "I'll pick it up in Seattle, WA.",
            "I need it at 16:30.",
            "That will work.",
            "No, I'd like to see if I can find a bus instead.",
            "I'll be leaving Portland on the 4th of this month.",
            "No, I'd like to see what's available for one person leaving Vancouver, BC.",
            "Is there anything available for 4 people?",
            "That one will be fine.",
            "No, I'd like to compare prices with a one-way flight. I have zero checked bags.",
            "Actually, I'll be leaving on the 5th of this month.",
            "I'd prefer a Delta Airlines flight.",
            "That will work.",
            "No, you've got it covered. Thank you."
        ],
        "system_utterance": [
            "When do you need it?",
            "How long will you be keeping it?",
            "Where will you be getting it?",
            "What time works best for you?",
            "There is a Standard car available at Seattle-Tacoma International Airport on March 8th. Would a Civic work for you?",
            "Would you like to make your reservation now?",
            "Would you still be leaving on March 8th? Where are you departing from?",
            "There are 8 buses that may work for you. There is one leaving at 8:40 am for $30 with 0 transfers.",
            "For $30, there is a bus with 0 transfers leaving at 6:40 am.",
            "Yes, the 8:10 am has 0 transfers and tickets are priced at $29.",
            "Did you want to purchase your tickets?",
            "Is your departure date March 4th or March 8th?",
            "Air Canada has a flight with 1 layover at 12:15 pm at a rate of $274 per person.",
            "Delta Airlines has a flight for $277. It has 1 layover and it departs at 10:15 am.",
            "Is there anything else you can do?",
            "You're welcome. Have a wonderful day."
        ]
    }
]