[
    {
        "dialogue_id": "16_00000",
        "service": "RentalCars_1",
        "service_call": {
            "method": {
                "method": "FindRestaurants",
                "parameters": {
                    "category": "Indian",
                    "has_vegetarian_options": "True",
                    "location": "San Francisco"
                }
            }
        },
        "user_utterance": [
            "I need to find a rental car please",
            "I need it on the 9th of this month",
            "I need it on March 14th",
            "I want it at 6 o\"clock in the evening in Vancouver",
            "That sounds great",
            "Yes, please do",
            "Yes, that sounds good, what's that gonna cost me?",
            "Great, now find me a hotel room",
            "Yes that's great, now find me a restaurant please",
            "We're looking in San Fran, I want some Punjabi food that has vegetarian options",
            "Yes, great. Thanks, that's it for now"
        ],
        "system_utterance": [
            "When do you want it from?",
            "And until when?",
            "Where do you want to get it from? And at what time?",
            "How about a standard Altima on March 9th from YVR International Airport",
            "Do you want to reserve it then?",
            "Confirming your standard car pickup from YVR International Airport on March 9th at 6 pm with a March 14th drop off.",
            "It's been booked and will cost you $190 in total",
            "The Atrium Inn Vancouver is a nice hotel that's rated 3 stars",
            "What location are we looking in?",
            "I found 10 places in San Francisco including a place called Amber that you might enjoy",
            "Alright, let me know if I can do something else"
        ]
    },
    {
        "dialogue_id": "16_00001",
        "service": "RentalCars_1",
        "service_call": {
            "method": {
                "method": "FindRestaurants",
                "parameters": {
                    "category": "American",
                    "has_vegetarian_options": "True",
                    "location": "Lafayette"
                }
            }
        },
        "user_utterance": [
            "Get me a rental car in London, England.",
            "I will get it at afternoon 12:30.",
            "I will return it on the 14th of this month.",
            "I want to get the car Friday next week.",
            "How much will this cost me?",
            "That works for me. Book me this car right now.",
            "That is right.",
            "That is great. I need a 3 star hotel with 2 rooms.",
            "What is their physical location and their contact number?",
            "That works for me.",
            "No, not right now.",
            "Find me a vegatarian place in Lafayette.",
            "I am in the mood for some Barbecue.",
            "Can you eat outside and what is their rating?",
            "That is good. I have nothing nothing more right now."
        ],
        "system_utterance": [
            "What time will you pick it up?",
            "When will you return it?",
            "What day will you get it?",
            "There is a Standard Cruze at Heathrow International Airport on March 8th.",
            "The total price is $198.",
            "You want a Standard car at Heathrow International Airport on March 8th at 12:30 pm and will return it March 14th, correct?",
            "Your reservation is complete.",
            "Search revealed 10 results. 45 Park Lane is located in London and is a 3 star place.",
            "You can visit them at 45 Park Lane and contact them at +44 20 7493 4545.",
            "Shall I book you a room?",
            "Do you need more help?",
            "What type of food do you like?",
            "Search revealed 1 result which is Duck Club Restaurant in Lafayette.",
            "You can't eat outside and their rating is 4.0.",
            "Have a great day."
        ]
    },
    {
        "dialogue_id": "16_00002",
        "service": "RentalCars_1",
        "service_call": {
            "method": {
                "method": "FindRestaurants",
                "parameters": {
                    "category": "Japanese",
                    "location": "San Mateo",
                    "price_range": "moderate"
                }
            }
        },
        "user_utterance": [
            "I need a rental car for this evening 6:30.",
            "I need it Saturday this week until March 8th from SD.",
            "What is the cost?",
            "Ok, that is good.",
            "Yes, please, I do.",
            "That is correct.",
            "I also need a 2 star hotel there for 2 rooms with wifi.",
            "That is good.",
            "Not now. I also want a reasonably priced restaurant in San Mateo.",
            "I prefer Japanese.",
            "That's great, thanks."
        ],
        "system_utterance": [
            "Where do you want to pick it up, which date and for how long?",
            "There is an Accord, standard, at Santa Fe Depot on March 2nd.",
            "The total is $168.",
            "Do you want a reservation.",
            "Confirm picking up from Santa Fe Depot on March 2nd at 6:30 pm and dropping off on March 8th and it is a standard car.",
            "The reservation is confirmed.",
            "Bahia Resort Hotel is a 2 star hotel.",
            "Would you like to make a reservation?",
            "What type of cuisine?",
            "There are 7 options. Daiki Sushi is in San Mateo.",
            "Have a nice day."
        ]
    },
    {
        "dialogue_id": "16_00003",
        "service": "RentalCars_1",
        "service_call": {
            "method": {
                "method": "FindRestaurants",
                "parameters": {
                    "category": "American",
                    "location": "Brentwood",
                    "price_range": "moderate"
                }
            }
        },
        "user_utterance": [
            "I need to find a rental car in Paris on the day after tomorrow.",
            "Around 3:30 pm in Nairobi, Kenya and return it on March 8th.",
            "How much is it?",
            "Sounds good, please make the reservation.",
            "Yes that is correct.",
            "I also need a hotel.",
            "Sounds good thanks.",
            "I also need to find an affordable restaurant.",
            "Something southern in Brentwood.",
            "Sounds great, that's all I need."
        ],
        "system_utterance": [
            "What time do you want to pick it up?",
            "I found 2. You may like the standard Elantra available for pickup on March 3rd at Jomo Kenyatta International Airport.",
            "The reservation will be $125.",
            "You want a standard to be picked up on March 3rd at 3:30 pm at JOmo Kenyatta International Airport and to be returned on March 8th, correct?",
            "Your reservation has been made.",
            "Azure Hotel Nairobi Westlands is a nice 5 star.",
            "Can I do anything else for you?",
            "What kind of food do you want and in which location should I search?",
            "Black Angus Steakhouse is in Brentwood.",
            "Okay enjoy your day."
        ]
    },
    {
        "dialogue_id": "16_00004",
        "service": "RentalCars_1",
        "service_call": {
            "method": {
                "method": "FindRestaurants",
                "parameters": {
                    "category": "American",
                    "location": "Oakland"
                }
            }
        },
        "user_utterance": [
            "I want to go for a short ride for which I have to search for a rental car. Can you help me to find the suitable one.",
            "I need the car from Portland, OR for the pick up time at 5 o\"clock in the evening and up to the 7th.",
            "Book it from today.",
            "Yes, I also choose this car and I want to reserve it now.",
            "That is corrrect and you can proceed with the reservation. Can you tell me the total cost for this ride?",
            "Thank you very much. I need one more favor from you. I want to stay there for a while and I need to book two rooms in a nice hotel with three stars. Can you search for the one for me?",
            "Can you please check about the cost and address of this hotel for me?",
            "Yes, but I need to search for something else and I need one room only.",
            "Anything else available?",
            "Yes, that is the one I want. Also I need to find some nice restaurants there.",
            "I like Barbecue food and search for it in Oakland.",
            "I want to know about the rating of them and also please check for the availability of vegetarian food there?",
            "That is nice. Thanks.",
            "No. Thanks for your help."
        ],
        "system_utterance": [
            "Yes, Let me you know your convenient time and place to pickup the car and also tell your planned date up to which you need the car for rent.",
            "What is your convenient date to book the car from?",
            "What about your opinion on a standard Corolla Car for the pickup at Union Station on March 1st? Hope this is okay to you?",
            "Please confirm to reserve a standard Car available for the pickup at Union Station from March 1st for the time 5 pm to March 7th.",
            "It costs $252 in total for this ride and note that I have successfully reserved the car for you.",
            "Yes, What about a hotel name Aloft Portland Airport At Cascade Station with 3 stars which is the nice one I think?",
            "Cost will be at $126 per night for the room booking and they are located at 9920 Northeast Cascades Parkway. Hope this information was useful to you.",
            "What about a hotel name Canopy By Hilton Portland Pearl District with 3 stars?",
            "Yes, Another one hotel name Country Inn & Suites by Radisson, Portland International Airport, Or with 3 stars. How about this?",
            "Do you have any favorite kind of food you are looking for and In which City you want to search for it?",
            "Got 10 results suitable to your taste and how about a restaurant like Chop Bar in Oakland?",
            "No, they do not have vegetarian Foods and note that their rating is 4.4.",
            "Shall I book the table there for you now?",
            "Have a great day."
        ]
    },
    {
        "dialogue_id": "16_00005",
        "service": "RentalCars_1",
        "service_call": {
            "method": {
                "method": "FindRestaurants",
                "parameters": {
                    "category": "Japanese",
                    "location": "San Francisco"
                }
            }
        },
        "user_utterance": [
            "I'd like to look for a rental vehicle.",
            "I require the vehicle from March 9th to the 12th of this month, and I'd want to pick up the vehicle on afternoon 2.",
            "I'd like to pick up the vehicle from Paris.",
            "That's wonderful. I'd like to book this vehicle.",
            "Yeah, that sounds perfect for me. How much does it cost?",
            "I'd like to find a hotel room nearby.",
            "Alright, that's perfect.",
            "Nah, I do not wish to book a room. I want to look for a diner nearby.",
            "Get me a diner in SFO that offers Izakaya.",
            "Can you tell me the diner's contact number?",
            "Aright, that's fine. That's all."
        ],
        "system_utterance": [
            "When will you require the vehicle; specifically, from what day and until what date?",
            "What location do you wish to pick it up from?",
            "There is a lovely standard Accord vehicle available from Charles de Gaulle international Airport for pickup on March 9th.",
            "Please verify the following information: you will pick up a standard vehicle from Charles de Gaulle International Airport from March 9th on 2 pm. The drop-off date is March 12th.",
            "Your vehicle has been booked, and the price is $105.",
            "There is a lovely 4 star hotel called Ac Hotel By Marriott Paris Porte Maillot.",
            "Do you wish to book a room at the hotel?",
            "What places ought I look in, and what type of cuisine do you want?",
            "There is a lovely diner called 2g Japanese Brasserie in San Francisco.",
            "The diner's contact number is 415-292-9997.",
            "Have a pleasant afternoon."
        ]
    },
    {
        "dialogue_id": "16_00006",
        "service": "RentalCars_1",
        "service_call": {
            "method": {
                "method": "FindRestaurants",
                "parameters": {
                    "category": "Japanese",
                    "location": "Pleasanton"
                }
            }
        },
        "user_utterance": [
            "I'd like to rent a large car until the 14th. I need it by eight pm.",
            "From Anaheim on March 9th.",
            "Great. Grab it before its gone.",
            "Yes it is. How much will this run me?",
            "Cool. All I need now is a hotel there. Do you know a good 1 star place to crash?",
            "Do they have wife? How can I talk to them?",
            "Awesome. Could you find me a restaurant in Pleasanton?",
            "Yeah, I could go for some sushi.",
            "That sounds tasty.",
            "Don't bother. I'm set."
        ],
        "system_utterance": [
            "On what date do you need it? And from where?",
            "Ok. I have 1, a full-size Forester that you can pickup on March 9th from John Wayne Airport.",
            "OK. A full-size car from March 9th to March 14th. Pickup from John Wayne Airport at 8 pm. Is that correct?",
            "It is $235. You have a car.",
            "Yes, I know 10 1 star places. Try the Anaheim Desert Inn and Suites.",
            "Call them at +1 714-772-5050. They have wifi.",
            "Are you craving anything in particular?",
            "OK. I have 4 suggestions. in Pleasanton. First up is Meiko Sushi.",
            "I can get you a table.",
            "Ok. Take it easy."
        ]
    },
    {
        "dialogue_id": "16_00007",
        "service": "RentalCars_1",
        "service_call": {
            "method": {
                "method": "FindRestaurants",
                "parameters": {
                    "category": "Sandwich",
                    "location": "Vacaville"
                }
            }
        },
        "user_utterance": [
            "Can you help me search for a rental car? I will need it while out of town.",
            "I am looking to get the car at approximately 5 o\"clock in the evening. I'd also like to get a Standard car",
            "I need to get the car from Fresno, CA and I'll be needing it up until the 11th of the month",
            "I would like to have the reservation start on March 8th",
            "Can you tell me how much my final price for this will be?",
            "Are there additional options? I will be needing the car from Wednesday next week and I am ideally looking to get it from Paris",
            "Great, this works for mme. Let's go ahead and book this one",
            "Sure, that's perfect",
            "Thanks so much",
            "I also need to get a hotel room while there",
            "Sure, that will work",
            "no, not at this time",
            "Sure. Can you search for restaurants in the area",
            "I'd like to get a restaurant in Vacaville",
            "I'd like a restaurant that serves fast food",
            "great, that works for me",
            "not at this moment, thanks"
        ],
        "system_utterance": [
            "What time would you like to set pick up for?",
            "And for how long would you like to rent the car? Do you also have a particular pick up location in mind?",
            "And what is the beginning date of the reservation?",
            "There is a suitable Standard car that is open for reservation on March 8th at Fresno Station. The car model is Accord",
            "The final price will be $90",
            "There are 3 cars that may work for you. One is a Cruze, which is a Standard car, and it is open for reservation on March 6th at Charles de Gaulle International Airport",
            "Confirming then, you would like to rent a Standard car beginning on March 6th at 5 pm from Charles de Gaulle International Airport. You would like to drop it off on March 11th",
            "Your car has been booked per those requirements",
            "Will there be anything further?",
            "10 hotels fit your preferences. Ac Hotel By Marriott Paris Porte Maillot is one of them. It is a 4 star hotel",
            "Do you want to go ahead and book a room at this hotel?",
            "Is there anything more I can assist you with?",
            "Where would you like me to find a restaurant?",
            "And are you interested in any specific cuisine type?",
            "There is 1 restaurant fitting your request. It is a nice McDonald's restaurant in Vacaville",
            "would you like to go forward with a reservation at this restaurant?",
            "Enjoy your day"
        ]
    },
    {
        "dialogue_id": "16_00008",
        "service": "RentalCars_1",
        "service_call": {
            "method": {
                "method": "FindRestaurants",
                "parameters": {
                    "category": "Coffeehouse",
                    "location": "Gilroy"
                }
            }
        },
        "user_utterance": [
            "I'd like to search for a rental vehicle, which I require until March 10th.",
            "I'd like to pick up the vehicle from LAX at 1 in the afternoon.",
            "I require the vehicle beginning on March 9th.",
            "How much does it cost?",
            "Do you have some other alternative? I require the vehicle until 13th of March, and would like to pic it up around 14:00.",
            "Do you have some other alternative? I'd like a spacious vehicle.",
            "How much does it cost?",
            "That's perfect. I'd like to book this vehicle.",
            "Yup, that's perfect for me.",
            "I'd like to look for 1 room in a 2 starhotel nearby.",
            "Yeah, that's perfect for me. I want to look for a diner nearby.",
            "Get me diners in Gilroy that offer Coffee & light bites.",
            "Yeah, that's fine with me.",
            "No, thank you for your assistance."
        ],
        "system_utterance": [
            "What location would you like to pick it up from, and when will you require it?",
            "What day would you like the vehicle from?",
            "I posses 6 vehicles you may enjoy. There is a lovely standard Camry available from LAX International Airport for pickup on March 9th.",
            "The booking price is $34.",
            "There is a lovely standard civic vehicle available from Union Station for pickup on March 9th.",
            "I posses 5 vehicles you may enjoy. There is a lovely full-size Cherokee vehicle available at LAX International Airport for pickup at March 9th.",
            "Your booking price is $196.",
            "Please verify the following information: you are picking up a full-size vehicle from LAX International Airport on March 9th, 2 pm, with the drop-off day being March 13th.",
            "Your vehicle has been booked.",
            "There is a lovely 2 star hotel called Ac Hotel By Marriott Beverly Hills.",
            "What place ought I look in, and what type of cuisine are you searching for?",
            "There is a lovely diner called Mcdonald's in Gilroy.",
            "Could I assist you with something else?",
            "Have a pleasant afternoon."
        ]
    },
    {
        "dialogue_id": "16_00009",
        "service": "RentalCars_1",
        "service_call": {
            "method": {
                "method": "FindRestaurants",
                "parameters": {
                    "category": "French",
                    "location": "Walnut Creek",
                    "price_range": "moderate"
                }
            }
        },
        "user_utterance": [
            "Hey, can you get me a rental car in San Francisco on the 2nd?",
            "I'll pick it up at 12:00 and return it Thursday next week.",
            "Sounds great, please reserve it.",
            "Yes, that's correct.",
            "Thanks, can you get me a hotel room there too?",
            "Does it have wifi?",
            "Is there anything else? I just need one room, but I'd prefer a 2 star place.",
            "Sounds great. Can you also get me a moderate restaurant in Walnut Creek?",
            "French food, thanks.",
            "Is there anything else?",
            "Sounds good, thanks.",
            "No thanks. That'll be all today."
        ],
        "system_utterance": [
            "Sure, when do you need it until? And at what time on the 2nd will you pick it up?",
            "Okay, I found 5 cars for you. How about a standard Altima at SFO International Airport on March 2nd?",
            "Okay, please confirm that you'd like to reserve a standard car from SFO International Airport on at 12 pm on March 2nd until March 7th.",
            "Your car has been reserved.",
            "Sure, how about the 1 star Amsterdam Hostel San Francisco?",
            "Yes, it does.",
            "Okay, I found 10 hotels matching your requirements. How about the 2 star Argonaut Hotel?",
            "Yeah sure, what kind of food?",
            "Okay, I found 3 restaurants in Walnut Creek. How about Cypress Restaurant?",
            "La Sen Bistro WC is also in Walnut Creek.",
            "Would you like a table there?",
            "Okay, see you."
        ]
    },
    {
        "dialogue_id": "16_00010",
        "service": "RentalCars_1",
        "service_call": {
            "method": {
                "method": "FindRestaurants",
                "parameters": {
                    "category": "Burmese",
                    "location": "San Francisco"
                }
            }
        },
        "user_utterance": [
            "Book me a rental car.",
            "I want to pick it up on March 6th and return it on the 8th of March.",
            "I will get it at 11 am in Vegas.",
            "That works for me. Book me this car.",
            "That is right. What does the final bill come to?",
            "Thanks a bunch. I need a hotel for there too.",
            "What else can you find?",
            "Can you find any two star places?",
            "That works for me. Find me a place near there that serves Burger.",
            "I want to eat in SFO.",
            "What is their physical location and their rating?",
            "Can you find a place that serves Burmese?",
            "That is great. That is everything for now."
        ],
        "system_utterance": [
            "What dates do you want the car?",
            "Where and at what time are you picking it up?",
            "There is a Standard Civic McCarran International Airport on March 6th.",
            "You want Standard Civic for pick up at McCarran International Airport on March 6th at 11 am on March 8th, correct?",
            "Your car is booked and the overall cost is $54.",
            "Search revealed 6 results. Best Western Plus Las Vegas West is rated at 3 stars.",
            "Budget Suites of America is rated 1 star.",
            "Search revealed 4 results. Hampton Inn Las Vegas/Summerlin is a 2 star place.",
            "What city do you want to eat in?",
            "Search revealed 10 results. 1760 serves burgers in San Francisco.",
            "You can find them at 1760 Polk Street and they have a 4.4 rating.",
            "B Star serves that and is in San Francisco.",
            "Have a great day."
        ]
    },
    {
        "dialogue_id": "16_00011",
        "service": "RentalCars_1",
        "service_call": {
            "method": {
                "method": "FindRestaurants",
                "parameters": {
                    "category": "American",
                    "has_seating_outdoors": "True",
                    "location": "Alameda",
                    "price_range": "moderate"
                }
            }
        },
        "user_utterance": [
            "I need a rental car in Sacramento, CA at 16:30.",
            "I need it starting the 9th and ending March 14th.",
            "What is the total cost?",
            "That is perfect. Please help me reserve this car.",
            "That is perfect.",
            "Thanks, I also need a hotel room there.",
            "Ok, find me a restaurant too.",
            "Alameda.",
            "I'm in the mood for diner food that is reasonably priced.",
            "Do they have vegetarian food? What is the rating?",
            "Ok cool, that is all I need."
        ],
        "system_utterance": [
            "On what day? When do you need the car until?",
            "I found a Camry, a standard car, available at SMF International Airport on March 9th.",
            "$150.",
            "Please confirm, picking up a standard car a SMF International Airport on March 9th at 4:30 pm. The car is due back on MArch 14th.",
            "Your car reservation is complete.",
            "Best Western Plus Sutter House is a popular choice with 1 star.",
            "In what city?",
            "What kind of food?",
            "I found 3 places like Alameda Cinema Grill in Alameda.",
            "They do not have vegetarian options. The rating is 4.1.",
            "Have a nice day."
        ]
    },
    {
        "dialogue_id": "16_00012",
        "service": "RentalCars_1",
        "service_call": {
            "method": {
                "method": "FindRestaurants",
                "parameters": {
                    "category": "Ethiopian",
                    "location": "San Francisco"
                }
            }
        },
        "user_utterance": [
            "I'm going to be needing a rental car. Set up a reservation for me please.",
            "a 09:30 pickup would be perfect.",
            "Let's check San Diego on the 10th.",
            "I will be needing the car until March 14th please.",
            "What would the cost be?",
            "I like this. Let's go ahead and make this reservation now.",
            "Yes, you got it right.",
            "I'll need a hotel room as well.",
            "Yes, that will do just fine.",
            "I'll also need to look up some restaurants too.",
            "Look up some Ethiopian restaurants in SF please.",
            "I'll roll with that."
        ],
        "system_utterance": [
            "Sure thing, what time will you need to pick up the rental.",
            "What date and location did you have in mind for a pick up?",
            "How long will you want the car until?",
            "There is a great Camry Standard car available on March 10th at SAN International Airport.",
            "Your reservation would be $140 total.",
            "Great, let's confirm your details. Your picking up a Standard vehicle on March 10th at SAN International Airport at 9:30 am. The return date is March 14th. Is that right?",
            "Great news, I was able to reserve your vehicle for you.",
            "Ok, I can recommend Bahia Resort Hotel, this has a 3 star rating.",
            "Will there be anything else I can assist with?",
            "What type of food are you interested in?",
            "Alright, I've located 3 restaurants in San Francisco, I would like to recommend Cafe Ethiopia.",
            "Great, have a wonderful day."
        ]
    },
    {
        "dialogue_id": "16_00013",
        "service": "RentalCars_1",
        "service_call": {
            "method": {
                "method": "FindRestaurants",
                "parameters": {
                    "category": "Halal",
                    "location": "Santa Clara",
                    "price_range": "moderate"
                }
            }
        },
        "user_utterance": [
            "I need to find a rental car please.",
            "I need to pick it up on March 9th.",
            "I need a small car on the 14th of this month from Kuala Lumpur at 13:30.",
            "That sounds good thanks.",
            "Yes I would like to reserve it.",
            "Yes that is correct.",
            "Thank you for your help.",
            "I also need a hotel.",
            "How much is it per night?",
            "I need something with one room. What else can you find?",
            "Sounds good I also need an economical restaurant that serves Halal.",
            "Find something in Santa Clara.",
            "Sounds good. That's all thanks."
        ],
        "system_utterance": [
            "Which date will you be picking it up?",
            "Which date will you be returning it? Where would you like to pick it up and at what time?",
            "There is a nice compact Cooper available on March 9th at KLIA International Airport.",
            "Do you want me to reserve it for you?",
            "You want to pick up a compact car at 1:30 pm on March 9th from KLIA International Airport and return it March 14th, correct?",
            "Your car is rreserved.",
            "Can I do anything else for you?",
            "I found 10 hotels, how about Alila Bangsar which is a 5 star?",
            "The room is $180 a night?",
            "Aloft Kuala Lumpur Sentral is a nice 4 star.",
            "Which located would you like me to search in?",
            "Paradise Biryani Pointe is a nice place in Santa Clara.",
            "Have a great day!"
        ]
    },
    {
        "dialogue_id": "16_00014",
        "service": "RentalCars_1",
        "service_call": {
            "method": {
                "method": "FindRestaurants",
                "parameters": {
                    "category": "Thai",
                    "has_vegetarian_options": "True",
                    "location": "San Francisco"
                }
            }
        },
        "user_utterance": [
            "I need a rental car on the 4th of March at 10:30 am please.",
            "I need to pick up in Vancouver, BC and will have it until the 7th of March.",
            "What else can you find? I need a compact to be picked up in Philly.",
            "What else can you find?",
            "Sounds good thanks.",
            "Yes please make the reservation.",
            "Yes that's correct. What is the total?",
            "I also need to find a hotel in the area.",
            "What is the address and phone number?",
            "Sounds good thanks.",
            "No I don't want to reserve a room right now. Can you find me restaurant in San Fran?",
            "Something Cambodian would be nice.",
            "Can you find something with vegetarian options?",
            "What is the phone number please?",
            "Okay great, that is all I needed."
        ],
        "system_utterance": [
            "What date will you return the car? where will you be picking it up?",
            "There is a nice standard accord available at YVR International Airport on march 4th.",
            "There is a nice compact cooper at Intercity Terminal on March 4th.",
            "There is a nice compact Fit at Intercity Terminal on March 4th.",
            "Do you want this car reserved?",
            "You want a compact car to be picked up at Intercity Terminal on March 4th at 10:30 am and returned March 7th, correct?",
            "Your car is reserved and the total is $60.",
            "I found 10, how about the 3 star hotel Aka University City?",
            "The address is Cira Centre South 2929 Walnut Street and the number is +1 215-372-9000.",
            "Would you like to make a reservation?",
            "What type of restaurant are you looking for?",
            "Baan Thai House & Wine Bar is a nice place in San Francisco.",
            "I found 9 restaurants you may enjoy. How about Basil in San Francisco?",
            "Their number is 415-552-8999.",
            "Have a great day!"
        ]
    },
    {
        "dialogue_id": "16_00015",
        "service": "RentalCars_1",
        "service_call": {
            "method": {
                "method": "FindRestaurants",
                "parameters": {
                    "category": "Asian",
                    "has_vegetarian_options": "True",
                    "location": "Concord",
                    "price_range": "cheap"
                }
            }
        },
        "user_utterance": [
            "Hi, can you help me find a rental car?",
            "I'd like to pick up the car on March 2nd until the 7th. I'd like to pick it up around 12:30.",
            "I'd like to pick up the car from Paris.",
            "What is the cost of the rental?",
            "That works for me.",
            "Yes, please book the reservation for me.",
            "Sounds good to me.",
            "I'd also like to find a hotel room there. Preferably a one star hotel.",
            "Is wifi available? What is the address for the hotel.",
            "That sounds fine. Can you find me a restaurant there?",
            "Please find me a restaurant in Concord that has vegetarian options. I'd like something that is cheap in price.",
            "I'm in the mood for some Oriental food.",
            "What's the address for the restaurant?",
            "That works great.",
            "No that's fine. That's all I needed."
        ],
        "system_utterance": [
            "On what date would you like to pick up the car and when will you need it until? At what time would you like to pick it up?",
            "Where would you like to pick it up from?",
            "I found 2 cars that might interest you. One is at Charles de Gaulle International Airport available on March 2nd. It is a Standard Accord.",
            "The rental will cost $165 in total.",
            "Would you like me to reserve the rental for you?",
            "So you will be picking up the Standard car from Charles de Gaulle International Airport on March 2nd at 12:30 pm until March 7th. Is this correct?",
            "Your rental car reservation has been booked.",
            "I managed to find 10 hotels that might interest you. There is Ac Hotel By Marriott Paris Porte Maillot. It is rated 1 star. Is this alright?",
            "You can find the hotel at 6 Rue Gustave Charpentier, 75017. There is no wifi offered.",
            "What location should I look for restaurants in?",
            "What cuisine would you like the restaurant to be?",
            "A nice restaurant is New Lim's Garden located in Concord.",
            "The restaurant's address is 4340 Clayton Road.",
            "Should I book you a reservation there?",
            "Have a wonderful day!"
        ]
    },
    {
        "dialogue_id": "16_00016",
        "service": "RentalCars_1",
        "service_call": {
            "method": {
                "method": "FindRestaurants",
                "parameters": {
                    "category": "Japanese",
                    "location": "San Francisco"
                }
            }
        },
        "user_utterance": [
            "I would like help finding a rental car.",
            "I want the car beginning Monday next week and will need it until next Friday. I would like to pick it up from New York City.",
            "I would like to pick it up about 12:30 pm.",
            "That sounds very good.",
            "Yes, I would like to rent this vehicle.",
            "Yes, that sounds accurate. What will the price be all told?",
            "Thanks very much for your help.",
            "I would like to find a room in a hotel there as well. I am interested in booking one room in a three star hotel and the hotel should have wifi.",
            "Yes, that sounds fine. I would also like to locate a restaurant in that area.",
            "I would like to find a restaurant in San Fran.",
            "I would like to find some place that serves Izakaya.",
            "Yes, that is very good.",
            "No, not right now.",
            "No, that's all. Thank you very much."
        ],
        "system_utterance": [
            "Until what date would you like this car? What day will you be picking it up? What is the location where you will pick it up?",
            "What time do you need to pick it up?",
            "I have found 7 cars that may interest you. There is a nice standard car that you can pick up at Grand Central Station on March 4th. This car is an Accord.",
            "Would you like to make a reservation for this car?",
            "Confirm these details for me if you would: You want to pick up a standard car on March 4th at 12:30 pm at Grand Central Station and drop it off on March 8th.",
            "Your reservation has been made. This reservation costs $116 total.",
            "Is there anything else you would like help with?",
            "I have located 10 hotels that meet your preferences. One nice 3 star hotel is 1 Hotel Brooklyn Bridge.",
            "What location do you want to me to look in?",
            "What type of food are interested in looking for?",
            "A nice restaurant that can be found in San Francisco is 2g Japanese Brasserie.",
            "Would you like to make a reservation at this restaurant?",
            "Is there anything else you would like help with?",
            "Have a wonderful day."
        ]
    },
    {
        "dialogue_id": "16_00017",
        "service": "RentalCars_1",
        "service_call": {
            "method": {
                "method": "FindRestaurants",
                "parameters": {
                    "category": "Moroccan",
                    "location": "San Francisco"
                }
            }
        },
        "user_utterance": [
            "Can you please help me find a rental car for an upcoming trip?",
            "I'll be traveling to Paris and will nee it when I get there.",
            "I'll be picking up the car around 6:30 in the evening on the 6th of this month.",
            "I'll be returning it on the 12th of March.",
            "How much money will it be?",
            "What other options are available?",
            "I like driving a Chevrolet Cruze. Please reserve this car.",
            "That is correct. How much is this going to be?",
            "Will you help me find a hotel room while in Paris?",
            "Can you give me the address of the hotel?",
            "Thank you. That sounds perfect.",
            "I don't want to reserve a room at the moment. Can you help me find a Moroccan restaurant in that area?",
            "I'm okay with any price range in SF.",
            "What other restaurants did you find?",
            "Do they have seating for outdoor dining? What is the rating of this place?",
            "Okay, great! That is all I need."
        ],
        "system_utterance": [
            "Where are you planning on picking up the car?",
            "What are days are you planning on using the rental? What time will you be picking it up?",
            "What date do you plan on returning the car?",
            "I've located 4 cars which may be of interest to you. There is a Honda Accord, classified as a standard car, available for pickup on March 6th at Charles de Gaulle International Airport.",
            "The total cost of the reservation will be $156.",
            "There is a standard class Cruze available for pickup on March 6th at Charles de Gaulle International Airport.",
            "Please confirm you want me to make a reservation to pickup a standard car from Charles de Gaulle International Airport. You will pick it up on March 6th at 6:30 pm and return the car on March 12th.",
            "Your reservation is now confirmed. The total cost will be $216.",
            "I've located a nice 4 star hotel named Ac Hotel By Marriott Paris Porte Maillot.",
            "They are located at 6 Rue Gustave Charpentier, 75017.",
            "Would you like me to make you a reservation at this hotel?",
            "Where would you like me to search for this restaurant?",
            "I've located 4 restaurants in San Francisco. El Mansour is a great restaurant which I think you would enjoy.",
            "Khamsa is a well rated restaurant in San Francisco.",
            "They have a user rating of 4.4 with a nice selection of outdoor seating.",
            "Talk to you soon."
        ]
    },
    {
        "dialogue_id": "16_00018",
        "service": "RentalCars_1",
        "service_call": {
            "method": {
                "method": "FindRestaurants",
                "parameters": {
                    "category": "Italian",
                    "location": "San Francisco"
                }
            }
        },
        "user_utterance": [
            "I want to find a rental car on the 10th till the 12th of March from Sacramento",
            "I need the car from Friday next week at two pm",
            "That's pretty good",
            "Yes, please do",
            "Yes, that's right",
            "Great, now find me a hotel room",
            "Yes, I like that",
            "No, not right now, but find me a restaurant",
            "Find a restaurant in SF that serves Pizza",
            "Yes, that's great!",
            "No, not right now",
            "No, that's all thanks"
        ],
        "system_utterance": [
            "What time do you need it?",
            "There's a nice standard Accord avaialble on March 8th from SMF International Airport",
            "Book it then?",
            "Confirming your standard car pickup from SMF International Airport at 2 pm on March 8th with a March 12th drop off",
            "Your car has been booked",
            "There's a 1 star Best Western Plus Sutter House you might like",
            "Do you want to book the room?",
            "What kind of food? What location?",
            "I found 10 places in San Francisco including 54 Mint Ristorante Italiano which I hear is nice",
            "Do you want me to book you a table?",
            "What else can I do to assist you?",
            "Thank you so much as well"
        ]
    },
    {
        "dialogue_id": "16_00019",
        "service": "RentalCars_1",
        "service_call": {
            "method": {
                "method": "FindRestaurants",
                "parameters": {
                    "category": "Korean",
                    "location": "Newark"
                }
            }
        },
        "user_utterance": [
            "I'd like to rent a car.",
            "I'd like to pick it up from Anaheim, CA next Wednesday and can return it on the 9th of this month.",
            "2 in the afternoon.",
            "How much?",
            "Sounds great.",
            "Yes please.",
            "Yes that works for me.",
            "Thanks. Can you help me find a hotel there too?",
            "What's their number.",
            "Okay. Can you find a restaurant in the area too?",
            "Korean Barbeque in Newark.",
            "Are there any vegetarian options?",
            "Okay, that will be all."
        ],
        "system_utterance": [
            "Tell me what dates you need the car and where you would like to pick it up.",
            "What time can you pick it up?",
            "How about a standard car like an accord available at John Wayne Airport on March 6th?",
            "It will cost $102.",
            "Would you like to reserve it?",
            "To confirm, you would like a standard car from March 6th to March 9th and you would like to pick it up from John Wayne Airport at 2 pm?",
            "Your reservation is confirmed.",
            "Anaheim Desert Inn and Suites is a nice 2 star hotel.",
            "+1 714-772-5050",
            "What kind of food and in what area?",
            "How about Cham Sae Bistro in Newark?",
            "No there are not any vegetarian options.",
            "Have a great day."
        ]
    },
    {
        "dialogue_id": "16_00020",
        "service": "RentalCars_1",
        "service_call": {
            "method": {
                "method": "FindRestaurants",
                "parameters": {
                    "category": "Tapas",
                    "location": "San Francisco",
                    "price_range": "pricey"
                }
            }
        },
        "user_utterance": [
            "I'd like a rental car.",
            "I want it from March 6th until the 8th.",
            "I'll pick it up in Vancouver, BC. I wanna pick it up at twelve in the afternoon.",
            "That's good. I'd like to reserve it.",
            "That's it. What will it cost?",
            "I'd also like a hotel room there.",
            "Does it have Wi-fI? How much is it per night?",
            "What else is there? I'd like a 2 star hotel.",
            "That's fine. I'd also like a restaurant.",
            "In SFO.",
            "I want food in small plates. I want a pricey restaurant.",
            "What's their number?",
            "Thanks That's all I need."
        ],
        "system_utterance": [
            "When do you want it? Until when will you have it?",
            "What time do you need it? Where will you pick it up?",
            "An Accord is available at YVR International Airport on March 6th. It's a standard car.",
            "Picking up a car from YVR International Airport on March 6th at 12 pm and dropping it off on March 8th. It's a standard car. Is this it?",
            "Your car is reserved. It will cost $70.",
            "I found 10 hotels for you. Atrium Inn Vancouver is a 3 star hotel.",
            "It costs $204 per night. It does not have Wi-Fi.",
            "Auberge Vancouver Hotel is a 2 star hotel.",
            "Where should I look for it in?",
            "What type of food do you want?",
            "Aatxe is in San Francisco.",
            "Their number is 415-471-2977.",
            "Have a nice day."
        ]
    },
    {
        "dialogue_id": "16_00021",
        "service": "RentalCars_1",
        "service_call": {
            "method": {
                "method": "FindRestaurants",
                "parameters": {
                    "category": "Breakfast",
                    "has_seating_outdoors": "True",
                    "location": "Palo Alto",
                    "price_range": "pricey"
                }
            }
        },
        "user_utterance": [
            "I'm looking for a rental car at 5 o\"clock in the evening until the 9th.",
            "I need it from the 3rd of this month until the 8th from Fresno.",
            "What's the cost?",
            "Sounds great. I want to reserve it.",
            "Yes, sounds great.",
            "Thanks. I want to find a hotel room.",
            "Any other hotels?",
            "That sounds great.",
            "No, not now.",
            "I want to find a restaurant.",
            "I want to find restaurants in Palo Alto.",
            "I want to find breakfast food.",
            "Any other restaurants? I want to find outdoor seating at a pricey restaurant.",
            "Yes, sounds good."
        ],
        "system_utterance": [
            "Where are you picking it up from and when?",
            "I have 6 cars. I found a standard Accord available at Fresno Station for pickup on March 3rd.",
            "The cost is $130.",
            "Please confirm: pickup up a standard car from Fresno Station from March 3rd 5 pm to March 8th.",
            "Your car has been booked.",
            "Doubletree By Hilton Hotel Fresno Convention Center is a 3 star hotel.",
            "La Quinta Inn by Wyndham Fresno Yosemite is a 2 star hotel.",
            "Do you want to book a room?",
            "Anything else I can do?",
            "What location are you looking in?",
            "What kind of food?",
            "Bistro Maxine is a restaurant in Palo Alto.",
            "I found 1 restaurant. Mayfield Bakery & Cafe is a restaurant in Palo Alto.",
            "Have a great day."
        ]
    },
    {
        "dialogue_id": "16_00022",
        "service": "RentalCars_1",
        "service_call": {
            "method": {
                "method": "FindRestaurants",
                "parameters": {
                    "category": "Mexican",
                    "location": "Vallejo",
                    "price_range": "moderate"
                }
            }
        },
        "user_utterance": [
            "Can you find me a rental car?",
            "I need the car next Friday and can pick it up from New York.",
            "Until the 11th of March.",
            "I can pick it up till 6 in the evening and need it till the 10th of March.",
            "I'd like to reserve it.",
            "That sounds good",
            "Can you find me 3 hotel rooms?",
            "That sounds good. Any good restaurants there?",
            "Search for Mexican food at an average priced restaurant in Vallejo.",
            "What's their rating?",
            "That will work.",
            "No thanks. That will be all."
        ],
        "system_utterance": [
            "When and where do you want to pick it up?",
            "Till what date?",
            "For what time?",
            "There's a standard car like an accord available at Grand Central Station on March 8th.",
            "So you would like to pickup a standard car at 6 pm at Grand Central Station and will need it from March 8th to March 10th?",
            "Your reservation has been made.",
            "I've found 10 hotels. There's a nice 4 star hotel called 1 Hotel Brooklyn Bridge.",
            "Where are you wanting to dine?",
            "Chevys Fresh Mex is a nice mexican spot in Vallejo.",
            "3.8",
            "Would you like to reserve a table?",
            "Have a great day."
        ]
    },
    {
        "dialogue_id": "16_00023",
        "service": "RentalCars_1",
        "service_call": {
            "method": {
                "method": "FindRestaurants",
                "parameters": {
                    "category": "Tapas",
                    "has_seating_outdoors": "True",
                    "location": "Burlingame"
                }
            }
        },
        "user_utterance": [
            "I have to rent a car please.",
            "I'd like it at 12:30 in Sacramento and I'll bring it back on the 14th of this month.",
            "On the 12th of this month.",
            "Great, can I reserve that?",
            "Okay, how much does that cost?",
            "Thanks. I also need a hotel room please.",
            "Okay, that works.",
            "No, that's okay. I need a restaurant though, someplace with outdoor tables.",
            "In Burlingame please.",
            "I want to find a Latin American place.",
            "Okay, that sounds great.",
            "No, that's okay.",
            "No, not today."
        ],
        "system_utterance": [
            "Where would you like to get the car and at what time? And when do you plan to return it?",
            "Pick up on what date?",
            "I've got a standard Corolla at Sacramento Valley Station on March 12th.",
            "Confirming rental of a standard vehicle from Sacramento Valley Station on March 12th at 12:30 pm until March 14th.",
            "It's a total of $60 and the car has been reserved.",
            "There are 10 hotels. How about Best Western Plus Sutter House? It's rated 1 star.",
            "Shall I book a room for you?",
            "In what city?",
            "And what kind of cuisine would you prefer?",
            "I have 1 Burlingame restaurant, Flights Restaurant Burlingame.",
            "Shall I book a table for you?",
            "Anything else you need today?",
            "Thank you very much."
        ]
    },
    {
        "dialogue_id": "16_00024",
        "service": "RentalCars_1",
        "service_call": {
            "method": {
                "method": "FindRestaurants",
                "parameters": {
                    "category": "American",
                    "location": "San Francisco"
                }
            }
        },
        "user_utterance": [
            "Can you find me a rental car on the 2nd of this month until the 9th of March?",
            "I need to pick it up from NY at 12 o\"clock in the afternoon.",
            "Sounds good thanks.",
            "Yes please make the reservation.",
            "Yes that is correct. What is the total?",
            "I also need a room.",
            "What is the phone number?",
            "Does it have wifi?",
            "Sounds good, please find a restaurant there as well.",
            "Barbecue in SFO please.",
            "Do they have vegetarian options?",
            "Okay that is fine thanks.",
            "No thanks that's all."
        ],
        "system_utterance": [
            "Where will you be picking it up and at what time?",
            "There is a standard Corolla at Grand Central Station for pickup on march 2nd.",
            "Do you want to reserve it?",
            "You want a standard from 12 pm on march 2nd to March 9th and will pick it up at Grand Central Station, correct?",
            "Your car is reserved and costs $203 total.",
            "I found 10 rooms. How about 1 Hotel Brooklyn Bridge which is a 4 star.",
            "Their number is +1 833-625-6111.",
            "Yes they have wifi.",
            "Where should I check? what type of food would you like?",
            "I found 10 you may like. How about 1760 in San Francisco?",
            "NO they do not.",
            "Can I do anything else for you?",
            "Okay have a great day."
        ]
    },
    {
        "dialogue_id": "16_00025",
        "service": "RentalCars_1",
        "service_call": {
            "method": {
                "method": "FindRestaurants",
                "parameters": {
                    "category": "Sushi",
                    "location": "Oakland"
                }
            }
        },
        "user_utterance": [
            "I need a rental car on Sunday this week at about 3:30 in the afternoon. I want to return it on the 9th of March.",
            "In Paris.",
            "What is the total cost?",
            "That is perfect, please help reserve this car.",
            "That will be good.",
            "I also need a 2 star hotel room there.",
            "That is good.",
            "No, not now. But I do want to find a restaurant there.",
            "Oakland.",
            "Sushi bar or Chinese food.",
            "Ok, thanks that is all I need."
        ],
        "system_utterance": [
            "Where do you need to pick it up?",
            "I found an Accord, a standard car, at Charles de Gaulle International Airport on March 3rd.",
            "Is it $198.",
            "Please confirm, picking up a standard car at Charles de Gaulle International Airport on March 3rd at 3:30 pm. The car is to be returned on March 9th.",
            "Your car is reserved.",
            "I found 10 hotels including Ac Hotel By Marriott Paris Porte Maillot. It has 2 stars.",
            "Are you ready to make a reservation?",
            "What location?",
            "What kind of food?",
            "I found 4 restaurants like Ginza | Japanese Sushi Restaurant in Oakland.",
            "Have a nice day."
        ]
    },
    {
        "dialogue_id": "16_00026",
        "service": "RentalCars_1",
        "service_call": {
            "method": {
                "method": "FindRestaurants",
                "parameters": {
                    "category": "Italian",
                    "location": "Benicia"
                }
            }
        },
        "user_utterance": [
            "Can you find a rental car for me?",
            "I would like to pick the car at around twelve in the afternoon and drop off the car on 13th of this month.",
            "I would like to pick up the car from Paris.",
            "I would like to pick up the car on 8th of March.",
            "Can you tell me the total cost?",
            "That sounds good to me. Can you help me in reserving this car for me?",
            "Yes, That is correct.",
            "Can you help me in finding a room in a hotel there?",
            "Can you confirm whether they have wifi and the contact number of the hotel?",
            "Okay, That sounds good to me.",
            "Can you help me in finding a restaurant in Benicia?",
            "Search for a restaurant which serves pizza.",
            "Okay, That sounds good. That will be all. Thank you!"
        ],
        "system_utterance": [
            "What would be the time of pick up and the drop off date?",
            "What is your desired place of pick up?",
            "What would be the date of pick up?",
            "There are 3 cars you may want to pick up. How about a standard Accord car available for pick up on March 8th at Orly International Airport?",
            "The total cost for the reservation is $175.",
            "Please confirm: You want me to reserve a standard car for pick up at 12 pm on March 8th from Orly International Airport. And the date of drop off is March 13th.",
            "I have successfully reserved the car for you.",
            "How about a 4 star hotel called Ac Hotel By Marriott Paris Porte Maillot?",
            "Sorry, They don't have wifi and the contact number is +33 1 84 82 49 09.",
            "Is there anything else I can help you with?",
            "What kind of food do you prefer?",
            "How about a nice restaurant called Palermos located in Benicia?",
            "I am glad I could help. Have a nice day!"
        ]
    },
    {
        "dialogue_id": "16_00027",
        "service": "RentalCars_1",
        "service_call": {
            "method": {
                "method": "FindRestaurants",
                "parameters": {
                    "category": "Greek",
                    "location": "San Francisco"
                }
            }
        },
        "user_utterance": [
            "Hi there, could you help me get a rental car please?",
            "On the March 5th please.",
            "I will be picking the car up at evening 4:30 from Phoenix, AZ.",
            "Till the 6th of March!",
            "Are there any alternatives?",
            "No thanks, anything else?",
            "How much will this cost me in total?",
            "I see, that is great!",
            "Could you make a booking for me?",
            "Sure, that is fine with me.",
            "Could you help me find two rooms at a one star hotel there too?",
            "How much will this cost me and how can I contact them?",
            "I see, are there any other hotels available?",
            "Sure, could you get me a place to eat a SFO too?",
            "Something which serves Greek is fine.",
            "Sure, I am fine with that!",
            "No, that is not necessary.",
            "No, that is not needed. Thank you so much!"
        ],
        "system_utterance": [
            "When will you need it?",
            "Where will you be picking up from and at what time?",
            "I see, and when will you need the car till?",
            "How about a Standard Accord available for pickup at Sky Harbor International Airport on March 5th?",
            "How about a Standard Camry available for pickup at Sky Harbor International Airport on March 5th?",
            "Sure, how about a Standard Prius available for pickup at Sky Harbor International Airport on March 5th?",
            "This will set you back a total of $33.",
            "Could I further assist you?",
            "Please confirm your booking for a Standard Car available for pickup at Sky Harbor International Airport on March 5th at 4:30 pm to March 6th.",
            "Your reservation has been made.",
            "There are 10 hotels which you may like, how about a 1 star hotel called Aloft Phoenix-Airport?",
            "This will cost you $216 each night and you can call them at +1 602-275-6300.",
            "How about a 1 star hotel called Arizona Grand Resort & Spa?",
            "Any food preferences?",
            "How about Ayola in San Francisco?",
            "Would you like me to make a reservation there?",
            "Sure, can I further assist you then?",
            "Sure, have a great day ahead!"
        ]
    },
    {
        "dialogue_id": "16_00028",
        "service": "RentalCars_1",
        "service_call": {
            "method": {
                "method": "FindRestaurants",
                "parameters": {
                    "category": "Indian",
                    "location": "Saratoga"
                }
            }
        },
        "user_utterance": [
            "I want to find a rental car from the 2nd of this month till the 5th of this month",
            "I want to pick it up around quarter to 2 in the afternoon",
            "I want it on March 1st in Paris",
            "What's that gonna cost?",
            "What else is available at 1:30 pm? I also need it till next Monday by the way",
            "That's good, reserve it",
            "Yes, how much will that cost?",
            "Nice, now find me 2 rooms in a hotel",
            "Yes that's great. Now find a restaurant for me",
            "Find me an Indian restaurant in Saratoga",
            "Do they have vegetarian food too?",
            "What's their address and price range?",
            "Yes, that's great, thanks for now"
        ],
        "system_utterance": [
            "What time do you need it?",
            "From where though?",
            "I found 4 including a standard Accord on March 1st at Charles de Gaulle International Airport",
            "It'll cost $132",
            "How about a standard Cruze car on March 1st from Charles de Gaulle International Airport",
            "Confirming your March 1st Standard car pickup at 1:30 pm with a drop off on March 4th at Charles de Gaulle International Airport",
            "It's booked and will cost you $90",
            "I found 10 hotels including a 4 star Ac Hotel By Marriott Paris Porte Maillot",
            "Where at? And what kind of food?",
            "I found 1 place in Saratoga called Bikaner Indian Cuisine",
            "Yes, they have a lot of options",
            "They're in the moderate price range and can be found at 12100 Saratoga Sunnyvale Road",
            "OK, just let me know if I can help"
        ]
    },
    {
        "dialogue_id": "16_00029",
        "service": "RentalCars_1",
        "service_call": {
            "method": {
                "method": "FindRestaurants",
                "parameters": {
                    "category": "Nepalese",
                    "location": "Sonoma"
                }
            }
        },
        "user_utterance": [
            "I will need a car soon. Can you find a rental car?",
            "I will need it until the 12th of March.",
            "i want a standard card to pick it up next Wednesday in Atlanta.",
            "I want ti pick it up at 1:30 pm.",
            "What is the cost of the car?",
            "What other cars are there?",
            "Yes, I need to get a car. Look for renting it until Thursday next week, it doesn't matter what type of car.",
            "That sounds great.",
            "Yes, please book it.",
            "That is correct. What is the cost of the car?",
            "I also want to know if there is any 1 star hotel in there.",
            "That sounds great.",
            "No, not right now. For now just find a restaurant in there.",
            "Look for something that sells Nepalese.",
            "Look for something in Sonoma.",
            "That sounds great.",
            "Not right now.",
            "Not right now."
        ],
        "system_utterance": [
            "Until when do you need it?",
            "Where do you want to pick it up? And when do you want to pick it up?",
            "At what time do you want to pick it up?",
            "There is a Standard Cruze car available for pickup at Hartsfield-Jackson International Airport on March 6th.",
            "It has a total cost of $216.",
            "Sorry, there are no other cars available. Is there anything I can help you with?",
            "There are 9 cars for you. There is a Compact Bolt car available for pickup at Hartsfield-Jackson International Airport on March 6th.",
            "Is there anything I can help you with?",
            "Please confirm: Booking a compact car from March 6th until March 7th. Available for pick up at Hartsfield-Jackson International Airport at 1:30 pm.",
            "The car has been booked. It has a total cost of $30.",
            "There are 10 possible hotels for you. There is Ac Hotel By Marriott Atlanta Buckhead At Phipps Plaza, it has a 1 star rating.",
            "Do you want to book a hotel room?",
            "What type of cuisine would you like?",
            "Where do you want to look for the restaurant?",
            "There is Taste Of The Himalayas in Sonoma.",
            "Do you want to book a table?",
            "Is there anything else I can help you with?",
            "Have a great day."
        ]
    },
    {
        "dialogue_id": "16_00030",
        "service": "RentalCars_1",
        "service_call": {
            "method": {
                "method": "FindRestaurants",
                "parameters": {
                    "category": "Italian",
                    "location": "Redwood City"
                }
            }
        },
        "user_utterance": [
            "Find me a rental car.",
            "I'd like to pick it up in Vancouver, BC around evening 4:30.",
            "From the 9th of March till March 12th.",
            "Any small cars?",
            "For how much?",
            "Do you have any intermediate cars from Paris?",
            "For how much?",
            "Sounds good.",
            "Yes please.",
            "That will work.",
            "Can you also find me a hotel room there?",
            "Any others?",
            "That one sounds better.",
            "No thanks.",
            "Can you also find me a restaurant in the area?",
            "Italian food in Redwood City.",
            "What's their rating? Are there any vegan options?",
            "Thanks. That will be all."
        ],
        "system_utterance": [
            "Where and when will you need it?",
            "For which days?",
            "There is a standard car like an accord available on March 9th at YVR International Airport.",
            "I have 5 compact cars. How about a bolt available on March 9th from YVR International Airport?",
            "$90",
            "There's a nice standard cruze for pick up on March 9th from Charles de Gaulle International Airport.",
            "$105",
            "Would you like to reserve it?",
            "So you would like the standard car for pickup at 4:30 pm on March 9th from Charles de Gaulle International Airport? The drop-off date will be March 12th.",
            "Your reservation has been made.",
            "The Ac Hotel By Marriott Paris Porte Maillot is a nice 4 star hotel.",
            "Amastan Paris is also 4 stars.",
            "Would you like to book a room?",
            "Anything else I can help with?",
            "For which area? What type of cuisine?",
            "I've found 5 in Redwood City. How about Chantilly?",
            "Their rating is 4.2. And yes they have good vegetarian options.",
            "Have a great day."
        ]
    },
    {
        "dialogue_id": "16_00031",
        "service": "RentalCars_1",
        "service_call": {
            "method": {
                "method": "FindRestaurants",
                "parameters": {
                    "category": "Chinese",
                    "location": "Pinole"
                }
            }
        },
        "user_utterance": [
            "I'd like to look for a rental vehicle.",
            "I require the vehicle from the 1st to the Friday next week, and would like to pick it up around 12:00.",
            "I'd like to pick up the vehicle from Portland.",
            "That's perfect for me.",
            "Yeah, I'd like to make the booking.",
            "Yeah, that's correct. How much is it?",
            "Thank you for your assistance, but I'd like to look for a hotel room nearby.",
            "Is there some other hotel I may enjoy? I'd like one room that has wifi.",
            "Yeah, that's fine with me.",
            "Nah, I do not wish to book a spot. I want to look for a diner nearby",
            "Get diners from Pinole.",
            "Get me a diner that offers Cantonese.",
            "Yeah, that's perfect. That's all."
        ],
        "system_utterance": [
            "Until what day do you desire the vehicle for, and when?",
            "What location would you like to pick up the vehicle from?",
            "There is a lovely standard Corolla vehicle available at Union Station for pickup on March 1st.",
            "Do you wish to book this vehicle?",
            "Please verify the following information: you are picking up a standard vehicle fro Union Station on MArch 1st, 12 pm, with the drop-off day at MArch 8th.",
            "The vehicle booking is complete. Your booking price is $189.",
            "I discovered 10 hotels catering to your tastes. There is a 3 star hotel called Aloft Portland Airport At Cascade Station.",
            "There is a lovely 2 star hotel called Best Western Plus Portland Airport Hotel & Suites.",
            "Do you wish to book a spot at the hotel?",
            "What place ought I look in?",
            "What type of cuisine are yu searching for?",
            "There is a lovely diner called China Delights in Pinole.",
            "Have a pleasant afternoon."
        ]
    },
    {
        "dialogue_id": "16_00032",
        "service": "RentalCars_1",
        "service_call": {
            "method": {
                "method": "FindRestaurants",
                "parameters": {
                    "category": "Nicaraguan",
                    "has_vegetarian_options": "True",
                    "location": "Concord"
                }
            }
        },
        "user_utterance": [
            "I would like to find a rental car. I need it from March 3rd, and I prefer intermediate cars. I would like it from Delhi, India.",
            "I want to pick it up at around 15:30 on Wednesday next week.",
            "Is there anything else?",
            "What is the total price?",
            "That sounds great.",
            "I need to reserve this car then.",
            "Yes, that sounds great.",
            "I would also like one hotel room.",
            "How much will it cost? And what is the address?",
            "Are there any other hotels? I need two rooms.",
            "Are there any other hotels I might like? I want a 3 star hotel.",
            "Yes, that sounds wonderful.",
            "No, I don't want it. I want a restaurant there and I need vegetarian options, please.",
            "I need Nicaraguan restaurants in Concord.",
            "What is their contact number and address?",
            "Yes, that sounds good.",
            "No, that's all. Thank you."
        ],
        "system_utterance": [
            "At which time would you like it? Until which date would you like it?",
            "There is a nice vehicle available for pickup at Indira Gandhi International Airport on March 3rd. This is a Standard Accord.",
            "There is another nice car available from Indira Gandhi International Airport for pickup on March 3rd. This is a Standard Elantra.",
            "Your reservation will cost $105 in total.",
            "Is there anything else that I may help you with?",
            "Please confirm the following information: Picking up this Standard car from Indira Gandhi International Airport on March 3rd at 3:30 PM. The designated drop off date is March 6th. Is this correct?",
            "Your car has now been reserved.",
            "Aloft New Delhi Aerocity is a nice 4 star hotel.",
            "Their address is 5B Igi T3 Road, Delhi - Ajmer Expressway, Aerocity, New Delhi. The room price is $176 per night.",
            "There are 9 hotels which match your selection. Andaz Delhi - A Concept By Hyatt is a nice hotel, and is a 5 star hotel.",
            "Bloomrooms @ New Delhi Railway Station is a wonderful hotel. It is a 3 star hotel.",
            "Would you like to make a reservation now?",
            "Do you have a preference of type of food? In which location should I search?",
            "There is 1 restaurant which matches your selection. La Fritanguera is a nice restaurant and is located in Concord.",
            "Their reception desk number is 925-446-6141 and their street address is 1819 Colfax Street.",
            "Is there anything else that I may help you with?",
            "Of course. Have a wonderful day."
        ]
    },
    {
        "dialogue_id": "16_00033",
        "service": "RentalCars_1",
        "service_call": {
            "method": {
                "method": "FindRestaurants",
                "parameters": {
                    "category": "Japanese",
                    "location": "Berkeley"
                }
            }
        },
        "user_utterance": [
            "Hi there, could you get me a rental car for use this Sunday at 10:30 am?",
            "In New Delhi, please.",
            "Most likely on the 5th of March.",
            "How much will this cost me?",
            "Are there any alternatives?",
            "How much will this cost me?",
            "Are there any alternatives?",
            "Sure! Could you make a booking please?",
            "Sure, how much will this cost me?",
            "I see, could you also get me a hotel room there?",
            "No thanks, any other hotels available?",
            "How much will this set me back?",
            "I see, could you find me some Izakaya food in that area too?",
            "A restaurant in Berkeley is fine.",
            "Sure! That is all I need, thank you!"
        ],
        "system_utterance": [
            "Sure, where will you be picking up the car from?",
            "And when will you be using the car till?",
            "I see, there are 3 available cars, how about a Standard Accord for pickup at Indira Gandhi International Airport on March 3rd?",
            "You will need to pay $64.",
            "Sure, how about a Standard Elantra for pickup at Indira Gandhi International Airport on March 3rd?",
            "This will cost you $72 in total.",
            "Sure, how about a Standard Fusion for pickup at Indira Gandhi International Airport on March 3rd?",
            "Sure, please confirm your booking for a Standard car for pickup at Indira Gandhi International Airport on March 3rd at 10:30 am till the March 5th.",
            "Your reservation has been made, which will cost you $62 in total.",
            "How about a 4 star hotel called Aloft New Delhi Aerocity?",
            "How about a 5 star hotel called Andaz Delhi - A Concept By Hyatt?",
            "Around $320 per night.",
            "Sure, where will you want to dine in?",
            "How about Iyasare in Berkeley?",
            "Have a great day ahead!"
        ]
    },
    {
        "dialogue_id": "16_00034",
        "service": "RentalCars_1",
        "service_call": {
            "method": {
                "method": "FindRestaurants",
                "parameters": {
                    "category": "Brunch",
                    "location": "San Francisco"
                }
            }
        },
        "user_utterance": [
            "I want a rental car for the 1st of march at 13:30 till the 2nd of march.",
            "In Seattle, WA.",
            "How much would that cost?",
            "That is really good.",
            "Yes, I do.",
            "That would be great.",
            "Thanks very much.",
            "I would need 2 rooms at a 1 star hotel that has wifi when I get there.",
            "May I have a contact number and I would like to know how much a night would cost.",
            "Is there anything else available?",
            "Ok. I will go there. I will need a restaurant when I get there.",
            "Somewhere in SF.",
            "breakfast & brunch.",
            "That would be great. That's all I need."
        ],
        "system_utterance": [
            "Where would you like to pick it up?",
            "There is a Standard civic available for pick up at seattle-tacoma international airport on March 1st.",
            "It would cost $33 in all.",
            "You want to reserve the car?",
            "You want to pick up at standard car at seattle-tacoma international airport from march 1st at 1:30 pm to march 2nd?",
            "I have reserved the car for you.",
            "Would you need anything else?",
            "Ace hotel seattle is a lovely 1 star hotel.",
            "It is $210 for a night and the number is +1 206-448-4721.",
            "Belltown inn is a lovely 1 star hotel.",
            "At which location?",
            "What sort of food?",
            "There are 10 such restaurants in San Francisco. You should try out 1300 on fillmore.",
            "Enjoy your day."
        ]
    },
    {
        "dialogue_id": "16_00035",
        "service": "RentalCars_1",
        "service_call": {
            "method": {
                "method": "FindRestaurants",
                "parameters": {
                    "category": "Italian",
                    "location": "Livermore"
                }
            }
        },
        "user_utterance": [
            "I need a medium-sized rental car on March 4th.",
            "LAX.",
            "I want to pick it up at 11:15 in the morning. I'll drop it off on the 7th of March.",
            "What is the total cost?",
            "Anything else? I need to pick the car up at 3:30 pm.",
            "Anything else?",
            "Please reserve me this car.",
            "Yes, that is good. What is the total cost?",
            "I also need a hotel room there.",
            "Anything else? I need 1 room and a hotel that has fast wifi.",
            "Yes, that will be good.",
            "No, but I do want to find a restaurant there. Look in Livermore for a Pizza and Pasta place.",
            "Ok, that is all."
        ],
        "system_utterance": [
            "Where do you want to pick it up at?",
            "What time? And what day are you returning the car?",
            "I found a standard car, Like a Civic, at Union Station on March 4th.",
            "$87.",
            "I found a car at LAX International Airport on March 4th. It is a standard car, like a Camry.",
            "I found a standard car, like a Corolla, available at LAX International Airport on March 4th.",
            "Please confirm, picking up a standard car on March 4th at 3:30 pm at LAX International Airport. It is due back on March 7th.",
            "Your car has been reserved. The total cost is $105.",
            "The Ac Hotel By Marriott Beverly Hills is a nice 2 star hotel.",
            "Airtel Plaza Hotel is a 3 star hotel.",
            "Are you ready to reserve a room?",
            "I found 4 options, like Campo Di Bocce of Livermore in Livermore.",
            "Goodbye."
        ]
    },
    {
        "dialogue_id": "16_00036",
        "service": "RentalCars_1",
        "service_call": {
            "method": {
                "method": "FindRestaurants",
                "parameters": {
                    "category": "Japanese",
                    "location": "South San Francisco"
                }
            }
        },
        "user_utterance": [
            "I would need a large rental car on March 8th in Phoenix, AZ.",
            "I would want it for 12:30 pm.",
            "Till the 9th of this month.",
            "How much would it cost?",
            "Ok, cool. I want to rent the car.",
            "That would be great.",
            "Thank you. I would need 1 room at a hotel that has wifi.",
            "How much does it cost a night?",
            "Is there any 1 star hotel that I might like?",
            "What is their contact number?",
            "When I get there, I would need a japanese joint to take a bite.",
            "In south san francisco.",
            "Yes, that would be fine.",
            "No, thanks. That would be all."
        ],
        "system_utterance": [
            "For what time?",
            "Till what date would you like to keep the car?",
            "There is a lovely full-size rav4 available for pick up at sky harbor international airport on March 8th.",
            "That would be $41 in all.",
            "You would like pick up a full-size car at sky harbor international airport at march 8th at 12:30 pm and drop it off on March 9th?",
            "I have reserved the car.",
            "Aloft phoenix-airport is a nice 3 star hotel.",
            "It costs $99 a night.",
            "Arizona grand resort & spa is a lovely 1 star hotel.",
            "It is +1 602-426-2638.",
            "In which area?",
            "There are 3 restaurants you might like in south san francisco. Amami san is a lovely choice.",
            "You would like to reserve a table.",
            "Enjoy your day."
        ]
    },
    {
        "dialogue_id": "16_00037",
        "service": "RentalCars_1",
        "service_call": {
            "method": {
                "method": "FindRestaurants",
                "parameters": {
                    "category": "Tapas",
                    "location": "San Mateo"
                }
            }
        },
        "user_utterance": [
            "Hey, I need a rental car.",
            "I need it around 9 o\"clock in the morning.",
            "I need it actually later today, and until the 4th.",
            "I want it from New York city.",
            "Okay, but what's the total price?",
            "That sounds great. I would like to reserve it.",
            "Yes, that sounds good.",
            "I need to find a hotel room there. I want it with wifi and I need one room.",
            "Okay, that sounds awesome.",
            "Um, no now right now.",
            "I need to find a restaurant with Tapas.",
            "I'm in San Mateo right now.",
            "Okay, that's fine. Thank you."
        ],
        "system_utterance": [
            "At which time will you be needing it?",
            "When would you like it? Until which date?",
            "Where would you like to pick it up from?",
            "There is a nice car available at Port Authority Station for pickup on March 1st. It is a Standard car, and is an Altima.",
            "Your reservation will cost $72 in total.",
            "Please confirm the following details: You are picking it up this car from Port Authority Station. The date of pickup is March 1st. The designated time of pickup is 9 AM. The designated drop off date is March 4th. This is a Standard car.",
            "Your car has now been reserved.",
            "I have found 10 hotels which match your requirements. There is 1 Hotel Brooklyn Bridge and it is a nice 4 star hotel.",
            "Would you like to book a room now?",
            "Is there anything else that I may help you with?",
            "In which city would you like to search in?",
            "Amour Amour is a recommendation, located in San Mateo.",
            "Have a wonderful day."
        ]
    },
    {
        "dialogue_id": "16_00038",
        "service": "RentalCars_1",
        "service_call": {
            "method": {
                "method": "FindRestaurants",
                "parameters": {
                    "category": "Italian",
                    "location": "Palo Alto"
                }
            }
        },
        "user_utterance": [
            "I want to find a rental car from Next Wednesday till March 8th please",
            "I want to pick it up at 6:30 pm in Fremont",
            "Is there anything else?",
            "How much is that gonna cost?",
            "Is there anything else? How about a compact car in Paris?",
            "What's that gonna cost?",
            "Great, now reserve it for me please",
            "Yes that's right",
            "Thanks for that",
            "Yes, actually I need one room at a 3 star hotel",
            "How much does it cost a night?",
            "Does the hotel have wifi?",
            "OK, that's good. I also want to find a restaurant there please",
            "How about some Pizza and Pasta",
            "Palo Alto is pretty nice I hear",
            "Do they have outdoor seating there?",
            "OK, that's still fine",
            "No, for now we're OK."
        ],
        "system_utterance": [
            "What time do you need it? And where do you want to pick it up from?",
            "Great, there's a nice Standard Accord car on March 6th at Fremont BART Station",
            "How about a standard Altima also on March 6th at Fremont BART Station",
            "It'll be $72 in total",
            "There's a compact Bolt that you can pickup on March 6th from Charles de Gaulle International Airport",
            "It'll be $60 in total",
            "Confirming your compact car pickup at 6:30 pm on March 6th till March 8th from Charles de Gaulle International Airport",
            "It's been reserved for you",
            "Can I do something else?",
            "How about a 3 star hotel like the Ac Hotel By Marriott Paris POrte Maillot",
            "It'll be $80 a night",
            "They don't have wifi",
            "What kind of food are we talking?",
            "What area do you want to eat at?",
            "What about a Buca Di Beppo Italian Restaurant in Palo Alto",
            "No they don't",
            "Would you like to book a table then?",
            "OK, take care then"
        ]
    },
    {
        "dialogue_id": "16_00039",
        "service": "RentalCars_1",
        "service_call": {
            "method": {
                "method": "FindRestaurants",
                "parameters": {
                    "category": "Chinese",
                    "location": "San Jose",
                    "price_range": "moderate"
                }
            }
        },
        "user_utterance": [
            "I need a rental car in NY at 9:30 am",
            "I need it from the 12th to the 14th of this month.",
            "What else did you find?",
            "How much will it be?",
            "I need a large car. What else did you find?",
            "Sounds good. Please reserve it.",
            "Sounds good thank you. What is the total?",
            "I also need to find a room there.",
            "What is the phone number>",
            "Sounds good thank yo.",
            "No not right now. I need to find an average priced restaurant.",
            "Noodles please, in San Jose.",
            "What is the rating? Do they have vegetarian options?",
            "Sounds good that's all I need."
        ],
        "system_utterance": [
            "When will you pick it up and return it?",
            "I found 6 cars. There is a standard Altima at Port Authority Station on march 12th.",
            "There is a Standard Elantra on March 12th at Port Authority Station.",
            "The reservation is $64.",
            "There is a nice full-size Equinox at Port Authority Station on March 12th.",
            "You want to pick up a full-size at Port Authority Station on March 12th at 9:30 am till March 14th.",
            "Your car is reserved and is $86.",
            "1 Hotel Brooklyn Bridge is a nice 4 star.",
            "Their number is +1 833-625-6111.",
            "Would you like to reserve a room?",
            "What type of food and in which location?",
            "Chef Li is nice and located in San Jose.",
            "They do have nice vegetarian options and are rated 4.3.",
            "Have a great day!"
        ]
    },
    {
        "dialogue_id": "16_00040",
        "service": "RentalCars_1",
        "service_call": {
            "method": {
                "method": "FindRestaurants",
                "parameters": {
                    "category": "Seafood",
                    "location": "Berkeley"
                }
            }
        },
        "user_utterance": [
            "Could you please help me to find a rental car?",
            "I want to have the car up to the 11th. I need it from Thursday next week.",
            "I want to have the car up to 12th of this month. I need it in Portland and I am okay with any type.",
            "Ihas to pick up me around 18:00",
            "Please search some other options. I need a Compact car from 8th of March.",
            "What is the total price?",
            "Please search some other options.",
            "What is the total price?",
            "It is good.",
            "I wish to reserve this car.",
            "It is good.",
            "Thank you so much. I wish to book one room in a two star hotel there.",
            "It is good.",
            "No. I am not interested.",
            "I am searching for a restaurant there. Find something which serves Fish. I am okay with any price range.",
            "Search restaurants in Berkeley.",
            "It is good.",
            "No. Thank you so much. That is what I want."
        ],
        "system_utterance": [
            "When will you need it? Up to which date do you need the car?",
            "In which place do you want to get picked up?",
            "When will you need it?",
            "I searched and found 10 cars for you. There is a nice Standard Accord car available at Portland Bus Station on March 7th.",
            "There is a nice Compact Cooper car available at PDX International Airport on March 8th.",
            "Your car has been booked. The cost of reservation is $112.",
            "There is a nice Compact Forte car available at Portland Bus Station on March 8th.",
            "The cost of reservation is $88.",
            "Do you need any other help?",
            "Kindly ensure that, on March 8th, a Compact car is available from Portland Bus Station at 6 pm. The drop off date is march 13th. The drop off date is March 12th.",
            "Your car has been booked.",
            "Aloft Portland Airport At Cascade Station is a fantastic hotel with 2 star.",
            "Shall I book the room?",
            "Do you need any other help?",
            "In which place shall I search in?",
            "Akemi Japanese Restaurant is a fantastic restaurant in Berkeley.",
            "Shall I reserve a table?",
            "Have a fantastic day."
        ]
    },
    {
        "dialogue_id": "16_00041",
        "service": "RentalCars_1",
        "service_call": {
            "method": {
                "method": "FindRestaurants",
                "parameters": {
                    "category": "Brunch",
                    "has_vegetarian_options": "True",
                    "location": "Napa"
                }
            }
        },
        "user_utterance": [
            "Hey, can you find me a rental car?",
            "At around afternoon 3, thanks.",
            "I want it from the 4th of this month to the 9th of this month in Sacramento, CA.",
            "Sounds good, thanks.",
            "Yes I would, thanks.",
            "Yes, that's correct.",
            "Thanks a lot.",
            "Can you get me 1 hotel room with wifi there too?",
            "Where is it?",
            "Sounds great, thanks.",
            "No thanks. Can you find me a restaurant there? I'd like a light meal with vegetarian options.",
            "In Napa, thanks.",
            "What's their phone number?",
            "Thanks. What's their user rating? Do they have outdoor seating?",
            "Thanks a lot, that'll be all."
        ],
        "system_utterance": [
            "Sure, for what time?",
            "Okay, where and when will you pick it up? When do you need it until?",
            "Okay, there's a standard Accord at SMF International Airport on March 4th.",
            "Would you like to reserve it?",
            "Okay, please confirm that you'd like to rent a standard car from SMF International Airport from 3 pm on March 4th to March 9th.",
            "Okay, your car has been reserved.",
            "Is there anything else?",
            "Sure, I found 10 places. How about the 1 star Best Western Plus Sutter House?",
            "It's at 1100 H Street.",
            "Should I reserve the hotel for you?",
            "Okay, in what location?",
            "Fume is a good choice for you in Napa.",
            "You can call them on 707-257-1999.",
            "They're rated 4.4, and yes, they do have outdoor seating.",
            "Okay, see you."
        ]
    },
    {
        "dialogue_id": "16_00042",
        "service": "RentalCars_1",
        "service_call": {
            "method": {
                "method": "FindRestaurants",
                "parameters": {
                    "category": "American",
                    "location": "Redwood City"
                }
            }
        },
        "user_utterance": [
            "I want to go out for a small work for which I need to book a car for rent. Can you help me to find the one for me?",
            "Book it from 6th of this month to 7th of this month and arrange for the pickup time at half past 12 in the afternoon.",
            "Need to pick it up from Anaheim and search for the one at this place.",
            "I want to know the cost for this ride to decide.",
            "Okay. Search for some other cars.",
            "This looks perfect for me. Can you help me to reserve this car now?",
            "That is correct. Go ahead.",
            "Thanks for it and I want to book one room in a two star hotel with wifi. Please search for the one for me.",
            "Yes, I think this will be the suitable one for me.",
            "No, not now. Thanks.",
            "Yes, search for some nice restaurants.",
            "Search it in Redwood City.",
            "Something like American food.",
            "Yes, that is great and thanks. That's all for now."
        ],
        "system_utterance": [
            "Yes, I can help. Let me know your convenient date and time to book the car and also to which date you need to book it?",
            "What is your present location that you want to book the car for pickup from that place?",
            "How about a Standard Accord Car which is available for the pickup at John Wayne Airport on March 6th? I think this is the best one among the 6 cars that I have searched for you.",
            "It will be $27 for this ride in total.",
            "What about another Car Which is a Standard Altima Car available for pickup at John Wayne Airport on March 6th?",
            "Yes, I need your final confirmation to reserve a Standard car for pickup from John Wayne Airport on March 6th at 12:30 pm to the drop-off date on March 7th.",
            "I have successfully reserved the required car.",
            "What about a hotel name Anaheim Desert Inn And Suites with 2 stars? and this is the best one among the 10 hotels searched by me.",
            "Shall I reserve the room now?",
            "Anything else you need?",
            "In which place?",
            "What is your favorite food?",
            "What about the restaurant name Aly's On Main in Redwood City.",
            "Have a great day."
        ]
    },
    {
        "dialogue_id": "16_00043",
        "service": "Hotels_1",
        "service_call": {
            "method": {
                "method": "FindAttractions",
                "parameters": {
                    "category": "Shopping Area",
                    "good_for_kids": "True",
                    "location": "Sydney"
                }
            }
        },
        "user_utterance": [
            "I need to find a room at a four star hotel in Sydney, Australia.",
            "Anything else? I need three rooms.",
            "Anything else I might like?",
            "Okay that one sounds good.",
            "Yeah, can you help me with that?",
            "I want to check in Sunday this week and stay for three days.",
            "Actually I want to check on on the 1st.",
            "Yeah that sounds good.",
            "What's the cost per night?",
            "Thanks. What attractions are around there? I'm looking for a shopping district that's good for kids.",
            "Perfect, that's all for now."
        ],
        "system_utterance": [
            "I found 10 hotels you might like. Hohw about 28 Hotel Sydney? It's a nice 4 star hotel.",
            "I found 9 other hotels matching your query. How bout 57 Hotel? It is a nice 4 star hotel.",
            "Sure, what about Adina Apartment Hotel Bondi Beach Sydney? It is another 4 star hotel.",
            "Do you want to reserve a room there?",
            "When do you want to check and, and how long will you be staying?",
            "Alright, so you would like to book 3 rooms for 3 days at Adina Apartment Hotel Bondi Beach Sydney, located in Sydney, checking on on March 3rd. Is that correct?",
            "Okay, so you want to reserve rooms at Adina Apartment Hotel Bondi Beach Sydney and check in March 1st, is that right?",
            "Your rooms were successfully booked.",
            "It is $444 per night.",
            "You could go to Bondi Markets, which is a shopping area.",
            "Okay, enjoy your trip!"
        ]
    },
    {
        "dialogue_id": "16_00044",
        "service": "Hotels_1",
        "service_call": {
            "method": {
                "method": "FindAttractions",
                "parameters": {
                    "category": "Performing Arts Venue",
                    "good_for_kids": "True",
                    "location": "New York"
                }
            }
        },
        "user_utterance": [
            "I'm taking a trip soon and need a place to stay. Can you search for hotels for me?",
            "Find me hotels in NY please.",
            "Anything else in the area?",
            "Interesting. What's the address?",
            "How much are the rooms per night? What's the phone number?",
            "Okay, now that sounds good.",
            "Yeah, go ahead and book a room for me. I need one room and will be staying for only one day.",
            "I'd like to check in on the 13th.",
            "Yes, that all sounds correct.",
            "Thank you! Do you know if they have wifi?",
            "Alright, thank you very much. Do you know of any child-friendly attractions I could take my kids to?",
            "Is it free to enter?",
            "Okay, cool. Is there a nice performance venue around town?",
            "Okay, that sounds great. I appreciate your help.",
            "No, that's it for today. Appreciate the help, thanks again."
        ],
        "system_utterance": [
            "Sure thing. Which city would you like to conduct the search?",
            "There is a nice 4 star hotel in the area. It's called the 1 Hotel Brooklyn Bridge.",
            "There is an excellent 5 star hotel in the area called the 1 Hotel Central Park.",
            "They are located at 1414 6th Avenue.",
            "The rooms will cost you $340 a night. Their number is +1 212-703-2001.",
            "Would you like to make a reservation today?",
            "Okay, what day are you checking in?",
            "No problem, just confirm the following for me: Reserving 1 room at the 1 Hotel Central Park in New York on March 13th. Your total stay will be for 1 day. Correct?",
            "Your reservation was a success. Enjoy your stay!",
            "Yes, they absolutely have wifi.",
            "Yes, there are 10 attractions that I think you would like. How about a Museum? The American Folk Art Museum is very popular.",
            "Sorry but entrance is not free.",
            "You should check out the Apollo Theater. I hear it's a very popular Performing Arts Venue in the area.",
            "Anything else I can help you with today?",
            "My pleasure. Enjoy your stay."
        ]
    },
    {
        "dialogue_id": "16_00045",
        "service": "Hotels_1",
        "service_call": {
            "method": {
                "method": "FindAttractions",
                "parameters": {
                    "location": "New York"
                }
            }
        },
        "user_utterance": [
            "I'm taking a trip, please reserve a one star hotel for me.",
            "I'd like to stay at a place in NYC.",
            "Okay, that works for me.",
            "Yes, please reserve 2 rooms for me for one day.",
            "I'd like to check in this Sunday.",
            "Yes that is correct. Please tell me the address of this hotel and whether or not it has wifi.",
            "Please search for attractions in the area.",
            "That sounds interesting, thank you.",
            "No, that's all."
        ],
        "system_utterance": [
            "Okay, in which city would you like to reserve this hotel?",
            "There are 10 results that match your criteria. How about the 1 star hotel called 1 Hotel Brooklyn Bridge?",
            "Would you like to book a room there?",
            "Okay, when would you like to check in to the hotel?",
            "Please verify the following details are correct. You would like to reserve 2 rooms for 1 day at the 1 Hotel Brooklyn Bridge in New York. The check in date for these rooms is March 3rd. Is this correct?",
            "The rooms have been successfully reserved. This hotel is located at 60 Furman Street, Brooklyn and the hotel is equipped with wifi.",
            "Okay, how about 92nd Street Y? It's a Performing Arts Venue in the area.",
            "Do you require any further assistance?",
            "Have a nice day."
        ]
    },
    {
        "dialogue_id": "16_00046",
        "service": "Hotels_1",
        "service_call": {
            "method": {
                "method": "FindAttractions",
                "parameters": {
                    "category": "Museum",
                    "location": "New York"
                }
            }
        },
        "user_utterance": [
            "A week off is music to my ears. For starters, would you help me get a hotel room with a bit of a view?",
            "Check out New York City for me, please.",
            "Oh, yeah? What is it's wifi status and nightly rate?",
            "Good deal. I could go for that.",
            "I'm ready. Let's go for two rooms at that hotel.",
            "One day is all I want.",
            "I'll probably arrive on March 10th.",
            "I am. That's perfect.",
            "Wonderful. Now, what are some interesting sights I could check out there, maybe a Museum?",
            "Yeah? Is it free to enter?",
            "Okay, that's cool.",
            "I guess that's all I need for now. Thanks a lot."
        ],
        "system_utterance": [
            "Happy to help. What's the city you want for your hotel visit?",
            "Okay. The 1 Hotel Brooklyn Bridge hotel could be a nice experience, at 4 stars.",
            "The hotel does have wifi and the nightly rate is $240.",
            "Are you ready to set up a hotel reservation?",
            "All right, and how long for your stay?",
            "Got it, and when do you plan on checking in there?",
            "Okay, setting that up now. Are you confirming a room reservation for 2 guests at the 1 Hotel Brooklyn Bridge in New York, arriving on March 10th for a 1 day stay?",
            "Your hotel reservation is confirmed.",
            "If you want to check out a Museum, the American Folk Art Museum could be fun.",
            "Nope, this museum does charge an entry fee.",
            "Do you need more information?",
            "Have an awesome day."
        ]
    },
    {
        "dialogue_id": "16_00047",
        "service": "Hotels_1",
        "service_call": {
            "method": {
                "method": "FindAttractions",
                "parameters": {
                    "category": "Museum",
                    "free_entry": "True",
                    "good_for_kids": "True",
                    "location": "New York"
                }
            }
        },
        "user_utterance": [
            "I'm taking a trip down to NYC. I'm wondering if you could help me find a hotel room in the area?",
            "Maybe. Do they have wifi by chance? Also, what's the address?",
            "Okay, thanks that sounds good.",
            "Yeah, lets go ahead and make the reservation now. I need to book a room for 3 days.",
            "I want to check in on the 4th.",
            "Yeah, that's right. Can you tell me how much the room will cost me? I need the phone number as well.",
            "Cool, thanks. I'll be looking for something to do while I'm out there. Can you find me any cool child-friendly attractions in the area? I'd really like to visit a nice Museum.",
            "Sounds interesting. Any other attractions in the area?",
            "Okay, that sounds awesome.",
            "No, that is all I need for now. Thanks a lot."
        ],
        "system_utterance": [
            "No problem. I've found 10 hotels for you. How about the 1 Hotel Brooklyn Bridge? It's a nice 4 star rated hotel.",
            "Yes, they do offer wifi. They are located at 60 Furman Street, Brooklyn.",
            "Would you like to book a room there?",
            "Okay, what day will you be checking in?",
            "Alright, I just need you to confirm the following for me. Booking 1 room at the 1 Hotel Brooklyn Bridge in New york on March 4th. You will be reserving the room for 3 days. Is this right?",
            "Your reservation has been completed. As for the cost, the room will be $280 a night and their number is +1 833-625-6111.",
            "I've found 10 attractions that may interest you. If your looking for a nice Museum, then I think you should check out the American Museum of Natural History.",
            "Another nice Museum that's child-friendly would be the Brooklyn Children's Museum.",
            "Anything else I can help you with today?",
            "My pleasure. Enjoy your stay!"
        ]
    },
    {
        "dialogue_id": "16_00048",
        "service": "Hotels_1",
        "service_call": {
            "method": {
                "method": "FindAttractions",
                "parameters": {
                    "free_entry": "True",
                    "location": "Kuala Lumpur"
                }
            }
        },
        "user_utterance": [
            "I'm looking for a hotel room?",
            "It should be in KL.",
            "Is there wifi there?",
            "How much is a room per night?",
            "Okay, that can work. Please book me 1 room for two days with a check in on the 9th.",
            "Everything is correct. Where are they located, like the address?",
            "And what's a number I can call them at?",
            "Thanks a lot. Now I also want to look for attractions there. I don't have anything particular in mind. But I do want it to be free.",
            "Is it good for children?",
            "Okay, nice. That's all I need, talk to you later."
        ],
        "system_utterance": [
            "What city do you want it to be in?",
            "Alila Bangsar is a nice 5 star hotel.",
            "There is no wifi, sorry.",
            "It is $180 for a room per night.",
            "I'll book you 1 room for 2 days at the Alila Bangsar in Kuala Lumpur for a check in on March 9th. Is that all correct?",
            "I've booked the room. They are located on East Side, 58, Jalan Ang Seng, Brickfields, 50470.",
            "You can call them at +60 3-2268 3888.",
            "There are 7 attractions that you might like. There's a Park called 99 Wonderland Park you can visit.",
            "Yes, children would like it.",
            "Have fun!"
        ]
    },
    {
        "dialogue_id": "16_00049",
        "service": "Hotels_1",
        "service_call": {
            "method": {
                "method": "FindAttractions",
                "parameters": {
                    "category": "Park",
                    "good_for_kids": "True",
                    "location": "San Diego"
                }
            }
        },
        "user_utterance": [
            "I'd like to look for a room in a hotel. I want a 1 room in a 1 star hotel located in SD.",
            "What is its price per night?",
            "Can you tell me their contact number and location?",
            "Yeah, that's perfect for me.",
            "I'd like to make the reservation for 1 day with a check in on the 7th of March.",
            "Nope. I'd like to have the room for three days with the check-in day on 2nd of this month.",
            "Yeah, that's fine with me.",
            "Does the hotel offer wifi?",
            "Thank you for your assistance. Could you tell me about nearby attractions? I'm searching for a child-friendly garden.",
            "Does the park offer free entry?",
            "Can you tell me their contact number?",
            "Alright, do you have some other attraction that you can recall?",
            "Alright, that's lovely.",
            "Nah. Thank you for your assistance."
        ],
        "system_utterance": [
            "I discovered 10 hotels suitable to your prerequisites. There is a lovely 1 star hotel called Bahia Resort Hotel.",
            "The room price is $96 per night.",
            "The contact number is +1 858-539-8666, and their location is 998 West Mission Bay Drive.",
            "Do you wish to book a spot at the hotel?",
            "Please verify the following information; you'd like to book 1 room for 1 day at the Bahia Resort Hotel in San Diego on March 7th.",
            "Please verify the following information: a booking for 3 days to check in on March 2nd.",
            "Your booking is complete.",
            "The hotel does offer wifi.",
            "I discovered 5 attractions that may intrigue you. I recommend visiting the park known as Balboa Park.",
            "Nope, the entrance to the park is not free.",
            "Their contact number is 619-239-0512.",
            "I recommend going to the park called Cabrillo National Monument.",
            "Is there something else I could help you with?",
            "Have fun there!"
        ]
    },
    {
        "dialogue_id": "16_00050",
        "service": "Hotels_1",
        "service_call": {
            "method": {
                "method": "FindAttractions",
                "parameters": {
                    "location": "New York"
                }
            }
        },
        "user_utterance": [
            "I need a room in a hotel",
            "I need a hotel in New York",
            "How much does it cost to stay overnight at this hotel?",
            "Ok, It's fine for me!",
            "Yes, I want to book now",
            "I need it from Sunday this week, for three days",
            "Yes, It's correct. Thanks.",
            "What is the hotel phone number?",
            "Thanks. Can I get the address? Is wifi available in the hotel?",
            "Thanks a lot. Are there any fun attractions there?",
            "Yes, It's fine for me! Thanks, It's all for now!"
        ],
        "system_utterance": [
            "In which city?",
            "I found 1 Hotel Brooklyn Bridge, a 4 star hotel",
            "The overnight at this hotel costs $240",
            "Do you want to book a room here?",
            "Starting when do you need the room? For how many days?",
            "1 room at 1 Hotel Brooklyn Bridge in New York, from March 3rd for 3 days. Is it correct?",
            "Your reservation is confirmed",
            "The phone number is +1 833-625-6111",
            "Yes, It's available. The address is 60 Furman Street, Brooklyn",
            "I found 10 attractions. For example there's a Performing Arts Venue, 92nd Street Y.",
            "Have a nice day!"
        ]
    },
    {
        "dialogue_id": "16_00051",
        "service": "Hotels_1",
        "service_call": {
            "method": {
                "method": "FindAttractions",
                "parameters": {
                    "category": "Museum",
                    "free_entry": "True",
                    "good_for_kids": "True",
                    "location": "London"
                }
            }
        },
        "user_utterance": [
            "I want a hotel room in London.",
            "Does it have Wi-Fi?",
            "How much would it cost me?",
            "What else is there? I need one room. I just want a one star hotel.",
            "What else is there?",
            "That's fine. I'd like a reservation.",
            "I'll be staying for one day. I'll check in on March 4th.",
            "Yes. What's their number? Where are they?",
            "What attractions are there? I don't want an entry fee. I want a museum that is child-friendly.",
            "That's good. That's all for now."
        ],
        "system_utterance": [
            "45 Park Lane is a 5 star hotel.",
            "There is no Wi-Fi.",
            "It will cost $230 per night.",
            "Abc Hyde Park Hotel is a 1 star hotel.",
            "Abercorn House is a 1 star hotel.",
            "When will you be checking in? How many days will you be there?",
            "A reservation for 1 at Abercorn House on March 4th in London for 1 day. Is this right?",
            "Your reservation has been made. Their number is +44 20 8563 8692. The address is 28-30 Bute Gardens.",
            "Apsley House is a museum.",
            "Have a nice day."
        ]
    },
    {
        "dialogue_id": "16_00052",
        "service": "Hotels_1",
        "service_call": {
            "method": {
                "method": "FindAttractions",
                "parameters": {
                    "category": "Park",
                    "good_for_kids": "True",
                    "location": "San Diego"
                }
            }
        },
        "user_utterance": [
            "I will be travelling soon and need to find a place to stay. Find some hotels please.",
            "Find something in SD.",
            "What is the address of the hotel? How much does it cost per night?",
            "Sure, that one sounds good.",
            "Yeas, please book it. For Monday next week and jut for 1 day.",
            "That is correct. What is their phone number? Does it have wifi?",
            "What other things to do are in htere? Is there any child-friendly garden to visit?",
            "What other places are there?",
            "Sounds great, that would be all for now."
        ],
        "system_utterance": [
            "Where do you want to look for?",
            "There is Bahia Resort Hotel, it has a 3 star rating.",
            "The address is 998 West Mission Bay Drive and it has a cost of $96 per night.",
            "Do you want to book a room?",
            "Please confirm: Booking 1 hotel room at Bahia Resort Hotel for 1 day on MArch 4th in San Diego.",
            "The reservation has been completed. The hotel does have wifi and their phone numbre is +1 858-539-8666.",
            "There is a park you might like, the Balboa Park.",
            "There is another park for you, the Cabrillo National Monument.",
            "Have a great day."
        ]
    },
    {
        "dialogue_id": "16_00053",
        "service": "Hotels_1",
        "service_call": {
            "method": {
                "method": "FindAttractions",
                "parameters": {
                    "good_for_kids": "True",
                    "location": "New York"
                }
            }
        },
        "user_utterance": [
            "Find 1 hotel room.",
            "New York.",
            "Great, book it.",
            "1 day starting the 2nd of this month.",
            "Yes. Phone number?",
            "Thank you. Find nearby attractions that are kid friendly, any sort.",
            "Is it free?",
            "Thanks, that's everything."
        ],
        "system_utterance": [
            "City?",
            "1 Hotel Brooklyn Bridge is rated 4 stars.",
            "Check in date and duration of stay?",
            "Please confirm: 1 night in 1 room at 1 Hotel Brooklyn Bridge in New York on March 2nd.",
            "You're booked. It's +1 833-625-6111.",
            "I found 10 matches. Try American Folk Art Museum, it's a museum good for kids.",
            "It's not.",
            "Enjoy!"
        ]
    },
    {
        "dialogue_id": "16_00054",
        "service": "Hotels_1",
        "service_call": {
            "method": {
                "method": "FindAttractions",
                "parameters": {
                    "location": "Paris"
                }
            }
        },
        "user_utterance": [
            "I'm taking a trip, please reserve a hotel room for me.",
            "I'd like to reserve a room in Paris, France.",
            "That looks good to me.",
            "Yes, please reserve me a room.",
            "I would like to reserve a room Friday next week and I only want the room for one day.",
            "Yes, that is correct.",
            "Please find some attractions for me to visit while I am there.",
            "Thank you, that's all for now."
        ],
        "system_utterance": [
            "Okay, in which city would you like to reserve a hotel room?",
            "I've found a 4 star hotel called Ac Hotel By Marriott Paris Porte Maillot. How does this sound?",
            "Would you like to book a room at this hotel?",
            "When would you like to start your reservation, and how long would you like to reserve a room for?",
            "Please verify the following details are correct. You would like to reserve 1 room for 1 day on March 8th at the Ac Hotel By Marriott Paris Porte Maillot. This hotel is located in Paris. Is this correct?",
            "Your reservation has been created successfully.",
            "Okay. I've found a result called the American Church in Paris. This attraction is a Place of Worship.",
            "Have a nice day."
        ]
    },
    {
        "dialogue_id": "16_00055",
        "service": "Hotels_1",
        "service_call": {
            "method": {
                "method": "FindAttractions",
                "parameters": {
                    "location": "New York"
                }
            }
        },
        "user_utterance": [
            "I'd like to find a room at a 1 star hotel in London, England. Can you help me?",
            "Do they have wifi?",
            "Anything else? I need a hotel in NYC.",
            "How much is it per night?",
            "That sounds good.",
            "Yes, please book me a room.",
            "I will be checking in on the 10th and need the room for 1 day.",
            "Yes, that's right.",
            "Can you find me some local attractions?",
            "What's the phone number?",
            "Okay, great. That's all I need for now. Goodbye."
        ],
        "system_utterance": [
            "How about 45 Park Lane? It is a nice 1 star hotel.",
            "No, the hotel does not have wifi.",
            "I found 10 hotels that might suit you. How about the 1 Hotel Brooklyn Bridge? It is a nice 1 star hotel.",
            "The room is $240 per night.",
            "Would you like to make a reservation?",
            "Can you tell me the following: Your check in date and the number of days you will be staying.",
            "Please confirm the following: I am booking a room for 1 at the 1 Hotel Brooklyn Bridge in New York. You reservation will be for March 10th and will be for 1 day. Is this correct?",
            "I have successfully booked your reservation.",
            "You might want to check out 92nd Street Y. It is a Performing Arts Venue.",
            "They can be reached at (212) 415-5788.",
            "Enjoy!"
        ]
    },
    {
        "dialogue_id": "16_00056",
        "service": "Hotels_1",
        "service_call": {
            "method": {
                "method": "FindAttractions",
                "parameters": {
                    "category": "Place of Worship",
                    "location": "Delhi"
                }
            }
        },
        "user_utterance": [
            "I'm looking for a two star hotel room in Delhi.",
            "Is there a wifi in that hotel? What is the hotel's address?",
            "Is there any other hotels with 3 star.",
            "Sounds great. I will make a reservation on two rooms for one day on the 12th.",
            "Great.",
            "May I have the phone number?",
            "Thanks a lot. Could you show me some good attractions there?",
            "Great. Is there any other attractions there?",
            "Any other attractions? I prefer religious spot.",
            "May I have their phone number? Is it a child-friendly place?",
            "Sounds good. That would be all."
        ],
        "system_utterance": [
            "There are 10 hotels that match your needs. The Aloft New Delhi Aerocity is a 2 start hotel.",
            "There is no wifi in that hotel. It is located at 5B Igi T3 Road, Delhi - Ajmer Expressway, Aerocity, New Delhi.",
            "The Andaz Delhi - A Concept By Hyatt is a 3 star hotel.",
            "Please verify the details. The hote name is Andaz Delhi - A Concept By Hyatt, on March 12th for 1 day. The hotel is located in Delhi, 2 rooms for reservation.",
            "The reservation is successful.",
            "The phone number is+ +91 11 4903 1234",
            "Please check the Adventure Island, a Theme Park.",
            "Please check the Akshardham, a Place of Worship.",
            "You may also like the other 5 attractions there, the Jama Masjid, a Place of Worship.",
            "Yes, the kids will love the place. Here's the phone number, 11 2326 8344",
            "Okay. Have fun!"
        ]
    },
    {
        "dialogue_id": "16_00057",
        "service": "Hotels_1",
        "service_call": {
            "method": {
                "method": "FindAttractions",
                "parameters": {
                    "good_for_kids": "True",
                    "location": "Paris"
                }
            }
        },
        "user_utterance": [
            "Can you find me a hotel room?",
            "Find me a hotel room in Paris",
            "That sounds like a good hotel. Can you reserve a room for me?",
            "I'll be there for just one day.",
            "I'll be checking in on the 1st of March.",
            "Hold on. I think I may need the room for two days.",
            "Yes, that's correct. Do they offer WiFi?",
            "Thank you very much. Can you show me some attractions that are child-friendly in Paris?",
            "Thank you for that suggestion. That's all I need for now."
        ],
        "system_utterance": [
            "In which city are you trying to find the hotel room?",
            "There are 10 hotels that match your requirements. Among these, Ac Hotel By Marriott Paris Porte Maillot is a nice 4 star hotel.",
            "For how many days are you planning to stay at the hotel?",
            "When do you plan to check in?",
            "Reserving 1 room at the Ac Hotel By Marriott Paris Porte Maillot in Paris for 1 day from March 1st. Shall I proceed?",
            "Okay. So you would like to book a room at Ac Hotel By Marriott Paris Porte Maillot for 2 days. Is that correct?",
            "Your room has been booked successfully. Sorry, but they do not offer WiFi.",
            "If you are interested in a Place of Worship, you should check out the American Church in Paris.",
            "Have a great day!"
        ]
    },
    {
        "dialogue_id": "16_00058",
        "service": "Hotels_1",
        "service_call": {
            "method": {
                "method": "FindAttractions",
                "parameters": {
                    "category": "Museum",
                    "good_for_kids": "True",
                    "location": "London"
                }
            }
        },
        "user_utterance": [
            "Hello. Can you book a hotel room for me?",
            "Make it in London, UK.",
            "Sounds good. I want to book a room there.",
            "For 3 days, starting Monday next week.",
            "That is correct.",
            "Great. What's the address and phone number?",
            "Good to know. Can you find me a child-friendly museum around those parts?",
            "Okay, good to know.",
            "No, that'll be all for now. You were a great help, thank you."
        ],
        "system_utterance": [
            "Sure thing. What city?",
            "There's a 5 star hotel called 45 Park Lane.",
            "For how long?",
            "Sure. You want to stay at 1 room 45 Park Lane in London for 3 days starting March 4th?",
            "I booked the room for you.",
            "Their address is 45 Park Lane, and their phone number is +44 20 7493 4545.",
            "Sure. I found 10 of those. One good museum in the area is Apsley House.",
            "Can I assist you with anything else?",
            "Enjoy your day!"
        ]
    },
    {
        "dialogue_id": "16_00059",
        "service": "Hotels_1",
        "service_call": {
            "method": {
                "method": "FindAttractions",
                "parameters": {
                    "free_entry": "True",
                    "good_for_kids": "True",
                    "location": "Toronto"
                }
            }
        },
        "user_utterance": [
            "I want to find 1 room in a hotel which is in Toronto.",
            "Is there some other hotel you can recommed?",
            "Can you tell me how much does it cost per night, and if the hotel provides wifi?",
            "Yes that is what I want. I want to make a reservation at this hotel.",
            "I will be staying at the room for 1 day, and I will go at the hotel on 5th of this month.",
            "That is not right, because I changed my plans, so I need the room for four days.",
            "Yes that is what I want. Can you give me their address?",
            "I appreciate it very much. Can you find me some attractions there? I am interested in attractions which have a free of charge entrance, and that welcomes children.",
            "Alright, good. That would be all, good bye for now!"
        ],
        "system_utterance": [
            "There are 10 hotels which you might like staying in. How would you like to stay at Best Western Plus Toronto North York Hotel & Suites, which is a 3 star hotel.",
            "Another good 3 star hotel is Best Western Premier Toronto Airport Carlingview Hotel.",
            "Booking a room at this hotel will cost you $150. Unfortunately the hotel does not have wifi.",
            "Can you tell me when will you be going there, and how many days you plan to stay?",
            "Can you please confirm that you want to book 1 room for 1 day at the Best Western Premier Toronto Airport Carlingview Hotel in Toronto for March 5th?",
            "Can you please confirm that you want to book a room for 4 days at the hotel for March 5th?",
            "Your requested reservation has been made. The address of the hotel is 135 Carlingview Drive, Etobicoke, Ontario M9W 5E7, Canada.",
            "There are 10 attractions which you might like. How would you consider visiting BAPS Shri Swaminarayan Mandir, which is a Place of Worship?",
            "Have a good time!"
        ]
    },
    {
        "dialogue_id": "16_00060",
        "service": "Hotels_1",
        "service_call": {
            "method": {
                "method": "FindAttractions",
                "parameters": {
                    "category": "Museum",
                    "free_entry": "True",
                    "good_for_kids": "True",
                    "location": "Chicago"
                }
            }
        },
        "user_utterance": [
            "I'm looking for a hotel room. I want one room somewhere in Chicago.",
            "I like the sound of that. I want to book a room there.",
            "I want to check in Friday next week and stay for 3 days.",
            "Yes, that's correct.",
            "What the cost for a night there?",
            "Thanks a lot. I'm also looking for attractions to visit there that's free. I'd prefer a Museum that is suitable for children.",
            "Sounds nice. Okay, that's all I need. I'll talk to you later."
        ],
        "system_utterance": [
            "There's a nice 3 star hotel called Ac Hotel By Marriott Chicago Downtown.",
            "When do you want to check in and how long will you be staying for?",
            "I'll make you a reservation for 1 room at Ac Hotel By Marriott Chicago Downtown in Chicago for 3 days with a check in of March 8th. Is that correct?",
            "I've made the reservation for you.",
            "It costs $204 for a night.",
            "What do you think of Chicago History Museum? It's a Museum",
            "Have fun!"
        ]
    },
    {
        "dialogue_id": "16_00061",
        "service": "Hotels_1",
        "service_call": {
            "method": {
                "method": "FindAttractions",
                "parameters": {
                    "category": "Nature Preserve",
                    "location": "Vancouver"
                }
            }
        },
        "user_utterance": [
            "I need one room in a hotel",
            "I need a hotel in Vancouver, BC",
            "Where is the hotel? Is wifi available?",
            "Ok, this hotel is fine.",
            "Yes, I want to reserve a room.",
            "Only one day.",
            "The arrival day is the 12th",
            "No, I need the room for 4 days, from Thursday next week",
            "Yes, It's correct.",
            "Thanks! I'm looking for a wildlife spot attractions.",
            "Is this place child-friendly? What's theri contact number?",
            "Very good! Thanks a lot!",
            "No, It's all. Thanks for helping"
        ],
        "system_utterance": [
            "In which city?",
            "There's the 3 star hotel Atrium Inn Vancouver",
            "The hotel is in 2889 East Hastings Street. No, wifi isn't available",
            "Do you want to book a room here?",
            "How many days will you stay in the hotel?",
            "What is the arrival day?",
            "1 room at Atrium Inn Vancouver, in Vancouver, on March 12th for 1 day. Do you confirm?",
            "A room froma March 7th for 4 days. Is it correct?",
            "Your reservation is confirmed!",
            "I found 1 attraction, a Nature Preserve: Vancouver Aquarium",
            "Yes, it's nice for your kids! The contact number is 604-659-3502",
            "Can I do anything else for you?",
            "Have a good time!"
        ]
    },
    {
        "dialogue_id": "16_00062",
        "service": "Hotels_1",
        "service_call": {
            "method": {
                "method": "FindAttractions",
                "parameters": {
                    "location": "London"
                }
            }
        },
        "user_utterance": [
            "can you find me a hotel room?",
            "can you look in london, england?",
            "that works for me.",
            "yes, can you book it?",
            "i want to get there on the 11th of this month.",
            "i'll just be there for 1 day.",
            "that's fine with me. do they have wifi?",
            "where's it at?",
            "thanks, can you show me some cool places around there too?",
            "are there any other attractions?",
            "is it free to get in?",
            "is it a child-friendly place?",
            "okay thanks, that's all."
        ],
        "system_utterance": [
            "where should i look?",
            "i found 10 places for you. there's a 5 star hotel called 45 park lane.",
            "do you want to book it?",
            "when do you want to check in?",
            "how many days will you be staying.",
            "so you want a reservation for 1 room for 1 day at 45 park lane on march 11th in london?",
            "it's been booked. the hotel doesn't have wifi, unfortunately.",
            "the hotel is over on 45 park lane.",
            "there's a historical landmark there called 30 st mary axe (the gherkin).",
            "there's also a performing arts venue there called the alexandra palace.",
            "no, it's not free.",
            "yes, it's kid-friendly.",
            "have a great day."
        ]
    },
    {
        "dialogue_id": "16_00063",
        "service": "Hotels_1",
        "service_call": {
            "method": {
                "method": "FindAttractions",
                "parameters": {
                    "location": "Chicago"
                }
            }
        },
        "user_utterance": [
            "I need three hotel rooms.",
            "Check out Chi-town.",
            "Looks pretty good.",
            "Yes. For three day beginning on the 8th of this month.",
            "You got it. Where exactly are they?",
            "Excellent. What is there to see around there?",
            "Is that place free? How can I talk with them?",
            "Alright! I'm going to invite everyone and tell them its on me!",
            "No. I'm good to go."
        ],
        "system_utterance": [
            "Where do you need them?",
            "I see 10 there. There's AC Hotel BY Marriott Chicago Downtown. They have 3 stars.",
            "Should I secure the rooms?",
            "OK. 3 rooms for 3 days at AC Hotel BY Marriott Chicago Downtown in Chicago on March 8th. Do I have that correct.",
            "630 North Rush Street. Your rooms are reserved.",
            "If you want a tourist attraction, I got 10. Try 360 Chicago.",
            "Call 888-875-8439. It is indeed free.",
            "Very ingenious. Do you need anything else?",
            "Enjoy yourself."
        ]
    },
    {
        "dialogue_id": "16_00064",
        "service": "Hotels_1",
        "service_call": {
            "method": {
                "method": "FindAttractions",
                "parameters": {
                    "location": "London"
                }
            }
        },
        "user_utterance": [
            "Find hotel rooms.",
            "London.",
            "Perfect.",
            "Yeah, two for 1 night on March 2nd.",
            "Correct.",
            "Thanks, find nearby attractions.",
            "Great.",
            "No, that was helpful."
        ],
        "system_utterance": [
            "Which city?",
            "45 Park Lane is rated 5 stars.",
            "Do you want a room?",
            "Please confirm: 2 rooms for 1 night at 45 Park Lane in London on March 2nd.",
            "You're booked.",
            "I found 10 things nearby to do. 30 St Mary Axe (The Gherkin) is a historical landmark.",
            "Anything else for today?",
            "Enjoy!"
        ]
    },
    {
        "dialogue_id": "16_00065",
        "service": "Hotels_1",
        "service_call": {
            "method": {
                "method": "FindAttractions",
                "parameters": {
                    "location": "New York"
                }
            }
        },
        "user_utterance": [
            "Can you help me find a hotel room that offers wifi?",
            "I will be traveling to NY.",
            "Can you tell me what the average room rate is and where it is located?",
            "That will work for me.",
            "Yes, please make me a reservation for one room.",
            "I'll be checking in today for 2 nights.",
            "Yes, that's correct. What is the contact number there?",
            "Great. Can you tell me about some interesting things to do in that area?",
            "Perfect. Thank you.",
            "No, that will be all. Thank you again."
        ],
        "system_utterance": [
            "I'd be happy to. Where will you be staying?",
            "There are 10 hotels you may like. May I suggest the 4 star 1 Hotel Brooklyn Bridge?",
            "The hotel is located at 60 Furman Street, Brooklyn and rooms go for $240 per night.",
            "Do you want to make a reservation?",
            "How many nights will you be staying?",
            "You'd like 1 room at 1 Hotel Brooklyn Bridge in New York for March 1st for 2 days. Is this correct?",
            "You may reach them at +1 833-625-6111. Your reservation has been confirmed.",
            "I found 10 options that you may like. 92nd Street Y is a popular Performing Arts Venue.",
            "Is there anything else I can help you with today?",
            "My pleasure. Enjoy the rest of your day."
        ]
    },
    {
        "dialogue_id": "16_00066",
        "service": "Hotels_1",
        "service_call": {
            "method": {
                "method": "FindAttractions",
                "parameters": {
                    "category": "Performing Arts Venue",
                    "good_for_kids": "True",
                    "location": "London"
                }
            }
        },
        "user_utterance": [
            "Alright, so I'm going to London, England and I need some help finding a one star hotel. Can you help me out please?",
            "Yes, I believe that would do. Can we get a reservation please. I really don't want to get stuck there with no room.",
            "I just need the room for one day. I'll be staying until the 4th of March.",
            "Yes, you sure do.",
            "Awesome, While we are doing this, can you help show me some attractions in that area? I would prefer some kid friendly performance venue type attractions please.",
            "sounds fun. I was just curious. That will be all. Good bye."
        ],
        "system_utterance": [
            "I sure can. I found a 1 star rated hotel. 45 Park Lane is a great place.",
            "Yes, let's book your room now. I need to know what day would you like to check and for how many days do you plan to stay?",
            "Alight I understand. Please confirm we are reserving 1 room at 45 Park Lane in London for 1 night. The check in date will be March 4th. Do I have the details correct?",
            "Wonderful news, I was able to complete this booking for you!",
            "Great, give me one moment. I found a Performing Arts Venue called Alexandra Palace. How does this sound?",
            "Ok, Enjoy your day. Good bye."
        ]
    },
    {
        "dialogue_id": "16_00067",
        "service": "Hotels_1",
        "service_call": {
            "method": {
                "method": "FindAttractions",
                "parameters": {
                    "category": "Park",
                    "location": "Vancouver"
                }
            }
        },
        "user_utterance": [
            "Find me a hotel room.",
            "Get me a hotel in Vancouver, BC.",
            "Is wifi included?",
            "Try to find a two star hotel for me.",
            "What else do you have?",
            "What is their physical location?",
            "Tahat works for me.",
            "Yes, book me a room.",
            "I am arriving Wednesday next week and will be there for 1 day.",
            "That is right. Is wifi available?",
            "Thanks a lot. Find me a Park near there.",
            "How can I contact them?",
            "That is good.",
            "No, that is all. Thanks."
        ],
        "system_utterance": [
            "What city do you want one in?",
            "Search revealed 10 results. Atrium Inn Vancouver is rated at 3 stars.",
            "There is no wifi.",
            "Search revealed 9 results. Auberge Vancouver Hotel is rated 2 stars.",
            "Best Western Plus Chateau Granville Hotel & Suites & Conference Ctr. is rated at 2 stars.",
            "You can find them at 1100 Granville Street.",
            "Do you want to book a room?",
            "What day are you arriving and how long are you staying?",
            "You want a ticket for 1 person for 1 night at on March 6th at Best Western Plus Chateau Granville Hotel & Suites & Conference Ctr. in Vancouver. Is that right?",
            "Your booking is complete, but wifi is not available.",
            "Search revealed 5 results. Bloedel Conservatory is a Park.",
            "You can contact them at 604-257-8584.",
            "Do you need more help?",
            "Have fun!"
        ]
    },
    {
        "dialogue_id": "16_00068",
        "service": "Hotels_1",
        "service_call": {
            "method": {
                "method": "FindAttractions",
                "parameters": {
                    "location": "San Francisco"
                }
            }
        },
        "user_utterance": [
            "I would like to find a hotel room.",
            "I would like to find one in San Francisco.",
            "Sounds good to me.",
            "Yes, please make me a booking.",
            "I would like the room for 1 day starting today.",
            "Sounds good to me. How much is it per night and is there wifi?",
            "Thank you, and could you find me some attractions?",
            "Is entrance to this place free? Is it child friendly?",
            "Sounds good to me.",
            "No, that was good. Thanks."
        ],
        "system_utterance": [
            "What city do I need to look in?",
            "I have 10 hotels that match. Amsterdam hostel San Francisco is a nice 1 star hotel.",
            "Would you like to make a hotel reservation?",
            "When will you check in and for how many days?",
            "Could you confirm that you want to stay at Amsterdam Hostel San Francisco on March 1st for 1 day in San Francisco? You are booking 1 room.",
            "Your reservation was successfully made and was $117. It has wifi.",
            "There are 10 attractions. What about the Historical Landmark in Alcatraz?",
            "No, entry to this place doesn't cost anything and it is not good for kids.",
            "What else could I help with?",
            "Enjoy your time!"
        ]
    },
    {
        "dialogue_id": "16_00069",
        "service": "Hotels_1",
        "service_call": {
            "method": {
                "method": "FindAttractions",
                "parameters": {
                    "category": "Park",
                    "location": "Delhi"
                }
            }
        },
        "user_utterance": [
            "I need 3 rooms in a one star hotel, can you check for me?",
            "Actually I need a two star. Check in New Delhi please.",
            "Yes that is perfect thanks.",
            "Yes please reserve the rooms.",
            "I need one day and will be checking in next Friday.",
            "No make it 4 days and check in will be on March 10th.",
            "Yes that is correct.",
            "Can you find me some attractions? Perhaps a garden?",
            "Sounds nice, what else can you find?",
            "How much is the entrance fee? What is the phone number?",
            "Great, that is all I need for now thanks."
        ],
        "system_utterance": [
            "Which city should I look in?",
            "Aloft New Delhi Aerocity is a nice 2 star.",
            "Would you like to make a reservation?",
            "How many days will you stay? What is the check in date?",
            "You want 3 rooms in New Delhi at the Aloft New Delhi Aerocity on March 8th for 1 day, correct?",
            "You want to check in on March 10th and will stay for 4 days, correct?",
            "Your reservation has been made.",
            "There are 2 you may like. How about the park, Lodhi Garden?",
            "Another park is The Garden of Five Senses.",
            "There is no entry fee and the phone number is 11 2953 6401.",
            "Have fun!"
        ]
    },
    {
        "dialogue_id": "16_00070",
        "service": "Hotels_1",
        "service_call": {
            "method": {
                "method": "FindAttractions",
                "parameters": {
                    "location": "Toronto"
                }
            }
        },
        "user_utterance": [
            "I'm looking for a hotel.",
            "I want to find a hotel in Toronto, Canada.",
            "How much is it per night?",
            "What is their phone number?",
            "What other hotels are there? I want a 3 star hotel.",
            "Okay, that sounds good. I'd like to make a reservation for one room checking in on the 7th of March for 3 days.",
            "Yes, that is correct. Does the hotel have wifi? What is the phone number?",
            "Thank you! I'd also like to find some attractions there.",
            "What is the phone number?",
            "Okay, that sounds great. That is all I needed."
        ],
        "system_utterance": [
            "What location do you want to search in?",
            "I found 10 hotels for you. How about the 3 star Best Western Plus Toronto North York Hotel & Suites?",
            "The hotel costs $216 per night.",
            "Their phone number is +1 416-663-9500.",
            "There are 9 hotels that you might like. The Best Western Premier Toronto Airport Carlingview Hotel is 3 stars.",
            "Okay, I have a reservation for 1 room at the Best Western Premier Toronto Airport Carlingview Hotel in Toronto checking in on March 7th and staying 3 days, right?",
            "I have confirmed the reservation. The hotel does not have wifi and the phone number is +1 416-637-7000.",
            "There are 10 attractions you may like. How about the tourist attraction 3D Toronto Sign?",
            "The phone number is 416-392-2489.",
            "Have a great day."
        ]
    },
    {
        "dialogue_id": "16_00071",
        "service": "Hotels_1",
        "service_call": {
            "method": {
                "method": "FindAttractions",
                "parameters": {
                    "good_for_kids": "True",
                    "location": "Nairobi"
                }
            }
        },
        "user_utterance": [
            "Fine one room in a hotel.",
            "Nairobi.",
            "Number? Is there wifi?",
            "Good, book two days from the 1st of March.",
            "Yes. Address and nightly?",
            "Show kid friendly attractions, any kind.",
            "Ok.",
            "No, thanks."
        ],
        "system_utterance": [
            "City?",
            "I found 10 places. Azure Hotel Nairobi Westlands is 5 stars.",
            "There's no wifi. They're at +254 709 716000.",
            "Please confirm: 1 room for 2 nights at Azure Hotel Nairobi Westlands from March 1st in Nairobi.",
            "You're booked. It's at Lantana Road and $135 nightly.",
            "Giraffe Centre is a nature preserve.",
            "Anything else for today?",
            "Enjoy!"
        ]
    },
    {
        "dialogue_id": "16_00072",
        "service": "Hotels_1",
        "service_call": {
            "method": {
                "method": "FindAttractions",
                "parameters": {
                    "location": "Phoenix"
                }
            }
        },
        "user_utterance": [
            "I need to find a hotel in Phoenix, AZ.",
            "That will be awesome.",
            "Yes I need too.",
            "I need to check in next Thursday?",
            "I only need it for 1 night.",
            "No I need it for 2 nights.",
            "Ni I need 2 room on the 2nd of March.",
            "Yes that is great. What is the cost of the room per night. Is there free wifi?",
            "Thanks What can I do there?",
            "Ok awesome.",
            "No. Thanks that will be all"
        ],
        "system_utterance": [
            "What do you think about the 3 star Aloft Phoenix-Airport hotel?",
            "Would you like to reserve a room?",
            "What date will you be willing to check in?",
            "How many days will you be staying?",
            "Just to confirm you need 1 room for 1 day at Aloft Phoenix-Airport hotel in Phoenix checking in on March 7th .",
            "Just to make sure You need it for 2 nights in Phoenix.",
            "Just confirming 2 rooms and checking in on March 2nd",
            "Your rooms are booked. It cost $333 per night. The hotel does have wifi.",
            "The Arizona Capitol Museum. Is a great Museum.",
            "Can I help you with anything else.",
            "Have a great evening."
        ]
    },
    {
        "dialogue_id": "16_00073",
        "service": "Hotels_1",
        "service_call": {
            "method": {
                "method": "FindAttractions",
                "parameters": {
                    "location": "London"
                }
            }
        },
        "user_utterance": [
            "Find a two star hotel in London, England.",
            "Is there wifi? Phone number?",
            "Good, book two rooms.",
            "4 days from the 1st.",
            "Correct. Address? Nightly fee?",
            "Show nearby attractions.",
            "Perfect.",
            "Nope, thanks."
        ],
        "system_utterance": [
            "I found 10 places. 45 Park Lane is 2 stars.",
            "There's no wifi. It's +44 20 7493 4545.",
            "Duration and check in date?",
            "Please confirm: 2 rooms for 4 nights at 45 Park Lane in London from March 1st.",
            "You're all set. It's $480 nightly and at 45 Park Lane.",
            "I found 10 places of interest. 30 St Mary Axe (the gherkin) is a historical landmark.",
            "Anything else for today?",
            "Enjoy!"
        ]
    },
    {
        "dialogue_id": "16_00074",
        "service": "Hotels_1",
        "service_call": {
            "method": {
                "method": "FindAttractions",
                "parameters": {
                    "location": "Toronto"
                }
            }
        },
        "user_utterance": [
            "I need a hotel room reservation. help me find one please.",
            "I would like to search in Toronto, Ontario.",
            "Yes, that will work fine.",
            "Yes please go ahead and book now.",
            "I will need 1 room for three days. I would need to check in on March 8th.",
            "No, just for two days please.",
            "Yes, that's correct.",
            "Pull up some stuff to do there.",
            "Okay, that sounds fun.",
            "No, that was all. Good bye."
        ],
        "system_utterance": [
            "Which city would you like to search?",
            "I found 10 options. Let's start with Best Western Plus Toronto North York Hotel & Suites and is a 3 star rating.",
            "Should I reserve this now for you?",
            "What date would you prefer to check in and how many days would you be staying?",
            "Alright, let's confirm: We will be reserving 1 room for 3 days in Toronto at Best Western Plus Toronto North York Hotel & Suites with a check in March 8th. Is this correct?",
            "Ok, I understand. The reservation is for 2 days in Toronto.",
            "Your reservation was created successfully.",
            "May I suggest 3D Toronto sign. This is a Tourist Attraction you may want to check out.",
            "Will there be anything else I can assist you with.",
            "Great, enjoy your day."
        ]
    },
    {
        "dialogue_id": "16_00075",
        "service": "Hotels_1",
        "service_call": {
            "method": {
                "method": "FindAttractions",
                "parameters": {
                    "location": "Anaheim"
                }
            }
        },
        "user_utterance": [
            "Find 3 star hotels in Anaheim.",
            "Great, book two rooms for four nights.",
            "The 6th of this month.",
            "Yep.",
            "Show nearby attractions.",
            "Anything else?",
            "Ok good.",
            "No, thanks for helping."
        ],
        "system_utterance": [
            "I found 10 places. Anaheim Majestic Garden Hotel is 3 stars.",
            "Check in date?",
            "Please confirm: 2 rooms for 4 nights at Anaheim Majestic Garden Hotel in Anaheim on March 6th.",
            "You're booked.",
            "Angel Stadium of Anaheim is a sports venue by that hotel.",
            "Cars Land is a tourist attraction nearby.",
            "Anything else for now?",
            "Enjoy!"
        ]
    },
    {
        "dialogue_id": "16_00076",
        "service": "Hotels_1",
        "service_call": {
            "method": {
                "method": "FindAttractions",
                "parameters": {
                    "category": "Performing Arts Venue",
                    "free_entry": "True",
                    "location": "Toronto"
                }
            }
        },
        "user_utterance": [
            "I'm planning a trip, and need to find a hotel room.",
            "I'm going to be needing a room in Toronto, Ontario.",
            "Can you tell me about another hotel I'd like possibly?",
            "Can you look again for one I'd like, a two star one? I just need 1 room.",
            "I like how that one sounds.",
            "I do. I want the room for 1 day, checking in on the 11th of this month.",
            "Yes, that's all correct.",
            "Can you give me the phone number there?",
            "Tell me how much the room is per night.",
            "I appreciate your help! Now can you tell me about some attractions near there? I don't want to pay an entry fee, and I'd like to go to a Performing Arts Venue.",
            "That sounds good! Anything else you can tell me about?",
            "Terrific!",
            "That's all, thanks. You were helpful."
        ],
        "system_utterance": [
            "Okay. In what city should I look for a hotel?",
            "Let's see, I found 10 different hotels that might work for you. How about Best Western Plus Toronto North York Hotel & Suites? It's a nice 3 star hotel.",
            "Yes. There's Best Western Premier Toronto Airport Carlingview Hotel, which is also nice and 3 stars.",
            "Here's a nice 2 star hotel, Best Western Primrose Hotel Downtown-Toronto.",
            "Do you want me to reserve you a room there?",
            "Okay, just to confirm, you will be staying at Best Western Primrose Hotel Downtown-Toronto, checking in on March 11th for 1 day, 1 person, in Toronto.",
            "I've got that all reserved for you.",
            "Sure. It's +1 800-780-7234.",
            "It will cost $66 a night.",
            "Here's a Performing Arts Venue you might like, Harbourfront Centre.",
            "There's also Hart House, another Performing Arts Venue.",
            "Is there anything else I can do for you?",
            "Have a good time!"
        ]
    },
    {
        "dialogue_id": "16_00077",
        "service": "Hotels_1",
        "service_call": {
            "method": {
                "method": "FindAttractions",
                "parameters": {
                    "location": "London"
                }
            }
        },
        "user_utterance": [
            "Hi, Can you help get me 3 rooms in London Please.",
            "Fine get it for 2 days. I want it on the 2nd.",
            "Fine, I agree to that. What's the cost though. What's the phone and extension there?",
            "Show what's going on there as far as attractions please.",
            "Is it free? What's their contact?",
            "Fine, that's quite enough."
        ],
        "system_utterance": [
            "There are 10 choices. What about 45 Park Lane, they have 5 stars.",
            "To confirm 3 rooms for 2 days at 45 park Lane starting on March 2nd in London.",
            "A room costs $480 per night. The phone is +44 20 7493 4545",
            "Well, you really should check out the historical LandMark at 30 St Mary Axe (The Gherkin).",
            "Yes, it's free. Their phone is 20 7071 5029",
            "Have fun."
        ]
    },
    {
        "dialogue_id": "16_00078",
        "service": "Hotels_1",
        "service_call": {
            "method": {
                "method": "FindAttractions",
                "parameters": {
                    "free_entry": "True",
                    "location": "Los Angeles"
                }
            }
        },
        "user_utterance": [
            "I need you to find me a hotel room.",
            "I'm going to be in Los Angeles.",
            "do you have anything else? Something with one room and wifi.",
            "What will it cost me?",
            "Great. I like it.",
            "I do. I want the room for 2 days and will be checking in tomorrow.",
            "I'm good with that",
            "What phone number do you have for it?",
            "Do you have the address?",
            "Thanks. I appreciate it. Do you have any attractions in the area that don't charge an entry fee?",
            "How would it be for kids?",
            "OK, thanks, that's it"
        ],
        "system_utterance": [
            "Where will you be staying?",
            "I've got a 2 star hotel. It's Ac Hotel by Marriott Beverly Hills.",
            "I've got 9 homes you might like. There's Airtel Plaza Hotel. It has 3 stars.",
            "It runs $75 a night.",
            "Do you want me to reserve that for you?",
            "To confirm: The reservation is for 1 room for 2 days starting March 2nd At the Airtel Plaza Hotel in Los Angeles.",
            "The room is booked",
            "Dial +1 800-224-7835",
            "They're located at 7277 Valjean Avenue, Van Nuys, California 91406, United States.",
            "I have 10 that might be of interest. How about Autry Museum of the American West. That's a Museum.",
            "Yes, it's child friendly.",
            "Have a good time."
        ]
    },
    {
        "dialogue_id": "16_00079",
        "service": "Hotels_1",
        "service_call": {
            "method": {
                "method": "FindAttractions",
                "parameters": {
                    "category": "Museum",
                    "good_for_kids": "True",
                    "location": "Paris"
                }
            }
        },
        "user_utterance": [
            "Find hotels.",
            "Paris.",
            "Perfect.",
            "Yes.",
            "Get two night starting the 8th of this month.",
            "Perfect. Where is it? Is there wifi?",
            "Thanks, show nearby attractions like a child friendly museum.",
            "Ok. That's all."
        ],
        "system_utterance": [
            "City?",
            "Ac Hotel by Marriott Paris Porte Maillot is rated 4 stars.",
            "Do you want a room?",
            "Check in date? Duration of stay?",
            "Please confirm: 1 room for 2 nights at Ac Hotel by Marriott Paris Porte Maillot in Paris on March 8th.",
            "You're booked. There's no wifi and the location is 6 Rue Gustave Charpentier, 75017.",
            "Choco-Story Paris - Musee du Chocolat is a museum good for kids.",
            "Enjoy!"
        ]
    },
    {
        "dialogue_id": "16_00080",
        "service": "Hotels_1",
        "service_call": {
            "method": {
                "method": "FindAttractions",
                "parameters": {
                    "category": "Museum",
                    "location": "Toronto"
                }
            }
        },
        "user_utterance": [
            "I'd like to book a hotel room in Toronto, canada",
            "Sure, please make me a reservation",
            "Next Wednesday",
            "1 day",
            "Perfect, thanks",
            "Oh, can you tell me where's it located and if they have wifi?",
            "Awesome, thanks. Is there a fun museum nearby?",
            "Sweet, thanks",
            "Nope, I'm all set."
        ],
        "system_utterance": [
            "Sure, I've found 10 matches. How about the 3 star best Western plus toronto north york hotel & suites",
            "What day would you like?",
            "How long are you planning to stay?",
            "Please confirm: Reservation for 1 at the best western plus toronto north york hotel & suites on March 6th in Toronto. This room is booked for 1 day.",
            "This reservation is complete.",
            "There's no wifi and it's located at 50 Norfinch drive",
            "Well, I've pulled up 10 attractions, how about a museum called the Aga Khan Museum",
            "May I help you with anything else?",
            "Have a wonderful time."
        ]
    },
    {
        "dialogue_id": "16_00081",
        "service": "Hotels_1",
        "service_call": {
            "method": {
                "method": "FindAttractions",
                "parameters": {
                    "location": "New York"
                }
            }
        },
        "user_utterance": [
            "Can you get a hotel room for me?",
            "In New York City.",
            "Sounds good to me!",
            "Yes, please book 2 rooms there for me for a 1 day stay on the 13th of March.",
            "Yes, that is correct.",
            "Can you show me some attractions around there? Anything goes.",
            "Neat. What else?",
            "Okay, good to know.",
            "Not now. That's all. Thanks."
        ],
        "system_utterance": [
            "In what city?",
            "There's a 4 star hotel there called 1 Hotel Brooklyn Bridge.",
            "Want to book a room there?",
            "You want to book 2 rooms at 1 Hotel Brooklyn Bridge in New York, for a 1 day stay on March 13th?",
            "I have booked your rooms.",
            "There's the performing arts venue 92nd Street Y.",
            "There's a museum there called the American Folk Art Museum.",
            "Can I assist you some more?",
            "Enjoy your day!"
        ]
    },
    {
        "dialogue_id": "16_00082",
        "service": "Hotels_1",
        "service_call": {
            "method": {
                "method": "FindAttractions",
                "parameters": {
                    "good_for_kids": "True",
                    "location": "Sydney"
                }
            }
        },
        "user_utterance": [
            "I would like to find a hotel room.",
            "I would like a hotel in Sydney.",
            "How much is it per night? Do they have wifi?",
            "Okay, that sounds good.",
            "Yes, please make the reservation for one day.",
            "I want to check in on March 10th.",
            "Yes, that's perfect.",
            "Can you find me some child-friendly attractions near there?",
            "Sounds great, thanks!",
            "No, that's all. Thank you for your help."
        ],
        "system_utterance": [
            "Which city would you like to me look in?",
            "I found 10 hotels you may like. 28 Hotel Sydney has a 4 star rating. How does that sound?",
            "The room is $312 per night, and no, they do not have wifi.",
            "Would you like to make a reservation?",
            "When would you like to check in?",
            "Okay, I am booking 1 room at the 28 Hotel Sydney in Sydney for 1 day checking in on March 10th. Is this correct?",
            "Your reservation has been made successfully.",
            "I found 10 attractions that may interest you. the ANZ Stadium is a popular Sports Venue. How does that sound?",
            "Is there anything else I can do for you?",
            "My pleasure. Have a great day!"
        ]
    },
    {
        "dialogue_id": "16_00083",
        "service": "Hotels_1",
        "service_call": {
            "method": {
                "method": "FindAttractions",
                "parameters": {
                    "category": "Performing Arts Venue",
                    "good_for_kids": "True",
                    "location": "London"
                }
            }
        },
        "user_utterance": [
            "I will be travelling soon and need to find a place to stay. Please find a 2 star hotel.",
            "Look for something in London, UK.",
            "Sure, that one sounds good.",
            "Yes, Please make a reservation for three rooms on 1st of March. We will be staying only 2 days.",
            "That is correct.",
            "What is the address of the hotel? And how much does it cost per night?",
            "Thanks a lot, I also want to know if there is a child-friendly Performing Arts Venue in there.",
            "That sounds great.",
            "No, that would be all."
        ],
        "system_utterance": [
            "Where do you want to look for?",
            "The 45 Park Lane is a 2 star hotel you might like.",
            "Do you want to make a reservation?",
            "Please confirm: Booking 3 rooms at 45 Park Lane on March 1st for 2 days in London.",
            "The reservation has been done.",
            "The address is 45 Park Lane and it has a cost of $480 per night.",
            "There is Alexandra palace, it is a performing arts venue you might like.",
            "Is there anything else I can help you with?",
            "Have a great day."
        ]
    },
    {
        "dialogue_id": "16_00084",
        "service": "Hotels_1",
        "service_call": {
            "method": {
                "method": "FindAttractions",
                "parameters": {
                    "good_for_kids": "True",
                    "location": "Paris"
                }
            }
        },
        "user_utterance": [
            "Could you find me a hotel room in paris, france?",
            "Sure. Could you book me a room for one, for two days on the 12th of march?",
            "Yes.",
            "Thank you, how much does it cost? WHat's the address?",
            "Thank you, could you show me some child friendly attractions there?",
            "Thanks, that's all I need for now."
        ],
        "system_utterance": [
            "How about the ac hotel by marriott paris porte maillot? It's got 4 stars.",
            "Please confirm: You want a room at the ac hotel by marriott paris porte maillot on march 12th for 2 days, a room for 1 in paris?",
            "your reservation is successful.",
            "Their rooms are $160 per night, and it's at 6 rue gustave charpentier 75017.",
            "There's 10 options. How about this place of worship?: The american church in paris.",
            "Enjoy!"
        ]
    },
    {
        "dialogue_id": "16_00085",
        "service": "Hotels_1",
        "service_call": {
            "method": {
                "method": "FindAttractions",
                "parameters": {
                    "location": "Los Angeles"
                }
            }
        },
        "user_utterance": [
            "I need 3 rooms in a 3 star hotel in Los Angeles",
            "How much is the overnight stay? Can I get the address?",
            "Perfect! Thanks a lot!",
            "Yes, please. I want to book now",
            "The arrival day is the 5th, and I need the room for 3 days",
            "Yes, I confirm! Is wifi available in the hotel? What is the phone number?",
            "Thank you for helping. Are there any interesting attractions there?",
            "Is it free entry? Can I get a contact number?",
            "It's fine, thank you",
            "No, It's all for today, thank you"
        ],
        "system_utterance": [
            "I found a 3 star hotel, Airtel Plaza Hotel",
            "Overnight costs $306. The address is 7277 Valjean Avenue, Van Nuys, California 91406, United States",
            "Do you want to book the rooms?",
            "What is the day of arrival? How long will you stay in the hotel?",
            "3 rooms at Airtel Plaza Hotel in Los Angeles, from March 5th for 3 days. Do you confirm?",
            "Yes, wifi is available. The phone number is +1 800-224-7835. Your reservation is confirmed!",
            "Sure! I found 10 attractions for you. There's a Historical Landmark, Angels Flight Railway.",
            "No, admission is charged. The contact number is 213-626-1901",
            "Do you need anything else?",
            "Have a good time!"
        ]
    },
    {
        "dialogue_id": "16_00086",
        "service": "Hotels_1",
        "service_call": {
            "method": {
                "method": "FindAttractions",
                "parameters": {
                    "good_for_kids": "True",
                    "location": "Philadelphia"
                }
            }
        },
        "user_utterance": [
            "can you book a hotel room for me?",
            "look in philadelphia please.",
            "that'll work, can you book it?",
            "the 10th of march is ideal.",
            "just for one day.",
            "yes that's right.",
            "how much will it be per night?",
            "thanks. are there any child friendly places around there to visit?",
            "okay sounds good.",
            "no that's it."
        ],
        "system_utterance": [
            "where should i look?",
            "i found 10 places you might like. there's a 3 star hotel at aka university city.",
            "when do you want to check in?",
            "how long will your stay be?",
            "so you want to book 1 room for 1 day at aka university city on march 10th in philadelphia?",
            "it's been booked.",
            "it's gonna come out to $63 a night.",
            "there's 10 places i found that could work. there's a tourist attraction called the art museum steps.",
            "is there anything else?",
            "enjoy your time."
        ]
    },
    {
        "dialogue_id": "16_00087",
        "service": "Hotels_1",
        "service_call": {
            "method": {
                "method": "FindAttractions",
                "parameters": {
                    "free_entry": "True",
                    "good_for_kids": "True",
                    "location": "New York"
                }
            }
        },
        "user_utterance": [
            "I need to find a hotel room.",
            "I want to find one in NY.",
            "Do you have any other hotels? A two star hotel with wifi would be great.",
            "Sounds nice.",
            "Yes, please.",
            "Make it for three days. I will check in on Friday next week.",
            "That works for me. What is the phone number and address?",
            "Thanks so much. Would you show me some attractions there? I need something without an entry fee which is child-friendly. Any sort of attraction is good.",
            "Sounds good.",
            "No, that was helpful. Thanks!"
        ],
        "system_utterance": [
            "What city do I need to look for a hotel in?",
            "1 Hotel Brooklyn Bridge is a nice 4 star.",
            "I have 9 hotels that you may like. 1 Hotel Central Park is a good 2 star hotel.",
            "Do you want to book it?",
            "When will you check in and for how many days?",
            "Could you confirm that you want to check in at 1 Hotel Central Park on March 8th for 3 days? This hotel is in New York and you need 1 room.",
            "Your reservation has been made. The phone number is +1 212-703-2001 and the address is 1414 6th Avenue.",
            "There are 10 attractions. What about American Museum of Natural History? It's a museum.",
            "Could I help with something else?",
            "Have a good one!"
        ]
    },
    {
        "dialogue_id": "16_00088",
        "service": "Hotels_1",
        "service_call": {
            "method": {
                "method": "FindAttractions",
                "parameters": {
                    "location": "Chicago"
                }
            }
        },
        "user_utterance": [
            "one room please",
            "chi-town for me",
            "one day on the 5th",
            "yes that is fine",
            "any other places?",
            "is it free?",
            "okay good then",
            "that is all"
        ],
        "system_utterance": [
            "what city then?",
            "ac hotel by marriott chicago downtown 3 stars",
            "ac hotel by marriott chicago downtown march 5th chicago 1 day 1 person",
            "it went through",
            "10 places 360 CHICAGO tourist attraction",
            "yes it is",
            "anything else for you?",
            "have a good day"
        ]
    },
    {
        "dialogue_id": "16_00089",
        "service": "Hotels_1",
        "service_call": {
            "method": {
                "method": "FindAttractions",
                "parameters": {
                    "location": "San Francisco"
                }
            }
        },
        "user_utterance": [
            "Search me a hotel",
            "Search in SFO",
            "Any thing else?",
            "sounds good. Looking for 2 rooms for 2 days from march 8th",
            "yes thats right",
            "what the address and the contact number?",
            "thanks a lot, are there any attractions there?",
            "ok, thanks",
            "no, thats all thanks"
        ],
        "system_utterance": [
            "which city to look in",
            "Amsterdam hostel San Francisco is rated 1",
            "There is a Argonaut Hotel is rated 4 stars",
            "please confirm: Booking 2 rooms at the Argonaut Hotel in San Francisco for march 8th checkin for 2 days",
            "your booking is done",
            "Its +1 415-563-0800 and address is 495 Jefferson Street",
            "I found 10 attractions of which there is the historical landmark the Alcatraz",
            "any thing else?",
            "have a good day"
        ]
    },
    {
        "dialogue_id": "16_00090",
        "service": "Hotels_1",
        "service_call": {
            "method": {
                "method": "FindAttractions",
                "parameters": {
                    "location": "San Francisco"
                }
            }
        },
        "user_utterance": [
            "Hello. I'd like to find a hotel room to stay at.",
            "I want a 1 star, 2 room hotel in San Francisco.",
            "Yes it does. I'd like to reserve that one.",
            "For 3 days, starting tomorrow.",
            "That's right. What's the address and nightly cost?",
            "Thanks! Can you find attractions there for me?",
            "Okay, good to know.",
            "Not now. You were a great help, thanks!"
        ],
        "system_utterance": [
            "In what city?",
            "A 1 star hotel? Does Amsterdam Hostel San Francisco suit your fancy?",
            "How long will you stay?",
            "You're going to book 2 rooms at Amsterdam Hostel San Francisco in San Francisco for 3 days starting March 2nd?",
            "You've successfully reserved the rooms. You can reach them at 749 Taylor Street, and the nightly cost is $69.",
            "Okay. I know of 10 attractions. You could visit the Alcatraz historical landmark.",
            "Can I assist you with anything else?",
            "Enjoy your time in San Francisco!"
        ]
    },
    {
        "dialogue_id": "16_00091",
        "service": "Hotels_1",
        "service_call": {
            "method": {
                "method": "FindAttractions",
                "parameters": {
                    "category": "Place of Worship",
                    "location": "Kuala Lumpur"
                }
            }
        },
        "user_utterance": [
            "I'd like to book a room in a 4 star Hotel in Kuala Lumpur.",
            "That sounds good to me.",
            "Yes, I'd like 2 rooms for 1 day and want to check in next Wednesday.",
            "Actually I've changed my mind. I'd like to check in on the 11th instead.",
            "Yes that's correct.",
            "Thanks for your help. Now I'd like to find attractions to visit while I'm there.",
            "That sounds nice but I think I'm in the mood to visit a place of worship or something more historical.",
            "Is this place free and is it somewhere I can take the kids?",
            "Okay that's great. I don't need anything else right now."
        ],
        "system_utterance": [
            "There are 10 hotels that meet your criteria. How about Alila Bangsar? It is a nice place with a 4 star rating.",
            "Do you want to make a reservation?",
            "Okay no problem. So to confirm: You'd like to book 2 rooms for 1 day at the Alila Bangsar in Kuala Lumpur and you will be checking in on March 6th.",
            "So that's March 11th at Alila Bangsar.",
            "Your reservation has been successful.",
            "Would you like to visit a park? How about 99 Wonderland Park?",
            "While looking for a place of worship I found Jamek Mosque.",
            "No it's not free to visit but it is a nice place to visit with children.",
            "Enjoy the rest of your day."
        ]
    },
    {
        "dialogue_id": "16_00092",
        "service": "Hotels_1",
        "service_call": {
            "method": {
                "method": "FindAttractions",
                "parameters": {
                    "location": "Los Angeles"
                }
            }
        },
        "user_utterance": [
            "I need to find a room in a hotel.",
            "I am interested for the hotel to be in LAX.",
            "Can you give me their phone number? Can you check if the hotel provides wifi?",
            "Is there some other hotel that I might like staying in? I am interested in having 1 room.",
            "Yes that seems nice. I want to make a booking at this hotel.",
            "I want to have the room for 1 day, and I will go there this Sunday.",
            "Yes that is correct. Can you give me their address?",
            "I appreciate it very much. Can you also find me some attractions there?",
            "Alright, nice. That would be all for now. Good bye!"
        ],
        "system_utterance": [
            "Can you tell me where I should look for the hotel?",
            "There are 10 hotels which match what you want. How would you like staying at the Ac Hotel By Marriott Beverly Hills, which is a 2 star hotel?",
            "I can confirm that the hotel has wifi. If you want to call them you can at +1 323-852-7000.",
            "There are 9 hotels which match what you requested. One of the hotels is the Airtel Plaza Hotel, which is a 3 star hotel.",
            "Can you tell me the number of days you want the reservation to be for? Can you tell me when you will go there?",
            "Can you please confirm that you want to book 1 room for 1 day at the Airtel Plaza Hotel in Los Angeles, and that you will go there on March 3rd?",
            "Your requested reservation has been made. The hotel can be found at 7277 Valjean Avenue, Van Nuys, California 91406, United States.",
            "You might consider visiting Angels Flight Railway, which is a Historical Landmark.",
            "Have a good time!"
        ]
    },
    {
        "dialogue_id": "16_00093",
        "service": "Hotels_1",
        "service_call": {
            "method": {
                "method": "FindAttractions",
                "parameters": {
                    "category": "Theme Park",
                    "free_entry": "True",
                    "location": "Sydney"
                }
            }
        },
        "user_utterance": [
            "I'm looking for 2 hotel rooms at a 3 star hotel.",
            "I want to look in Sydney, Australia.",
            "Okay, that could work. Please make me a reservation for one day.",
            "I want to check in on the 3rd of March.",
            "That's correct. Can you tell me their phone number?",
            "Thanks a lot.",
            "What are some attractions there?",
            "Is it free to go there? And what's a number I can call them at?",
            "What else attractions do you recommend? I want somewhere that doesn't have an entrance fee/ How about an Amusement park?",
            "Okay, cool. That's all I need right now, bye."
        ],
        "system_utterance": [
            "What city are you interested in?",
            "28 Hotel Sydney is a nice 3 star hotel.",
            "What date do you want to check in?",
            "I'll book you 2 rooms at 28 Hotel Sydney in Sydney for a March 3rd check in for 1 day. Is that correct?",
            "The rooms are booked. The phone number of the hotel is +61 2 9102 2828.",
            "What else can I do for you?",
            "You might like ANZ stadium. It's a Sports Venue.",
            "No, it is not free. You can call them at 2 8765 2000.",
            "There are 2 attractions you might like. There's a Theme Park called Cables Wake Park you might enjoy.",
            "Have fun!"
        ]
    },
    {
        "dialogue_id": "16_00094",
        "service": "RideSharing_1",
        "service_call": {
            "method": {
                "method": "PlaySong",
                "parameters": {
                    "playback_device": "TV",
                    "song_name": "Radioactive"
                }
            }
        },
        "user_utterance": [
            "Hey, could you help me get a cab?",
            "Yeah, a shared ride is fine. For two people.",
            "I'm going to Le Garage.",
            "No, actually, we're going to 3740 El Camino Real.",
            "Yeah that's right. How long will it take? How much will it cost?",
            "Okay thanks. Can you find a song for me too?",
            "Sounds great. Please play it on the TV.",
            "Yes please. What genre is it? When was it released?",
            "Thanks a lot.",
            "No, that's all thanks."
        ],
        "system_utterance": [
            "Sure, for how many people? Is a shared ride okay?",
            "Where are you going?",
            "Okay, please confirm that you'd like a shared ride cab for 2 to Le Garage.",
            "Okay, you want a shared ride to 3740 El Camino Real?",
            "The cab is on the way. It'll take 24 minutes and cost $16.50.",
            "Okay, how about Radioactive by Imagine Dragons from the album Night Visions?",
            "Okay, please confirm that you'd like to play Radioactive on the TV.",
            "It's a rock song from 2012.",
            "No worries, anything else?",
            "Okay, see you."
        ]
    },
    {
        "dialogue_id": "16_00095",
        "service": "RideSharing_1",
        "service_call": {
            "method": {
                "method": "PlaySong",
                "parameters": {
                    "artist": "Agnes Obel",
                    "playback_device": "Bedroom speaker",
                    "song_name": "Riverside"
                }
            }
        },
        "user_utterance": [
            "Would you help call a cab?",
            "A shared ride is ok.",
            "It's for 1 person.",
            "I want to go to Branham House Apartments.",
            "Yes, that's right. How much is it and how long is the ride?",
            "Thank you for helping. I want to find songs now. I like Agnes Obel and folk songs. There are a lot of songs in the Philharmonics album.",
            "That sounds good. I want to listen to music on my kitchen speaker.",
            "No, put it on the bedroom speaker.",
            "Yep, right.",
            "Which year was it released?",
            "Thanks. That's it."
        ],
        "system_utterance": [
            "Would you like a shared ride?",
            "How many people would the cab be for?",
            "Where are you going?",
            "So you want to go to Branham House Apartments for 1 person in a shared ride?",
            "Your ride was booked and it costs $8.60. It will last around 16 minutes.",
            "What about Riverside by Agnes Obel in the album Philharmonics?",
            "Could you confirm that you want to play Riverside on the Kitchen speaker?",
            "Okay, so you would like to play Riverside on the bedroom speaker?",
            "Enjoy the music.",
            "It's from 2010",
            "Have a great day."
        ]
    },
    {
        "dialogue_id": "16_00096",
        "service": "RideSharing_1",
        "service_call": {
            "method": {
                "method": "PlaySong",
                "parameters": {
                    "song_name": "Bad Habit"
                }
            }
        },
        "user_utterance": [
            "I want a shared ride for two people.",
            "I am going to 782 Haight Street.",
            "That is right. What is the total bill?",
            "Find me somg Pop songs from '19.",
            "That is perfect. Play it on any device that you want for me.",
            "That is right.",
            "Thanks. That is everything."
        ],
        "system_utterance": [
            "What is your destination?",
            "You want a shared ride for 2 people and are traveling to 782 Haight Street. Is that right?",
            "Your cab is ordered and is coming for you right now. Your total bill is $18.98.",
            "Search revealed 10 results. Do you like Bad Habit by Ben Platt on the Sing to Me Instead album?",
            "You want me to cast Bad Habit to the TV, correct?",
            "Your music is starting now.",
            "Have a wonderful day."
        ]
    },
    {
        "dialogue_id": "16_00097",
        "service": "RideSharing_1",
        "service_call": {
            "method": {
                "method": "PlaySong",
                "parameters": {
                    "playback_device": "Bedroom speaker",
                    "song_name": "Roots Reggae Music"
                }
            }
        },
        "user_utterance": [
            "Find me a taxi.",
            "There is one person who is headed to 899 Sir Francis Drake Boulevard and I am fine with a shared cab.",
            "That is right.",
            "What is the total bill?",
            "What is the ride duration?",
            "Thank. Find me some songs on the Count Me In album from five years ago.",
            "That is perfect. Play it on my bedroom device right now.",
            "That is right.",
            "Thanks. That is everything."
        ],
        "system_utterance": [
            "How many people are going, where are you going, and is a shared ride okay?",
            "You want a shared ride for 1 person to 899 Sir Francis Drake Boulevard, right?",
            "Your order is complete and the ride is coming for you right now.",
            "Your total bill is $9.56.",
            "The ride duration is 28 minutes.",
            "Search revealed 1 result which is Roots Reggae Music by Rebelution on the Count Me In album",
            "You want to cast Roots Reggae Music on the Bedroom Speaker?",
            "Your song has started.",
            "Have a great day."
        ]
    },
    {
        "dialogue_id": "16_00098",
        "service": "RideSharing_1",
        "service_call": {
            "method": {
                "method": "PlaySong",
                "parameters": {
                    "artist": "Alec Benjamin",
                    "playback_device": "TV",
                    "song_name": "Boy In The Bubble"
                }
            }
        },
        "user_utterance": [
            "Could you assist me in hailing a taxi?",
            "I must head to Arbors At Mountain View in a ride for one person, and I am alright with sharing rides.",
            "Yeah, I'm fine with that.",
            "I want to search for music now. There's plenty of wonderful music in the album Narrated For you. I enjoy music by Alec Benjamin; get me something from one years ago.",
            "Yeah, that's right. I'd like to listen to songs.",
            "Yup, that's the right one.",
            "What type of song is it?",
            "Thank you for your help!",
            "Nope, thank you for your assistance!"
        ],
        "system_utterance": [
            "What many passengers will ride in the taxi?",
            "Please verify the following information: you'd like to go on a shared ride for 1 person to head to Arbors At Mountain View.",
            "Your taxi is reserved and is coming.",
            "What is your opinion about Boy In The bubble by Alec Benjamin in the album Narrated For You?",
            "Please verify the following information: cast the music Boy In The Bubble on TV.",
            "Have fun with your song.",
            "It is pop music.",
            "Do you have something else I can assist with?",
            "Have a pleasant afternoon."
        ]
    },
    {
        "dialogue_id": "16_00099",
        "service": "RideSharing_1",
        "service_call": {
            "method": {
                "method": "PlaySong",
                "parameters": {
                    "playback_device": "TV",
                    "song_name": "Out Of Love"
                }
            }
        },
        "user_utterance": [
            "Can you fetch a cab for me?",
            "I want a shared ride for one to The Cartoon Museum.",
            "Correct. What's the length and cost?",
            "Okay, great. I'd like to find a song to listen to now.",
            "Oh yes, that is the song I want.",
            "Yes. Play it on my TV.",
            "That is correct.",
            "Thank you so much!",
            "No, not now. Thanks!"
        ],
        "system_utterance": [
            "Sure thing. For how many people and to where? Is a shared ride fine?",
            "Okay, you want a shared ride for 1 to The Cartoon Museum?",
            "I booked the ride for you and it'll be here soon. The $16.19 ride lasts about 28 minutes.",
            "I found 10 songs for you. How about the Alessia Cara song Out Of Love, from her album The Pains Of Growing?",
            "Want to play it?",
            "Okay, you want to hear Out Of Love on your TV?",
            "I started playing it. Enjoy!",
            "Can I help you out some more?",
            "Have a great day!"
        ]
    },
    {
        "dialogue_id": "16_00100",
        "service": "RideSharing_1",
        "service_call": {
            "method": {
                "method": "PlaySong",
                "parameters": {
                    "playback_device": "Bedroom speaker",
                    "song_name": "Suave"
                }
            }
        },
        "user_utterance": [
            "I would like to book a cab.",
            "There is 2 people.",
            "I would like a ride share to Absinthe Brasserie & Bar.",
            "I would like to go to Aria Dining & Banquets Fine Indian Cuisine instead.",
            "Yes, that works for me.",
            "I would like to find a song.",
            "What genre is that song and is it from 2011?",
            "Yes, that song works.",
            "Yes, play on speaker in the bedroom.",
            "Yes, that is correct.",
            "Thank you for your help.",
            "That is all for now."
        ],
        "system_utterance": [
            "How many people is the cab for?",
            "Do you want a ride share and where are you going?",
            "Booking a cab for 2 to absinthe Brasserie & Bar.",
            "Booking a cab for 2 to Aria Dining & Banquets Fine Indian Cuisine.",
            "Your cab is on the way.",
            "There are 10 songs, there is Suave by El Alfa from the album El hombre.",
            "It's a Latin song from 2017.",
            "Would you like to play song?",
            "Play Suave on Bedroom speaker.",
            "Yes, enjoy your music.",
            "Can I help with something else?",
            "Have a good day."
        ]
    },
    {
        "dialogue_id": "16_00101",
        "service": "RideSharing_1",
        "service_call": {
            "method": {
                "method": "PlaySong",
                "parameters": {
                    "playback_device": "Bedroom speaker",
                    "song_name": "Cool Girl"
                }
            }
        },
        "user_utterance": [
            "Would you find a cab for me?",
            "I want to go to Museum of the African Diaspora. There is 1 in my party and I'm okay with a shared ride.",
            "That is fine. What does it cost?",
            "I want to find songs now.",
            "That sounds good.",
            "Okay. Cast it on the bedroom device.",
            "Right. What sort of music is it?",
            "Is it from five years back?",
            "Thanks!",
            "No, that's it."
        ],
        "system_utterance": [
            "Where are you going and how big is the party? Is a shared ride needed?",
            "Would you confirm that you are going to the Museum of the African Diaspora for 1 and that you need a shared ride?",
            "Your ride has been booked and the taxi is coming. The cost is $14.14.",
            "I have 10 songs for you. How about Cool Girl by Tove Lo in the album Lady Wood?",
            "Would you like to play this song?",
            "Would you confirm that you want me to play Cool Girl on the bedroom speaker?",
            "It's electropop. Enjoy!",
            "It's from 2016.",
            "Could I help you further?",
            "Have a great day."
        ]
    },
    {
        "dialogue_id": "16_00102",
        "service": "RideSharing_1",
        "service_call": {
            "method": {
                "method": "PlaySong",
                "parameters": {
                    "playback_device": "Kitchen speaker",
                    "song_name": "Girl Like You"
                }
            }
        },
        "user_utterance": [
            "Get me a cab for 2 will ya? I'm headed to Le Petit Bistro.",
            "That's fine. I'm Ok with it.",
            "That's just the ticket.",
            "How much and how long will I be in the cab?",
            "Wow, thanks. Play a song for me while waiting.",
            "Is it from about seven years back? What music is this?",
            "Fine, then play it.",
            "Yes just do it.",
            "No, play on my kitchen speaker instead.",
            "Yes, you got it.",
            "No, thank you.",
            "Not today, thanks."
        ],
        "system_utterance": [
            "How about a shared ride to save?",
            "What I have: 2 people with shared ride to Le Petit Bistro.",
            "The ride is set and they're on their way.",
            "It's $24.41 and it's 21 minutes.",
            "I have 10 from you list. What about Girl Like you by Jason Aldean. It's from the Rearview town.",
            "No it's from 2018 and it's country.",
            "I'll play it right?",
            "Here goes, playing Girl Like you on TV.",
            "Fine, PLaying Girl Like You on Kitchen Speaker.",
            "Enjoy it, Thanks.",
            "Will there be something else?",
            "Have a good ride."
        ]
    },
    {
        "dialogue_id": "16_00103",
        "service": "RideSharing_1",
        "service_call": {
            "method": {
                "method": "PlaySong",
                "parameters": {
                    "playback_device": "Kitchen speaker",
                    "song_name": "With You I Am"
                }
            }
        },
        "user_utterance": [
            "Will you reserve a cab for one to Maggie Daley Park ice skating ribbon?",
            "That's fine.",
            "Cool. Cost and duration?",
            "Cool. Will you find songs?",
            "Perfect.",
            "Yes.",
            "Play it on my kitchen speaker.",
            "Fantastic.",
            "Thanks.",
            "That's all."
        ],
        "system_utterance": [
            "A shared ride?",
            "Please confirm 1 shared ride to Maggie Daley Park ice skating ribbon.",
            "Ride is around 29 minutes for $8.19. It's on its way.",
            "With You I Am by Cody Johnson from the album Gotta Be Me.",
            "Play this song?",
            "Please confirm With You I Am playing on TV.",
            "Please confirm With You I Am playing on Kitchen speaker.",
            "Enjoy!",
            "Anything else?",
            "Have a wonderful day."
        ]
    },
    {
        "dialogue_id": "16_00104",
        "service": "RideSharing_1",
        "service_call": {
            "method": {
                "method": "PlaySong",
                "parameters": {
                    "playback_device": "Kitchen speaker",
                    "song_name": "Adorn"
                }
            }
        },
        "user_utterance": [
            "I would like a cab for two people.",
            "I would like to go to 1065 Holly Street D.",
            "Yes, that works. What is the cost?",
            "I would like to find a POp song.",
            "Is this from the year 2019?",
            "Yes, I would like to play it on my bedroom speaker.",
            "Can you play it in my kitchen speaker instead.",
            "Yes, that is correct.",
            "Thank you for your help.",
            "That is all for now."
        ],
        "system_utterance": [
            "Where would you like to go?",
            "Booking a ride for 2 to 1065 Holly Street D..",
            "Your cab is booked and the cost is $15.84.",
            "There is Adorn by Miguel from the album Kaleidoscope Dream.",
            "No, the song is from 2012.",
            "Adorn playing on Bedroom speaker.",
            "Adorn playing on kitchen speaker.",
            "The song started playing.",
            "Can I help with something else?",
            "Have a good day."
        ]
    },
    {
        "dialogue_id": "16_00105",
        "service": "RideSharing_1",
        "service_call": {
            "method": {
                "method": "PlaySong",
                "parameters": {
                    "playback_device": "TV",
                    "song_name": "Power"
                }
            }
        },
        "user_utterance": [
            "Hi, could you get me a cab ride please?",
            "I need to travel to 310 Sutter Street 4th Floor, and I am totally fine with a shared ride.",
            "Alone, so that is for 1 person. Thanks!",
            "Yes, that is fine with me.",
            "Could you help me search for some songs too?",
            "When was this song released?",
            "I see, what is the genre of this song?",
            "Are there any alternatives? Could you find one from Glory Days which is released two years ago?",
            "Are there any alternatives?",
            "Yes, that is fine with me.",
            "Sure, could you do so please?",
            "Sure, what is the genre of this music?",
            "Thank you, that is all I need."
        ],
        "system_utterance": [
            "Would you like a shared ride, and where will you be heading to?",
            "How many people will you be travelling with?",
            "Please confirm your booking for 1 on the shared ride to 310 Sutter Street 4th Floor.",
            "Your booking has been made and your taxi is on its way!",
            "There are 10 songs which you may like, how about Burn by Ellie Goulding in the album Halcyon?",
            "It was released in 2012.",
            "It is a pop song!",
            "Sure, there are 2 songs, would you like No More Sad Songs by Little Mix in the album Glory Days?",
            "How about Power by Little Mix in the album Glory Days?",
            "Would you like me to play the song for you?",
            "Please confirm your request to play Power on the TV.",
            "Enjoy! This is a pop song.",
            "No worries, enjoy your music!"
        ]
    },
    {
        "dialogue_id": "16_00106",
        "service": "RideSharing_1",
        "service_call": {
            "method": {
                "method": "PlaySong",
                "parameters": {
                    "playback_device": "Bedroom speaker",
                    "song_name": "Colder Weather"
                }
            }
        },
        "user_utterance": [
            "Will you call a cab for 1 to 240 Castro Street?",
            "Yes, a shared ride to 3205 Northwood Drive.",
            "Cool.",
            "Cost and duration?",
            "Thanks.",
            "Will you find songs?",
            "Genre?",
            "From one years back?",
            "Cool. Will you play it?",
            "Play it on Kitchen speaker.",
            "On my bedroom speaker instead.",
            "That's right.",
            "Thanks."
        ],
        "system_utterance": [
            "A shared ride?",
            "Please confirm 1 shared ride to 3205 Northwood Drive.",
            "Your ride is on its way.",
            "Around 10 minutes for $15.81.",
            "Anything else?",
            "Colder Weather by Zac Brown Band from the album Pass The Jar.",
            "Country.",
            "From 2010.",
            "Please confirm Colder Weather playing on TV.",
            "Please confirm Colder Weather playing on Kitchen speaker.",
            "Please confirm Colder Weather playing on Bedroom speaker.",
            "Enjoy!",
            "Have a wonderful day."
        ]
    },
    {
        "dialogue_id": "16_00107",
        "service": "RideSharing_1",
        "service_call": {
            "method": {
                "method": "PlaySong",
                "parameters": {
                    "playback_device": "TV",
                    "song_name": "Lahnga Lasar Ke"
                }
            }
        },
        "user_utterance": [
            "Help me please to call a cab.",
            "A shared ride is okay.I need to go at 111 South Murphy Avenue.",
            "Is for one people.",
            "Yes that's good for me.",
            "Thank you for all.I want to search for songs please.",
            "Something else you have?",
            "Is from 2011?",
            "Perfect, I like this one.",
            "Yes.Will be great.",
            "Yes is perfect.",
            "Thanks.That's all."
        ],
        "system_utterance": [
            "Tell me where is the ride to and if you want a shared ride.",
            "For how many people is the cab for?",
            "You want a cab for 1 people to go to 111 South Murphy Avenue.A shared ride will be great for you.You agree?",
            "The ride is booked and the cab is on its way.",
            "What is your opinion about the song Pyramid by Jake Zyrus from album Charice?",
            "Would you like Lahnga Lasar Ke by Shailesh Premi in album Maza Mar Liya Dhori Ke Niche?",
            "The song is from 2019.",
            "You want to listen this song?",
            "Play on TV the song Lahnga Lasar Ke .Is okay?",
            "Enjoy the music!",
            "Have a great day!"
        ]
    },
    {
        "dialogue_id": "16_00108",
        "service": "RideSharing_1",
        "service_call": {
            "method": {
                "method": "PlaySong",
                "parameters": {
                    "playback_device": "TV",
                    "song_name": "Light It Up"
                }
            }
        },
        "user_utterance": [
            "I want a cab.",
            "It is for 1 and shared is ok to Galeto Brazilian Steakhouse.",
            "Yes, how long and how much?",
            "I want to find songs.",
            "Yes, cast it on display.",
            "That is correct",
            "That is all I need"
        ],
        "system_utterance": [
            "Where to, how many and is shared ok?",
            "Confirm 1 shared ride to to Galeto Brazilian Steakhouse",
            "21 minutes and is $14.48 and on way.",
            "How about Light It up by Major Lazer in Essentials?",
            "Confirm Light it up on TV.",
            "Enjoy the song.",
            "Enjoy the song."
        ]
    },
    {
        "dialogue_id": "16_00109",
        "service": "RideSharing_1",
        "service_call": {
            "method": {
                "method": "PlaySong",
                "parameters": {
                    "playback_device": "Bedroom speaker",
                    "song_name": "Laila Main Laila"
                }
            }
        },
        "user_utterance": [
            "Will you find a cab?",
            "A shared ride for two to 139 Petaluma Boulevard North B.",
            "Nice. Cost?",
            "Thanks. Will you find songs from 2017?",
            "Anything else?",
            "Any South Asia songs from the album Raees?",
            "Cool. Play it.",
            "Play it on speaker in the bedroom.",
            "That's right.",
            "Thanks."
        ],
        "system_utterance": [
            "A shared ride to where and for how many?",
            "Please confirm a shared ride for 2 to 139 Petaluma Boulevard North B.",
            "$16.14. Your ride is on its way.",
            "Airplane Mode by Limbo from the album Holo.",
            "All On Me by Devin Dawson from the album Dark Horse.",
            "Laila Main Laila by Pavni Pandey from the album Raees.",
            "Please confirm Laila Main Laila playing on TV.",
            "Please confirm Laila Main Laila playing on Bedroom speaker.",
            "Enjoy.",
            "Have a wonderful day."
        ]
    },
    {
        "dialogue_id": "16_00110",
        "service": "RideSharing_1",
        "service_call": {
            "method": {
                "method": "PlaySong",
                "parameters": {
                    "playback_device": "TV",
                    "song_name": "Are You Ready"
                }
            }
        },
        "user_utterance": [
            "Could you help me get a cab?",
            "I'm headed to Ohgane Korean Bbq & Cuisine.",
            "It's for 2. A shared ride should be ok.",
            "Sounds good.",
            "I want to find songs now.",
            "What else is available?",
            "That sounds cool. I'd like to listen to that.",
            "Sounds good. What is the music genre?",
            "Thanks so much.",
            "No, that's all."
        ],
        "system_utterance": [
            "Where are you going?",
            "Would you like a shared ride?",
            "Could you confirm that you want to go to Ohgane Korean Bbq & Cuisine for 2 and that you would like a shared ride?",
            "The cab has been booked and is on its way.",
            "I have 10 songs for you. What about Lotus Flower by Radiohead in The King of Limbs?",
            "How about Are You Ready by Disturbed in their album Evolution?",
            "So you want to play Are You Ready on the TV?",
            "It's a rock song. Please enjoy.",
            "Could I assist with anything else?",
            "Have a great day."
        ]
    },
    {
        "dialogue_id": "16_00111",
        "service": "RideSharing_1",
        "service_call": {
            "method": {
                "method": "PlaySong",
                "parameters": {
                    "playback_device": "TV",
                    "song_name": "Night"
                }
            }
        },
        "user_utterance": [
            "I'd like to get a cab.",
            "I'm going to 1200 Callowhill Street.",
            "It's just 1 person. A shared ride is fine.",
            "That's right. What's the trip duration and cost?",
            "Thanks for the cab. Can you look for songs while I wait please.",
            "What's the genre? Was it released in 2010?",
            "Okay, nice. Put it on.",
            "Yeah, that's fine.",
            "Thanks so much.",
            "No, thanks again."
        ],
        "system_utterance": [
            "Where are you going?",
            "Would like a shared ride? How many passengers are there?",
            "I'll get you a shared ride cab for 1 passenger to 1200 Callowhill Street, is that right?",
            "The cab has been called and it's on route. The trip will be around 23 minutes and the cost is $9.22.",
            "There are 10 songs that fit. How about Night by Ludovico Einaudi from the album Elements?",
            "It's from the Classical genre, and it was released in 2015.",
            "I'll play Night on the TV, is that okay?",
            "Enjoy the song.",
            "Do you need me for anything else?",
            "Have a pleasant day."
        ]
    },
    {
        "dialogue_id": "16_00112",
        "service": "RideSharing_1",
        "service_call": {
            "method": {
                "method": "PlaySong",
                "parameters": {
                    "playback_device": "TV",
                    "song_name": "Barefoot In The Park"
                }
            }
        },
        "user_utterance": [
            "Call a cab.",
            "Las Casas de San Pedro Apartments.",
            "Shared ride for 1.",
            "Yep.",
            "Thanks. Search songs from '19 off the Assume Form album.",
            "Yes.",
            "Play it.",
            "Yep.",
            "Thanks, bye."
        ],
        "system_utterance": [
            "Destination?",
            "Shared ride? Number of passengers?",
            "Please confirm: shared ride for 1 to Las Casas de San Pedro Apartments..",
            "It's booked and arriving soon.",
            "I found 2 songs. How about Barefoot in the Park by James Blake from Assume Form?",
            "Anything else I can do for you?",
            "Please confirm: play Barefoot In the Park on tv.",
            "Playing now.",
            "Bye."
        ]
    },
    {
        "dialogue_id": "16_00113",
        "service": "Weather_1",
        "service_call": {
            "method": {
                "method": "PlaySong",
                "parameters": {
                    "playback_device": "Kitchen speaker",
                    "song_name": "Rats"
                }
            }
        },
        "user_utterance": [
            "What is the weather forecast in Atherton on 13th of March?",
            "Okay. I'd like to search for songs now.",
            "Yes, that's the one. I want to listen to it now.",
            "No. Cast it to my bedroom instead.",
            "Sorry, changed rooms. Cast it on my kitchen speaker.",
            "Yes, go ahead. Is that from nine years ago?",
            "What kind of music is that?",
            "Thanks, that's all."
        ],
        "system_utterance": [
            "The forecast average temperature for the day will be 80 degrees Fahrenheit, with an 11 percent chance of rain.",
            "I have 10 songs for you. What do you think about Rats by Ghost, from the album Prequelle.",
            "Please confirm: you are playing the song Rats on the TV.",
            "Please confirm: you are playing the song Rats on the bedroom speaker.",
            "Please confirm: you are playing the song Rats on the kitchen speaker.",
            "The song is from the year 2018. Enjoy your music.",
            "It is a metal song.",
            "Have a good day."
        ]
    },
    {
        "dialogue_id": "16_00114",
        "service": "Weather_1",
        "service_call": {
            "method": {
                "method": "PlaySong",
                "parameters": {
                    "artist": "Kozoria",
                    "playback_device": "Bedroom speaker",
                    "song_name": "Worst Ends"
                }
            }
        },
        "user_utterance": [
            "Can you check the weather in Bodega Bay on Wednesday next week?",
            "How windy will it be?",
            "Okay, what about on the 9th of March?",
            "Okay, thank you. Can you find me a song now? I want a Rock song by Kozoria, maybe on the album K.",
            "Yes, that's perfect.",
            "Sure!",
            "No, play it on my Kitchen speaker.",
            "No, play it in my bedroom.",
            "Yes, that's correct.",
            "Thanks! That's all I need."
        ],
        "system_utterance": [
            "The average temp that day is 82 degrees with a 19 percent chance of rain.",
            "Wind is estimated at 5 miles per hour.",
            "The average temp that day is 74 degrees with a 14 percent chance of rain.",
            "How about Worst Ends by Kozoria on the album K?",
            "Would you like to play this song now?",
            "Okay, I am playing Worst Ends on the TV. Is this correct?",
            "Okay, I am playing Worst Ends on the Kitchen speaker, correct?",
            "Okay, playing Worst Ends on your Bedroom speaker. Is this correct?",
            "Enjoy your music!",
            "Have a great day!"
        ]
    },
    {
        "dialogue_id": "16_00115",
        "service": "Weather_1",
        "service_call": {
            "method": {
                "method": "PlaySong",
                "parameters": {
                    "playback_device": "Bedroom speaker",
                    "song_name": "Change Your Life"
                }
            }
        },
        "user_utterance": [
            "check next friday",
            "it is millbrae",
            "sure then okay",
            "speaker in the bedroom",
            "yes that is right",
            "what kind then?",
            "thanks a lot"
        ],
        "system_utterance": [
            "what city then?",
            "92 degrees 0 percent",
            "change your life iggy azalea 10 songs the new classic",
            "change your life bedroom speaker",
            "enjoy it now",
            "it is 2013 pop song",
            "have a good one"
        ]
    },
    {
        "dialogue_id": "16_00116",
        "service": "Weather_1",
        "service_call": {
            "method": {
                "method": "PlaySong",
                "parameters": {
                    "artist": "Skillet",
                    "playback_device": "Kitchen speaker",
                    "song_name": "The Resistance"
                }
            }
        },
        "user_utterance": [
            "I'd like to know the Newark forecast on the 10th please.",
            "Thanks. Now I want to find a song to listen to.",
            "How about a song by Skillet?",
            "What genre is that?",
            "From what year?",
            "Okay, sounds good.",
            "Yes, on my tv please.",
            "Sorry, play it on the kitchen device please.",
            "Thank you so much.",
            "I guess I'm all set.",
            "No, thanks again."
        ],
        "system_utterance": [
            "The temperature will average 92 degrees Fahrenheit with a 16 percent rain possibility that day.",
            "Would you like to hear the Frank Ocean song Nights from the Blonde album?",
            "How about the song The Resistance from the album Unleashed Beyond by Skillet?",
            "It's rock and roll.",
            "It was released in 2016.",
            "Shall I play it for you now?",
            "Confirming playback of The Resistance on the TV device.",
            "Confirming playback of The Resistance on the kitchen speaker now.",
            "You're very welcome.",
            "Anything else today?",
            "It's my pleasure."
        ]
    },
    {
        "dialogue_id": "16_00117",
        "service": "Weather_1",
        "service_call": {
            "method": {
                "method": "PlaySong",
                "parameters": {
                    "playback_device": "Bedroom speaker",
                    "song_name": "Love Will Remember"
                }
            }
        },
        "user_utterance": [
            "Hi, could you help me check the weather in Foster City please.",
            "What is the expected humidity and windiness there?",
            "Sure, could you help me search for some nice songs please?",
            "Sure, that is what I'm looking for.",
            "Could you play the music please?",
            "Could you play it on the kitchen device instead?",
            "Could you play it on my bedroom speaker instead?",
            "Yes, that is fine with me.",
            "What is the music genre and when was it released?",
            "Sure, that is all I need."
        ],
        "system_utterance": [
            "It is currently 80 degrees Fahrenheit and there is a 22 percent chance of rain.",
            "The humidity is around 38 percent and the wind speed is 8 miles per hour.",
            "There are 10 available songs, how about Love Will Remember by Selena Gomez in her album Stars Dance?",
            "Could I further assist you?",
            "Please confirm your request to play Love Will Remember on the Tv.",
            "Sure, please confirm your request to play Love Will Remember on the Kitchen Speaker",
            "Sure, please confirm your request to play Love Will Remember on the Bedroom Speaker.",
            "Enjoy listening to your music!",
            "This is a Pop song released in 2013.",
            "Have a great day ahead!"
        ]
    },
    {
        "dialogue_id": "16_00118",
        "service": "Weather_1",
        "service_call": {
            "method": {
                "method": "PlaySong",
                "parameters": {
                    "playback_device": "Kitchen speaker",
                    "song_name": "First True Love"
                }
            }
        },
        "user_utterance": [
            "I need to check the weather on the 12th of March.",
            "The city of Novato on the 6th of this month.",
            "Okay, then I would like to search for songs. There are many good songs in the album Love Town. I want to hear some older stuff from like eight years back. I love Reggae.",
            "Yeah, that's it!",
            "Yeah, and I want to hear it from the speaker in the kitchen.",
            "Yes, that's it.",
            "Thanks so much!",
            "No. Thank you!"
        ],
        "system_utterance": [
            "in which city would you like to see weather for?",
            "The average temperature for that day is predicted to be around 71 degrees Fahrenheit. There is also a 20 percent chance of rain.",
            "I have found 1 song which matches your selection. The song is titled First True Love by Kolohe Kai from the album Love Town.",
            "Would you like to play this song now?",
            "Please confirm the following information: Play the song First True Love on the Kitchen speaker.",
            "Enjoy your music.",
            "Of course. Is there anything else that I may help you with?",
            "Of course. Have a wonderful day."
        ]
    },
    {
        "dialogue_id": "16_00119",
        "service": "Weather_1",
        "service_call": {
            "method": {
                "method": "PlaySong",
                "parameters": {
                    "playback_device": "Kitchen speaker",
                    "song_name": "I Lived It"
                }
            }
        },
        "user_utterance": [
            "Can you check the weather for me?",
            "Check Gilroy on the 3rd of March.",
            "Thanks. I'd like to look for a song now.",
            "Yes, I like that one.",
            "Yes, please play it on the speaker in the kitchen.",
            "Yes. Is this song from 2012?",
            "I will, thanks.",
            "No thanks. I'm good."
        ],
        "system_utterance": [
            "In what city",
            "The temperature is expected to average 86 degrees with a 7 percent chance of rain.",
            "I found 10 songs. Would you like to hear I Lived It from the album Texoma Shore by Blake Shelton?",
            "Shall I play it now?",
            "You would like me to play I Lived It on the Kitchen speaker. Is that correct?",
            "No it's from 2017. Enjoy the music.",
            "Is there anything else I can do for you?",
            "Have a great day."
        ]
    },
    {
        "dialogue_id": "16_00120",
        "service": "Weather_1",
        "service_call": {
            "method": {
                "method": "PlaySong",
                "parameters": {
                    "artist": "Ruth B",
                    "playback_device": "TV",
                    "song_name": "Superficial Love"
                }
            }
        },
        "user_utterance": [
            "I would like to know the weather in Tiburon on 9th of March.",
            "Sure. How about the weather in San Rafael?",
            "How windy and humid is it gonna be?",
            "Okay. I'd like to search for songs by Ruth B. I like the Safe Haven album and I prefer Pop songs.",
            "Is it from '11 album?",
            "Yes. That's it. I want to listen to it. Please cast it on my display.",
            "Yes. That is right.",
            "Thanks a lot.",
            "No. That's all. Thanks!"
        ],
        "system_utterance": [
            "82 degrees Farenheit is the average temperature for the day. The chance of rain is 27 percent.",
            "90 degrees Farenheit is the average temperature for the day. The chance of rain is 9 percent.",
            "25 percent is the humidity and it should be 10 miles per hour for the wind speed.",
            "How about the Superficial Love by Ruth B in the Safe Haven album?",
            "It's from 2015.",
            "Please verify the details: Play the song on TV, the Superficial Love.",
            "Hope you enjoy it.",
            "Will there be anything else?",
            "Have a great day."
        ]
    },
    {
        "dialogue_id": "16_00121",
        "service": "Weather_1",
        "service_call": {
            "method": {
                "method": "PlaySong",
                "parameters": {
                    "artist": "Ariana Grande",
                    "playback_device": "Bedroom speaker",
                    "song_name": "Be My Baby"
                }
            }
        },
        "user_utterance": [
            "What is the weather in East Palo Alto?",
            "Can you find me some Ariana Grande songs? Find something from five years back from the album My Everything.",
            "What genre is it?",
            "That's the song.",
            "I want to listen to some music.",
            "No, play it on my bedroom.",
            "Yes, that is correct.",
            "Thanks! That's all for now."
        ],
        "system_utterance": [
            "The temperature should be around 92 degrees Fahrenheit with a 19 percent chance of rain.",
            "How about Be My Baby? It is from the Ariana Grande album My Everything.",
            "It is a Pop song.",
            "Can I help you with anything else?",
            "Confirming that you want me to play Be My Baby on the TV?",
            "Confirming that you want to play Be My Baby on the Bedroom speaker?",
            "I hope you enjoy your music.",
            "You're welcome. Have a good day."
        ]
    },
    {
        "dialogue_id": "16_00122",
        "service": "Weather_1",
        "service_call": {
            "method": {
                "method": "PlaySong",
                "parameters": {
                    "artist": "Zayn Malik",
                    "playback_device": "Kitchen speaker",
                    "song_name": "Dusk Till Dawn"
                }
            }
        },
        "user_utterance": [
            "What's the weather going to be like in Pescadero on the 1st of March?",
            "Ok. Play me some music. How about a pop song by Zayn Malik from two years ago?",
            "Yes, play that one",
            "No, I want it on my kitchen device",
            "Yes play it",
            "Thanks so much. Appreciate it."
        ],
        "system_utterance": [
            "The forecast average temperature is 86 degrees Fahrenheit with a 0 percent chance of rain.",
            "I found 2 songs. How about Zayn Malik 's Dusk Till Dawn? It's from the album Icarus Falls.",
            "Please confirm: playing Dusk Till Dawn on your TV",
            "Please confirm: playing Dusk Till Dawn on your kitchen speaker",
            "Enjoy the song",
            "Take care"
        ]
    },
    {
        "dialogue_id": "16_00123",
        "service": "Weather_1",
        "service_call": {
            "method": {
                "method": "PlaySong",
                "parameters": {
                    "playback_device": "TV",
                    "song_name": "Gold"
                }
            }
        },
        "user_utterance": [
            "I want to check the weather for Tuesday next week.",
            "I want to know the weather in Montara.",
            "What is the wind and humidity going to be like?",
            "Okay, thanks.",
            "I'd like to search for songs.",
            "Is the song from nine years back?",
            "What other songs are there? I want something from the album Built on Glass from five years back.",
            "What type of song is it?",
            "Yes, that is the one! I'd like to listen to it.",
            "Yes, that is right.",
            "Thank you, that is all I needed."
        ],
        "system_utterance": [
            "What location do you want to check the weather?",
            "The average temperature in Montara should be 87 degrees Fahrenheit with a 2 percent chance of rain.",
            "The wind should be around 3 miles per hour and the humidity around 16 percent.",
            "Is there anything else you need?",
            "I found 10 songs for you. How about the song Dean Town by Vulfpeck from the album The Beautiful Game?",
            "No, it is from 2016.",
            "I found 1 song for you. It is Gold by Nick Murphy from the album Built on Glass.",
            "It is an electronica song.",
            "Okay, confirm these details. You want to play the song Gold on the TV.",
            "I have started playing the song, enjoy!",
            "Have a great day."
        ]
    },
    {
        "dialogue_id": "16_00124",
        "service": "Weather_1",
        "service_call": {
            "method": {
                "method": "PlaySong",
                "parameters": {
                    "playback_device": "TV",
                    "song_name": "All On Me"
                }
            }
        },
        "user_utterance": [
            "Hi there, may I know how is the weather like at ATL?",
            "Could you help me search for songs from two years back too?",
            "Are there any alternative songs?",
            "What is the genre of this song?",
            "Sure, could you play this for me please?",
            "That is fine with me.",
            "Thank you, that is all I need."
        ],
        "system_utterance": [
            "The weather is 86 degress Fahrenheit with a 28 percent chance of rain!",
            "Sure, there are 10 available songs, would you like to listen to Airplane Mode by Limbo in the album Holo?",
            "How about All On Me by Devin Dawson in the Dark Horse album?",
            "It is a country song.",
            "Please confirm your action to play All On Me on the TV.",
            "Enjoy your music!",
            "Sure, have a great day ahead!"
        ]
    },
    {
        "dialogue_id": "16_00125",
        "service": "Weather_1",
        "service_call": {
            "method": {
                "method": "PlaySong",
                "parameters": {
                    "playback_device": "TV",
                    "song_name": "Adrenalize"
                }
            }
        },
        "user_utterance": [
            "I want to find weather on the 4th of this month.",
            "Check Glen Ellen.",
            "How windy will it be?",
            "Okay. I'd like to find some songs for now. There are good songs in the album Blood. I want something from seven years ago.",
            "What sort of music is it?",
            "Okay. I'd like to listen to music. Put it on my television.",
            "Sounds right.",
            "Thanks! That's it."
        ],
        "system_utterance": [
            "What city do you want to check in?",
            "The temperature for the day should be 90 degrees Fahrenheit and there is a 15 percent chance of rain.",
            "The wind speed on average will be 11 miles per hour.",
            "How about Adrenalize by In This Moment on Blood",
            "It's a Metalcore song.",
            "Could you confirm that I should play Adrenalize on the TV?",
            "Enjoy.",
            "Have a great day."
        ]
    },
    {
        "dialogue_id": "16_00126",
        "service": "Weather_1",
        "service_call": {
            "method": {
                "method": "PlaySong",
                "parameters": {
                    "artist": "Cody Johnson",
                    "playback_device": "TV",
                    "song_name": "With You I Am"
                }
            }
        },
        "user_utterance": [
            "I want to know how the weather will be in Duncans Mills for next Thursday.",
            "Alirght, fine. Now I want to find some songs. I would enjoy listening to songs by Cody Johnson. I usually like listening to Country songs.",
            "That is the song I want.",
            "Yes. I want you to cast the song on my television.",
            "Yes, that is right.",
            "I appreciate it! That would be all."
        ],
        "system_utterance": [
            "The average temperature for your requested location should be 87 degrees Fahrenheit, and with a chance of raining of 13 percent.",
            "There is 1 song which you might like. How would you like to listen to With You I Am by Cody Johnson from the album Gotta Be Me.",
            "Do you want this song to start playing now?",
            "Can you please confirm that you want the song With You I am to be cast on TV.",
            "Enjoy your time listening to the song.",
            "Have a wonderful time!"
        ]
    },
    {
        "dialogue_id": "16_00127",
        "service": "Weather_1",
        "service_call": {
            "method": {
                "method": "PlaySong",
                "parameters": {
                    "playback_device": "TV",
                    "song_name": "Wine For Me"
                }
            }
        },
        "user_utterance": [
            "Whats the weather supposed to be on the 12th?",
            "Check in Calistoga.",
            "Great, find out how windy it will be.",
            "Thanks, let's pull up some music now.",
            "No, not that one, what else can you suggest?",
            "Maybe, what kind of music is that and what year did it come out?",
            "Yes, that sounds fun.",
            "Sure, go ahead.",
            "Yes, go ahead.",
            "Thanks, Good bye."
        ],
        "system_utterance": [
            "Which city are we checking the weather for ?",
            "Alright, I show should be 80 degrees with 0 percent chance of rain.",
            "The average wind factor is 9 miles per hour.",
            "Ok, what are you in the mood for? Or if you would like, I can suggest Shy by Jai Waetford off the Heart Miles.",
            "How about Wine For Me by Popcaan off the Forever album.",
            "This is a Reggae hit from 2018.",
            "Great, should I play this song now?",
            "Please confirm we are going to play Wine For Me on the TV. Is that correct?",
            "Great, enjoy your selection.",
            "Your welcome, Good bye."
        ]
    }
]